[
    {
        "title": "A Multi-Player Potential Game Approach for Sensor Network Localization with Noisy Measurements",
        "authors": "Gehui XuGuanpu ChenBaris FidanYiguang HongHongsheng QiThomas ParisiniKarl H. Johansson",
        "links": "http://arxiv.org/abs/2407.04608v1",
        "entry_id": "http://arxiv.org/abs/2407.04608v1",
        "pdf_url": "http://arxiv.org/pdf/2407.04608v1",
        "summary": "Sensor network localization (SNL) is a challenging problem due to its\ninherent non-convexity and the effects of noise in inter-node ranging\nmeasurements and anchor node position. We formulate a non-convex SNL problem as\na multi-player non-convex potential game and investigate the existence and\nuniqueness of a Nash equilibrium (NE) in both the ideal setting without\nmeasurement noise and the practical setting with measurement noise. We first\nshow that the NE exists and is unique in the noiseless case, and corresponds to\nthe precise network localization. Then, we study the SNL for the case with\nerrors affecting the anchor node position and the inter-node distance\nmeasurements. Specifically, we establish that in case these errors are\nsufficiently small, the NE exists and is unique. It is shown that the NE is an\napproximate solution to the SNL problem, and that the position errors can be\nquantified accordingly. Based on these findings, we apply the results to case\nstudies involving only inter-node distance measurement errors and only anchor\nposition information inaccuracies.",
        "updated": "2024-07-05 16:00:19 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.04608v1"
    },
    {
        "title": "When LLMs Play the Telephone Game: Cumulative Changes and Attractors in Iterated Cultural Transmissions",
        "authors": "Jérémy PerezCorentin LégerGrgur KovačCédric ColasGaia MolinaroMaxime DerexPierre-Yves OudeyerClément Moulin-Frier",
        "links": "http://arxiv.org/abs/2407.04503v1",
        "entry_id": "http://arxiv.org/abs/2407.04503v1",
        "pdf_url": "http://arxiv.org/pdf/2407.04503v1",
        "summary": "As large language models (LLMs) start interacting with each other and\ngenerating an increasing amount of text online, it becomes crucial to better\nunderstand how information is transformed as it passes from one LLM to the\nnext. While significant research has examined individual LLM behaviors,\nexisting studies have largely overlooked the collective behaviors and\ninformation distortions arising from iterated LLM interactions. Small biases,\nnegligible at the single output level, risk being amplified in iterated\ninteractions, potentially leading the content to evolve towards attractor\nstates. In a series of telephone game experiments, we apply a transmission\nchain design borrowed from the human cultural evolution literature: LLM agents\niteratively receive, produce, and transmit texts from the previous to the next\nagent in the chain. By tracking the evolution of text toxicity, positivity,\ndifficulty, and length across transmission chains, we uncover the existence of\nbiases and attractors, and study their dependence on the initial text, the\ninstructions, language model, and model size. For instance, we find that more\nopen-ended instructions lead to stronger attraction effects compared to more\nconstrained tasks. We also find that different text properties display\ndifferent sensitivity to attraction effects, with toxicity leading to stronger\nattractors than length. These findings highlight the importance of accounting\nfor multi-step transmission dynamics and represent a first step towards a more\ncomprehensive understanding of LLM cultural dynamics.",
        "updated": "2024-07-05 13:44:09 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.04503v1"
    },
    {
        "title": "Solving Zebra Puzzles Using Constraint-Guided Multi-Agent Systems",
        "authors": "Shmuel BermanBaishakhi RayKathleen McKeown",
        "links": "http://arxiv.org/abs/2407.03956v1",
        "entry_id": "http://arxiv.org/abs/2407.03956v1",
        "pdf_url": "http://arxiv.org/pdf/2407.03956v1",
        "summary": "Prior research has enhanced the ability of Large Language Models (LLMs) to\nsolve logic puzzles using techniques such as chain-of-thought prompting or\nintroducing a symbolic representation. These frameworks are still usually\ninsufficient to solve complicated logical problems, such as Zebra puzzles, due\nto the inherent complexity of translating natural language clues into logical\nstatements. We introduce a multi-agent system, ZPS, that integrates LLMs with\nan off the shelf theorem prover. This system tackles the complex puzzle-solving\ntask by breaking down the problem into smaller, manageable parts, generating\nSMT (Satisfiability Modulo Theories) code to solve them with a theorem prover,\nand using feedback between the agents to repeatedly improve their answers. We\nalso introduce an automated grid puzzle grader to assess the correctness of our\npuzzle solutions and show that the automated grader is reliable by evaluating\nit in a user-study. Our approach shows improvement in all three LLMs we tested,\nwith GPT-4 showing 166% improvement in the number of fully correct solutions.",
        "updated": "2024-07-04 14:22:25 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.03956v1"
    },
    {
        "title": "A multi-objective combinatorial optimisation framework for large scale hierarchical population synthesis",
        "authors": "Imran MahmoodNicholas BishopAnisoara CalinescuMichael WooldridgeIoannis Zachos",
        "links": "http://arxiv.org/abs/2407.03180v1",
        "entry_id": "http://arxiv.org/abs/2407.03180v1",
        "pdf_url": "http://arxiv.org/pdf/2407.03180v1",
        "summary": "In agent-based simulations, synthetic populations of agents are commonly used\nto represent the structure, behaviour, and interactions of individuals.\nHowever, generating a synthetic population that accurately reflects real\npopulation statistics is a challenging task, particularly when performed at\nscale. In this paper, we propose a multi objective combinatorial optimisation\ntechnique for large scale population synthesis. We demonstrate the\neffectiveness of our approach by generating a synthetic population for selected\nregions and validating it on contingency tables from real population data. Our\napproach supports complex hierarchical structures between individuals and\nhouseholds, is scalable to large populations and achieves minimal contigency\ntable reconstruction error. Hence, it provides a useful tool for policymakers\nand researchers for simulating the dynamics of complex populations.",
        "updated": "2024-07-03 15:01:12 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.03180v1"
    },
    {
        "title": "Wildfire Autonomous Response and Prediction Using Cellular Automata (WARP-CA)",
        "authors": "Abdelrahman Ramadan",
        "links": "http://arxiv.org/abs/2407.02613v1",
        "entry_id": "http://arxiv.org/abs/2407.02613v1",
        "pdf_url": "http://arxiv.org/pdf/2407.02613v1",
        "summary": "Wildfires pose a severe challenge to ecosystems and human settlements,\nexacerbated by climate change and environmental factors. Traditional wildfire\nmodeling, while useful, often fails to adapt to the rapid dynamics of such\nevents. This report introduces the (Wildfire Autonomous Response and Prediction\nUsing Cellular Automata) WARP-CA model, a novel approach that integrates\nterrain generation using Perlin noise with the dynamism of Cellular Automata\n(CA) to simulate wildfire spread. We explore the potential of Multi-Agent\nReinforcement Learning (MARL) to manage wildfires by simulating autonomous\nagents, such as UAVs and UGVs, within a collaborative framework. Our\nmethodology combines world simulation techniques and investigates emergent\nbehaviors in MARL, focusing on efficient wildfire suppression and considering\ncritical environmental factors like wind patterns and terrain features.",
        "updated": "2024-07-02 19:01:59 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.02613v1"
    }
]