[
    {
        "title": "Asynchronous Credit Assignment Framework for Multi-Agent Reinforcement Learning",
        "authors": "Yongheng LiangHejun WuHaitao WangHao Cai",
        "links": "http://arxiv.org/abs/2408.03692v1",
        "entry_id": "http://arxiv.org/abs/2408.03692v1",
        "pdf_url": "http://arxiv.org/pdf/2408.03692v1",
        "summary": "Credit assignment is a core problem that distinguishes agents' marginal\ncontributions for optimizing cooperative strategies in multi-agent\nreinforcement learning (MARL). Current credit assignment methods usually assume\nsynchronous decision-making among agents. However, a prerequisite for many\nrealistic cooperative tasks is asynchronous decision-making by agents, without\nwaiting for others to avoid disastrous consequences. To address this issue, we\npropose an asynchronous credit assignment framework with a problem model called\nADEX-POMDP and a multiplicative value decomposition (MVD) algorithm. ADEX-POMDP\nis an asynchronous problem model with extra virtual agents for a decentralized\npartially observable markov decision process. We prove that ADEX-POMDP\npreserves both the task equilibrium and the algorithm convergence. MVD utilizes\nmultiplicative interaction to efficiently capture the interactions of\nasynchronous decisions, and we theoretically demonstrate its advantages in\nhandling asynchronous tasks. Experimental results show that on two asynchronous\ndecision-making benchmarks, Overcooked and POAC, MVD not only consistently\noutperforms state-of-the-art MARL methods but also provides the\ninterpretability for asynchronous cooperation.",
        "updated": "2024-08-07 11:13:26 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.03692v1"
    },
    {
        "title": "Combining Diverse Information for Coordinated Action: Stochastic Bandit Algorithms for Heterogeneous Agents",
        "authors": "Lucia GordonEsther RolfMilind Tambe",
        "links": "http://arxiv.org/abs/2408.03405v1",
        "entry_id": "http://arxiv.org/abs/2408.03405v1",
        "pdf_url": "http://arxiv.org/pdf/2408.03405v1",
        "summary": "Stochastic multi-agent multi-armed bandits typically assume that the rewards\nfrom each arm follow a fixed distribution, regardless of which agent pulls the\narm. However, in many real-world settings, rewards can depend on the\nsensitivity of each agent to their environment. In medical screening, disease\ndetection rates can vary by test type; in preference matching, rewards can\ndepend on user preferences; and in environmental sensing, observation quality\ncan vary across sensors. Since past work does not specify how to allocate\nagents of heterogeneous but known sensitivity of these types in a stochastic\nbandit setting, we introduce a UCB-style algorithm, Min-Width, which aggregates\ninformation from diverse agents. In doing so, we address the joint challenges\nof (i) aggregating the rewards, which follow different distributions for each\nagent-arm pair, and (ii) coordinating the assignments of agents to arms.\nMin-Width facilitates efficient collaboration among heterogeneous agents,\nexploiting the known structure in the agents' reward functions to weight their\nrewards accordingly. We analyze the regret of Min-Width and conduct\npseudo-synthetic and fully synthetic experiments to study the performance of\ndifferent levels of information sharing. Our results confirm that the gains to\nmodeling agent heterogeneity tend to be greater when the sensitivities are more\nvaried across agents, while combining more information does not always improve\nperformance.",
        "updated": "2024-08-06 18:56:29 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.03405v1"
    },
    {
        "title": "Heterogeneous graph attention network improves cancer multiomics integration",
        "authors": "Sina TabakhiCharlotte VandermeulenIan SudberyHaiping Lu",
        "links": "http://arxiv.org/abs/2408.02845v1",
        "entry_id": "http://arxiv.org/abs/2408.02845v1",
        "pdf_url": "http://arxiv.org/pdf/2408.02845v1",
        "summary": "The increase in high-dimensional multiomics data demands advanced integration\nmodels to capture the complexity of human diseases. Graph-based deep learning\nintegration models, despite their promise, struggle with small patient cohorts\nand high-dimensional features, often applying independent feature selection\nwithout modeling relationships among omics. Furthermore, conventional\ngraph-based omics models focus on homogeneous graphs, lacking multiple types of\nnodes and edges to capture diverse structures. We introduce a Heterogeneous\nGraph ATtention network for omics integration (HeteroGATomics) to improve\ncancer diagnosis. HeteroGATomics performs joint feature selection through a\nmulti-agent system, creating dedicated networks of feature and patient\nsimilarity for each omic modality. These networks are then combined into one\nheterogeneous graph for learning holistic omic-specific representations and\nintegrating predictions across modalities. Experiments on three cancer\nmultiomics datasets demonstrate HeteroGATomics' superior performance in cancer\ndiagnosis. Moreover, HeteroGATomics enhances interpretability by identifying\nimportant biomarkers contributing to the diagnosis outcomes.",
        "updated": "2024-08-05 22:01:13 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.02845v1"
    },
    {
        "title": "Assessing the Effects of Container Handling Strategies on Enhancing Freight Throughput",
        "authors": "Sarita RattanakunuprakarnMingzhou JinMustafa Can CamurXueping Li",
        "links": "http://arxiv.org/abs/2408.02768v1",
        "entry_id": "http://arxiv.org/abs/2408.02768v1",
        "pdf_url": "http://arxiv.org/pdf/2408.02768v1",
        "summary": "As global supply chains and freight volumes grow, the U.S. faces escalating\ntransportation demands. The heavy reliance on road transport, coupled with the\nunderutilization of the railway system, results in congested highways,\nprolonged transportation times, higher costs, and increased carbon emissions.\nCalifornia's San Pedro Port Complex (SPPC), the nation's busiest, incurs a\nsignificant share of these challenges. We utilize an agent-based simulation to\nreplicate real-world scenarios, focusing on the intricacies of interactions in\na modified intermodal inbound freight system for the SPPC. This involves\nrelocating container classification to potential warehouses in California,\nUtah, Arizona, and Nevada, rather than exclusively at port areas. Our primary\naim is to evaluate the proposed system's efficiency, considering cost and\nfreight throughput, while also examining the effects of workforce shortages.\nComputational analysis suggests that strategically installing intermodal\ncapabilities in select warehouses can reduce transportation costs, boost\nthroughput, and foster resour",
        "updated": "2024-08-05 18:38:27 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.02768v1"
    },
    {
        "title": "ReDel: A Toolkit for LLM-Powered Recursive Multi-Agent Systems",
        "authors": "Andrew ZhuLiam DuganChris Callison-Burch",
        "links": "http://arxiv.org/abs/2408.02248v1",
        "entry_id": "http://arxiv.org/abs/2408.02248v1",
        "pdf_url": "http://arxiv.org/pdf/2408.02248v1",
        "summary": "Recently, there has been increasing interest in using Large Language Models\n(LLMs) to construct complex multi-agent systems to perform tasks such as\ncompiling literature reviews, drafting consumer reports, and planning\nvacations. Many tools and libraries exist for helping create such systems,\nhowever none support recursive multi-agent systems -- where the models\nthemselves flexibly decide when to delegate tasks and how to organize their\ndelegation structure. In this work, we introduce ReDel: a toolkit for recursive\nmulti-agent systems that supports custom tool-use, delegation schemes,\nevent-based logging, and interactive replay in an easy-to-use web interface. We\nshow that, using ReDel, we are able to achieve significant performance gains on\nagentic benchmarks and easily identify potential areas of improvements through\nthe visualization and debugging tools. Our code, documentation, and PyPI\npackage are open-source and free to use under the MIT license.",
        "updated": "2024-08-05 05:43:23 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.02248v1"
    }
]