[
    {
        "title": "#PoetsOfInstagram: Navigating The Practices And Challenges Of Novice Poets On Instagram",
        "authors": "Ankolika DeZhicong Lu",
        "links": "http://dx.doi.org/10.1145/1122445.1122456",
        "entry_id": "http://arxiv.org/abs/2402.19347v1",
        "pdf_url": "http://arxiv.org/pdf/2402.19347v1",
        "summary": "Commencing as a photo-sharing platform, Instagram has since become\nmultifaceted, accommodating diverse art forms, with poetry emerging as a\nprominent one. However, the academic understanding of Instagram's poetry\ncommunity is limited, yet its significance emerges from its distinctive\nutilization of a primarily visual social media platform guided by\nrecommendation algorithms for disseminating poetry, further characterized by a\npredominantly novice creative population. We employ qualitative analysis to\nexplore motivations, experiences, and algorithmic influence within Instagram's\npoetry community. We demonstrate that participants prioritize conforming to\nalgorithmic constraints for visibility, yet maintain their community's values\nof integrity and originality, illustrating the tension between algorithmic\ngrowth and participant authenticity. We introduce the concept of\nAlgorithmically Mediated Creative Labor, a phenomenon specific to\nnon-monetizing creative users who are impacted by the prioritization of\nprofessional creators and continually adapt their creative endeavors to align\nwith platform logic, thereby affecting their motivation and creative outputs.",
        "updated": "2024-02-29 16:55:44 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.19347v1"
    },
    {
        "title": "Seeking Soulmate via Voice: Understanding Promises and Challenges of Online Synchronized Voice-Based Mobile Dating",
        "authors": "Chenxinran ShenYan XuRay LCZhicong Lu",
        "links": "http://dx.doi.org/10.1145/3613904.3642860",
        "entry_id": "http://arxiv.org/abs/2402.19328v1",
        "pdf_url": "http://arxiv.org/pdf/2402.19328v1",
        "summary": "Online dating has become a popular way for individuals to connect with\npotential romantic partners. Many dating apps use personal profiles that\ninclude a headshot and self-description, allowing users to present themselves\nand search for compatible matches. However, this traditional model often has\nlimitations. In this study, we explore a non-traditional voice-based dating app\ncalled \"Soul\". Unlike traditional platforms that rely heavily on profile\ninformation, Soul facilitates user interactions through voice-based\ncommunication. We conducted semi-structured interviews with 18 dedicated Soul\nusers to investigate how they engage with the platform and perceive themselves\nand others in this unique dating environment. Our findings indicate that the\nrole of voice as a moderator influences impression management and shapes\nperceptions between the sender and the receiver of the voice. Additionally, the\nsynchronous voice-based and community-based dating model offers benefits to\nusers in the Chinese cultural context. Our study contributes to understanding\nthe affordances introduced by voice-based interactions in online dating in\nChina.",
        "updated": "2024-02-29 16:30:07 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.19328v1"
    },
    {
        "title": "DISCERN: Designing Decision Support Interfaces to Investigate the Complexities of Workplace Social Decision-Making With Line Managers",
        "authors": "Pranav KhadpeLindy LeKate NowakShamsi T. IqbalJina Suh",
        "links": "http://dx.doi.org/10.1145/3613904.3642685",
        "entry_id": "http://arxiv.org/abs/2402.19318v1",
        "pdf_url": "http://arxiv.org/pdf/2402.19318v1",
        "summary": "Line managers form the first level of management in organizations, and must\nmake complex decisions, while maintaining relationships with those impacted by\ntheir decisions. Amidst growing interest in technology-supported\ndecision-making at work, their needs remain understudied. Further, most\nexisting design knowledge for supporting social decision-making comes from\ndomains where decision-makers are more socially detached from those they decide\nfor. We conducted iterative design research with line managers within a\ntechnology organization, investigating decision-making practices, and\nopportunities for technological support. Through formative research,\ndevelopment of a decision-representation tool -- DISCERN -- and user\nenactments, we identify their communication and analysis needs that lack\nadequate support. We found they preferred tools for externalizing reasoning\nrather than tools that replace interpersonal interactions, and they wanted\ntools to support a range of intuitive and calculative decision-making. We\ndiscuss how design of social decision-making supports, especially in the\nworkplace, can more explicitly support highly interactional social\ndecision-making.",
        "updated": "2024-02-29 16:24:17 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.19318v1"
    },
    {
        "title": "CAPTURE-24: A large dataset of wrist-worn activity tracker data collected in the wild for human activity recognition",
        "authors": "Shing ChanHang YuanCatherine TongAidan AcquahAbram SchonfeldtJonathan GershunyAiden Doherty",
        "links": "http://arxiv.org/abs/2402.19229v1",
        "entry_id": "http://arxiv.org/abs/2402.19229v1",
        "pdf_url": "http://arxiv.org/pdf/2402.19229v1",
        "summary": "Existing activity tracker datasets for human activity recognition are\ntypically obtained by having participants perform predefined activities in an\nenclosed environment under supervision. This results in small datasets with a\nlimited number of activities and heterogeneity, lacking the mixed and nuanced\nmovements normally found in free-living scenarios. As such, models trained on\nlaboratory-style datasets may not generalise out of sample. To address this\nproblem, we introduce a new dataset involving wrist-worn accelerometers,\nwearable cameras, and sleep diaries, enabling data collection for over 24 hours\nin a free-living setting. The result is CAPTURE-24, a large activity tracker\ndataset collected in the wild from 151 participants, amounting to 3883 hours of\naccelerometer data, of which 2562 hours are annotated. CAPTURE-24 is two to\nthree orders of magnitude larger than existing publicly available datasets,\nwhich is critical to developing accurate human activity recognition models.",
        "updated": "2024-02-29 15:04:34 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.19229v1"
    },
    {
        "title": "Think Fast, Think Slow, Think Critical: Designing an Automated Propaganda Detection Tool",
        "authors": "Liudmila ZavolokinaKilian SprenkampZoya KatashinskayaDaniel Gordon JonesGerhard Schwabe",
        "links": "http://dx.doi.org/10.1145/3613904.3642805",
        "entry_id": "http://arxiv.org/abs/2402.19135v1",
        "pdf_url": "http://arxiv.org/pdf/2402.19135v1",
        "summary": "In today's digital age, characterized by rapid news consumption and\nincreasing vulnerability to propaganda, fostering citizens' critical thinking\nis crucial for stable democracies. This paper introduces the design of\nClarifAI, a novel automated propaganda detection tool designed to nudge readers\ntowards more critical news consumption by activating the analytical mode of\nthinking, following Kahneman's dual-system theory of cognition. Using Large\nLanguage Models, ClarifAI detects propaganda in news articles and provides\ncontext-rich explanations, enhancing users' understanding and critical\nthinking. Our contribution is threefold: first, we propose the design of\nClarifAI; second, in an online experiment, we demonstrate that this design\neffectively encourages news readers to engage in more critical reading; and\nthird, we emphasize the value of explanations for fostering critical thinking.\nThe study thus offers both a practical tool and useful design knowledge for\nmitigating propaganda in digital news.",
        "updated": "2024-02-29 13:12:31 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.19135v1"
    }
]