[
    {
        "title": "Ferret-UI: Grounded Mobile UI Understanding with Multimodal LLMs",
        "authors": "Keen YouHaotian ZhangEldon SchoopFloris WeersAmanda SwearnginJeffrey NicholsYinfei YangZhe Gan",
        "links": "http://arxiv.org/abs/2404.05719v1",
        "entry_id": "http://arxiv.org/abs/2404.05719v1",
        "pdf_url": "http://arxiv.org/pdf/2404.05719v1",
        "summary": "Recent advancements in multimodal large language models (MLLMs) have been\nnoteworthy, yet, these general-domain MLLMs often fall short in their ability\nto comprehend and interact effectively with user interface (UI) screens. In\nthis paper, we present Ferret-UI, a new MLLM tailored for enhanced\nunderstanding of mobile UI screens, equipped with referring, grounding, and\nreasoning capabilities. Given that UI screens typically exhibit a more\nelongated aspect ratio and contain smaller objects of interest (e.g., icons,\ntexts) than natural images, we incorporate \"any resolution\" on top of Ferret to\nmagnify details and leverage enhanced visual features. Specifically, each\nscreen is divided into 2 sub-images based on the original aspect ratio (i.e.,\nhorizontal division for portrait screens and vertical division for landscape\nscreens). Both sub-images are encoded separately before being sent to LLMs. We\nmeticulously gather training samples from an extensive range of elementary UI\ntasks, such as icon recognition, find text, and widget listing. These samples\nare formatted for instruction-following with region annotations to facilitate\nprecise referring and grounding. To augment the model's reasoning ability, we\nfurther compile a dataset for advanced tasks, including detailed description,\nperception/interaction conversations, and function inference. After training on\nthe curated datasets, Ferret-UI exhibits outstanding comprehension of UI\nscreens and the capability to execute open-ended instructions. For model\nevaluation, we establish a comprehensive benchmark encompassing all the\naforementioned tasks. Ferret-UI excels not only beyond most open-source UI\nMLLMs, but also surpasses GPT-4V on all the elementary UI tasks.",
        "updated": "2024-04-08 17:55:44 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.05719v1"
    },
    {
        "title": "Eye Tracking on Text Reading with Visual Enhancements",
        "authors": "Franziska HuthMaurice KochMiriam AwadDaniel WeiskopfKuno Kurzhals",
        "links": "http://dx.doi.org/10.1145/3649902.3653521",
        "entry_id": "http://arxiv.org/abs/2404.05572v1",
        "pdf_url": "http://arxiv.org/pdf/2404.05572v1",
        "summary": "The interplay between text and visualization is gaining importance for media\nwhere traditional text is enriched by visual elements to improve readability\nand emphasize facts. In two controlled eye-tracking experiments ($N=12$), we\napproach answers to the question: How do visualization techniques influence\nreading behavior? We compare plain text to that marked with highlights, icons,\nand word-sized data visualizations. We assess quantitative metrics~(eye\nmovement, completion time, error rate) and subjective feedback~(personal\npreference and ratings). The results indicate that visualization techniques,\nespecially in the first experiment, show promising trends for improved reading\nbehavior. The results also show the need for further research to make reading\nmore effective and inform suggestions for future studies.",
        "updated": "2024-04-08 14:49:26 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.05572v1"
    },
    {
        "title": "Interactive Formal Specification for Mathematical Problems of Engineers",
        "authors": "Walther Neuper",
        "links": "http://dx.doi.org/10.4204/EPTCS.400.8",
        "entry_id": "http://arxiv.org/abs/2404.05462v1",
        "pdf_url": "http://arxiv.org/pdf/2404.05462v1",
        "summary": "The paper presents the second part of a precise description of the prototype\nthat has been developed in the course of the ISAC project over the last two\ndecades. This part describes the \"specify-phase\", while the first part\ndescribing the \"solve-phase\" is already published.\n  In the specify-phase a student interactively constructs a formal\nspecification. The ISAC prototype implements formal specifications as\nestablished in theoretical computer science, however, the input language for\nthe construction avoids requiring users to have knowledge of logic; this makes\nthe system useful for various engineering faculties (and also for high school).\n  The paper discusses not only ISAC's design of the specify-phase in detail,\nbut also gives a brief introduction to implementation with the aim of\nadvertising the re-use of formal frameworks (inclusive respective front-ends)\nwith their generic tools for language definition and their rich pool of\nsoftware components for formal mathematics.",
        "updated": "2024-04-08 12:41:22 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.05462v1"
    },
    {
        "title": "Unlocking Adaptive User Experience with Generative AI",
        "authors": "Yutan HuangTanjila KanijAnuradha MadugallaShruti MahajanChetan AroraJohn Grundy",
        "links": "http://arxiv.org/abs/2404.05442v1",
        "entry_id": "http://arxiv.org/abs/2404.05442v1",
        "pdf_url": "http://arxiv.org/pdf/2404.05442v1",
        "summary": "Developing user-centred applications that address diverse user needs requires\nrigorous user research. This is time, effort and cost-consuming. With the\nrecent rise of generative AI techniques based on Large Language Models (LLMs),\nthere is a possibility that these powerful tools can be used to develop\nadaptive interfaces. This paper presents a novel approach to develop user\npersonas and adaptive interface candidates for a specific domain using ChatGPT.\nWe develop user personas and adaptive interfaces using both ChatGPT and a\ntraditional manual process and compare these outcomes. To obtain data for the\npersonas we collected data from 37 survey participants and 4 interviews in\ncollaboration with a not-for-profit organisation. The comparison of ChatGPT\ngenerated content and manual content indicates promising results that encourage\nusing LLMs in the adaptive interfaces design process.",
        "updated": "2024-04-08 12:22:39 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.05442v1"
    },
    {
        "title": "Re-Ranking News Comments by Constructiveness and Curiosity Significantly Increases Perceived Respect, Trustworthiness, and Interest",
        "authors": "Emily SaltzZaria HowardTin Acosta",
        "links": "http://arxiv.org/abs/2404.05429v1",
        "entry_id": "http://arxiv.org/abs/2404.05429v1",
        "pdf_url": "http://arxiv.org/pdf/2404.05429v1",
        "summary": "Online commenting platforms have commonly developed systems to address online\nharms by removing and down-ranking content. An alternative, under-explored\napproach is to focus on up-ranking content to proactively prioritize prosocial\ncommentary and set better conversational norms. We present a study with 460\nEnglish-speaking US-based news readers to understand the effects of re-ranking\ncomments by constructiveness, curiosity, and personal stories on a variety of\noutcomes related to willingness to participate and engage, as well as perceived\ncredibility and polarization in a comment section. In our rich-media survey\nexperiment, participants across these four ranking conditions and a control\ngroup reviewed prototypes of comment sections of a Politics op-ed and Dining\narticle. We found that outcomes varied significantly by article type.\nUp-ranking curiosity and constructiveness improved a number of measures for the\nPolitics article, including perceived \\textit{Respect},\n\\textit{Trustworthiness}, and \\textit{Interestingness} of the comment section.\nConstructiveness also increased perceptions that the comments were favorable to\nRepublicans, with no condition worsening perceptions of partisans.\nAdditionally, in the Dining article, personal stories and constructiveness\nrankings significantly improved the perceived informativeness of the comments.\nOverall, these findings indicate that incorporating prosocial qualities of\nspeech into ranking could be a promising approach to promote healthier, less\npolarized dialogue in online comment sections.",
        "updated": "2024-04-08 11:56:22 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.05429v1"
    }
]