[
    {
        "title": "BMW Agents -- A Framework For Task Automation Through Multi-Agent Collaboration",
        "authors": "Noel CrawfordEdward B. DuffyIman EvazzadeTorsten FoehrGregory RobbinsDebbrata Kumar SahaJiya VarmaMarcin Ziolkowski",
        "links": "http://arxiv.org/abs/2406.20041v2",
        "entry_id": "http://arxiv.org/abs/2406.20041v2",
        "pdf_url": "http://arxiv.org/pdf/2406.20041v2",
        "summary": "Autonomous agents driven by Large Language Models (LLMs) offer enormous\npotential for automation. Early proof of this technology can be found in\nvarious demonstrations of agents solving complex tasks, interacting with\nexternal systems to augment their knowledge, and triggering actions. In\nparticular, workflows involving multiple agents solving complex tasks in a\ncollaborative fashion exemplify their capacity to operate in less strict and\nless well-defined environments. Thus, a multi-agent approach has great\npotential for serving as a backbone in many industrial applications, ranging\nfrom complex knowledge retrieval systems to next generation robotic process\nautomation. Given the reasoning abilities within the current generation of\nLLMs, complex processes require a multi-step approach that includes a plan of\nwell-defined and modular tasks. Depending on the level of complexity, these\ntasks can be executed either by a single agent or a group of agents. In this\nwork, we focus on designing a flexible agent engineering framework with careful\nattention to planning and execution, capable of handling complex use case\napplications across various domains. The proposed framework provides\nreliability in industrial applications and presents techniques to ensure a\nscalable, flexible, and collaborative workflow for multiple autonomous agents\nworking together towards solving tasks.",
        "updated": "2024-07-01 16:58:15 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.20041v2"
    },
    {
        "title": "Exploring 6G Potential for Industrial Digital Twinning and Swarm Intelligence in Obstacle-Rich",
        "authors": "Siyu YuanKhurshid AlamBin HanDennis KrummackerHans D. Schotten",
        "links": "http://arxiv.org/abs/2406.19930v1",
        "entry_id": "http://arxiv.org/abs/2406.19930v1",
        "pdf_url": "http://arxiv.org/pdf/2406.19930v1",
        "summary": "With the advent of 6G technology, the demand for efficient and intelligent\nsystems in industrial applications has surged, driving the need for advanced\nsolutions in target localization. Utilizing swarm robots to locate unknown\ntargets involves navigating increasingly complex environments. Digital Twinning\n(DT) offers a robust solution by creating a virtual replica of the physical\nworld, which enhances the swarm's navigation capabilities. Our framework\nleverages DT and integrates Swarm Intelligence to store physical map\ninformation in the cloud, enabling robots to efficiently locate unknown\ntargets. The simulation results demonstrate that the DT framework, augmented by\nSwarm Intelligence, significantly improves target location efficiency in\nobstacle-rich environments compared to traditional methods. This research\nunderscores the potential of combining DT and Swarm Intelligence to advance the\nfield of robotic navigation and target localization in complex industrial\nsettings.",
        "updated": "2024-06-28 13:57:51 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.19930v1"
    },
    {
        "title": "FootBots: A Transformer-based Architecture for Motion Prediction in Soccer",
        "authors": "Guillem CapelleraLuis FerrazAntonio RubioAntonio AgudoFrancesc Moreno-Noguer",
        "links": "http://arxiv.org/abs/2406.19852v1",
        "entry_id": "http://arxiv.org/abs/2406.19852v1",
        "pdf_url": "http://arxiv.org/pdf/2406.19852v1",
        "summary": "Motion prediction in soccer involves capturing complex dynamics from player\nand ball interactions. We present FootBots, an encoder-decoder\ntransformer-based architecture addressing motion prediction and conditioned\nmotion prediction through equivariance properties. FootBots captures temporal\nand social dynamics using set attention blocks and multi-attention block\ndecoder. Our evaluation utilizes two datasets: a real soccer dataset and a\ntailored synthetic one. Insights from the synthetic dataset highlight the\neffectiveness of FootBots' social attention mechanism and the significance of\nconditioned motion prediction. Empirical results on real soccer data\ndemonstrate that FootBots outperforms baselines in motion prediction and excels\nin conditioned tasks, such as predicting the players based on the ball\nposition, predicting the offensive (defensive) team based on the ball and the\ndefensive (offensive) team, and predicting the ball position based on all\nplayers. Our evaluation connects quantitative and qualitative findings.\nhttps://youtu.be/9kaEkfzG3L8",
        "updated": "2024-06-28 11:49:59 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.19852v1"
    },
    {
        "title": "Multi-UAVs end-to-end Distributed Trajectory Generation over Point Cloud Data",
        "authors": "Antonio MarinoClaudio PacchierottiPaolo Robuffo Giordano",
        "links": "http://arxiv.org/abs/2406.19742v1",
        "entry_id": "http://arxiv.org/abs/2406.19742v1",
        "pdf_url": "http://arxiv.org/pdf/2406.19742v1",
        "summary": "This paper introduces an end-to-end trajectory planning algorithm tailored\nfor multi-UAV systems that generates collision-free trajectories in\nenvironments populated with both static and dynamic obstacles, leveraging point\ncloud data. Our approach consists of a 2-fork neural network fed with sensing\nand localization data, able to communicate intermediate learned features among\nthe agents. One network branch crafts an initial collision-free trajectory\nestimate, while the other devises a neural collision constraint for subsequent\noptimization, ensuring trajectory continuity and adherence to physicalactuation\nlimits. Extensive simulations in challenging cluttered environments, involving\nup to 25 robots and 25% obstacle density, show a collision avoidance success\nrate in the range of 100 -- 85%. Finally, we introduce a saliency map\ncomputation method acting on the point cloud data, offering qualitative\ninsights into our methodology.",
        "updated": "2024-06-28 08:29:29 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.19742v1"
    },
    {
        "title": "Multi-agent Cooperative Games Using Belief Map Assisted Training",
        "authors": "Qinwei HuangChen LuoAlex B. WuSimon KhanHai LiQinru Qiu",
        "links": "http://dx.doi.org/10.3233/FAIA230444",
        "entry_id": "http://arxiv.org/abs/2406.19477v1",
        "pdf_url": "http://arxiv.org/pdf/2406.19477v1",
        "summary": "In a multi-agent system, agents share their local observations to gain global\nsituational awareness for decision making and collaboration using a message\npassing system. When to send a message, how to encode a message, and how to\nleverage the received messages directly affect the effectiveness of the\ncollaboration among agents. When training a multi-agent cooperative game using\nreinforcement learning (RL), the message passing system needs to be optimized\ntogether with the agent policies. This consequently increases the model's\ncomplexity and poses significant challenges to the convergence and performance\nof learning. To address this issue, we propose the Belief-map Assisted\nMulti-agent System (BAMS), which leverages a neuro-symbolic belief map to\nenhance training. The belief map decodes the agent's hidden state to provide a\nsymbolic representation of the agent's understanding of the environment and\nother agent's status. The simplicity of symbolic representation allows the\ngathering and comparison of the ground truth information with the belief, which\nprovides an additional channel of feedback for the learning. Compared to the\nsporadic and delayed feedback coming from the reward in RL, the feedback from\nthe belief map is more consistent and reliable. Agents using BAMS can learn a\nmore effective message passing network to better understand each other,\nresulting in better performance in a cooperative predator and prey game with\nvarying levels of map complexity and compare it to previous multi-agent message\npassing models. The simulation results showed that BAMS reduced training epochs\nby 66\\%, and agents who apply the BAMS model completed the game with 34.62\\%\nfewer steps on average.",
        "updated": "2024-06-27 18:40:55 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.19477v1"
    }
]