[
    {
        "title": "Tracking Patterns in Toxicity and Antisocial Behavior Over User Lifetimes on Large Social Media Platforms",
        "authors": "Katy BlumerJon Kleinberg",
        "links": "http://arxiv.org/abs/2407.09365v1",
        "entry_id": "http://arxiv.org/abs/2407.09365v1",
        "pdf_url": "http://arxiv.org/pdf/2407.09365v1",
        "summary": "An increasing amount of attention has been devoted to the problem of \"toxic\"\nor antisocial behavior on social media. In this paper we analyze such behavior\nat very large scales: we analyze toxicity over a 14-year time span on nearly\n500 million comments from Reddit and Wikipedia, grounded in two different\nproxies for toxicity.\n  At the individual level, we analyze users' toxicity levels over the course of\ntheir time on the site, and find a striking reversal in trends: both Reddit and\nWikipedia users tended to become less toxic over their life cycles on the site\nin the early (pre-2013) history of the site, but more toxic over their life\ncycles in the later (post-2013) history of the site. We also find that toxicity\non Reddit and Wikipedia differ in a key way, with the most toxic behavior on\nReddit exhibited in aggregate by the most active users, and the most toxic\nbehavior on Wikipedia exhibited in aggregate by the least active users.\nFinally, we consider the toxicity of discussion around widely-shared pieces of\ncontent, and find that the trends for toxicity in discussion about content bear\ninteresting similarities with the trends for toxicity in discussion by users.",
        "updated": "2024-07-12 15:45:02 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.09365v1"
    },
    {
        "title": "Is Contrasting All You Need? Contrastive Learning for the Detection and Attribution of AI-generated Text",
        "authors": "Lucio La CavaDavide CostaAndrea Tagarelli",
        "links": "http://arxiv.org/abs/2407.09364v1",
        "entry_id": "http://arxiv.org/abs/2407.09364v1",
        "pdf_url": "http://arxiv.org/pdf/2407.09364v1",
        "summary": "The significant progress in the development of Large Language Models has\ncontributed to blurring the distinction between human and AI-generated text.\nThe increasing pervasiveness of AI-generated text and the difficulty in\ndetecting it poses new challenges for our society. In this paper, we tackle the\nproblem of detecting and attributing AI-generated text by proposing WhosAI, a\ntriplet-network contrastive learning framework designed to predict whether a\ngiven input text has been generated by humans or AI and to unveil the\nauthorship of the text. Unlike most existing approaches, our proposed framework\nis conceived to learn semantic similarity representations from multiple\ngenerators at once, thus equally handling both detection and attribution tasks.\nFurthermore, WhosAI is model-agnostic and scalable to the release of new AI\ntext-generation models by incorporating their generated instances into the\nembedding space learned by our framework. Experimental results on the\nTuringBench benchmark of 200K news articles show that our proposed framework\nachieves outstanding results in both the Turing Test and Authorship Attribution\ntasks, outperforming all the methods listed in the TuringBench benchmark\nleaderboards.",
        "updated": "2024-07-12 15:44:56 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.09364v1"
    },
    {
        "title": "Good Intentions, Risky Inventions: A Method for Assessing the Risks and Benefits of AI in Mobile and Wearable Uses",
        "authors": "Marios ConstantinidesEdyta BoguckaSanja ScepanovicDaniele Quercia",
        "links": "http://arxiv.org/abs/2407.09322v1",
        "entry_id": "http://arxiv.org/abs/2407.09322v1",
        "pdf_url": "http://arxiv.org/pdf/2407.09322v1",
        "summary": "Integrating Artificial Intelligence (AI) into mobile and wearables offers\nnumerous benefits at individual, societal, and environmental levels. Yet, it\nalso spotlights concerns over emerging risks. Traditional assessments of risks\nand benefits have been sporadic, and often require costly expert analysis. We\ndeveloped a semi-automatic method that leverages Large Language Models (LLMs)\nto identify AI uses in mobile and wearables, classify their risks based on the\nEU AI Act, and determine their benefits that align with globally recognized\nlong-term sustainable development goals; a manual validation of our method by\ntwo experts in mobile and wearable technologies, a legal and compliance expert,\nand a cohort of nine individuals with legal backgrounds who were recruited from\nProlific, confirmed its accuracy to be over 85\\%. We uncovered that specific\napplications of mobile computing hold significant potential in improving\nwell-being, safety, and social equality. However, these promising uses are\nlinked to risks involving sensitive data, vulnerable groups, and automated\ndecision-making. To avoid rejecting these risky yet impactful mobile and\nwearable uses, we propose a risk assessment checklist for the Mobile HCI\ncommunity.",
        "updated": "2024-07-12 14:58:56 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.09322v1"
    },
    {
        "title": "Prompts First, Finally",
        "authors": "Brent N. ReevesJames PratherPaul DennyJuho LeinonenStephen MacNeilBrett A. BeckerAndrew Luxton-Reilly",
        "links": "http://arxiv.org/abs/2407.09231v1",
        "entry_id": "http://arxiv.org/abs/2407.09231v1",
        "pdf_url": "http://arxiv.org/pdf/2407.09231v1",
        "summary": "Generative AI (GenAI) and large language models in particular, are disrupting\nComputer Science Education. They are proving increasingly capable at more and\nmore challenges. Some educators argue that they pose a serious threat to\ncomputing education, and that we should ban their use in the classroom. While\nthere are serious GenAI issues that remain unsolved, it may be useful in the\npresent moment to step back and examine the overall trajectory of Computer\nScience writ large. Since the very beginning, our discipline has sought to\nincrease the level of abstraction in each new representation. We have\nprogressed from hardware dip switches, through special purpose languages and\nvisual representations like flow charts, all the way now to ``natural\nlanguage.'' With the advent of GenAI, students can finally change the\nabstraction level of a problem to the ``language'' they've been ``problem\nsolving'' with all their lives. In this paper, we argue that our programming\nabstractions were always headed here -- to natural language. Now is the time to\nadopt a ``Prompts First'' approach to Computer Science Education.",
        "updated": "2024-07-12 12:50:28 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.09231v1"
    },
    {
        "title": "AI-Powered Immersive Assistance for Interactive Task Execution in Industrial Environments",
        "authors": "Tomislav DuricicPeter MüllnerNicole WeidingerNeven ElSayedDominik KowaldEduardo Veas",
        "links": "http://arxiv.org/abs/2407.09147v1",
        "entry_id": "http://arxiv.org/abs/2407.09147v1",
        "pdf_url": "http://arxiv.org/pdf/2407.09147v1",
        "summary": "Many industrial sectors rely on well-trained employees that are able to\noperate complex machinery. In this work, we demonstrate an AI-powered immersive\nassistance system that supports users in performing complex tasks in industrial\nenvironments. Specifically, our system leverages a VR environment that\nresembles a juice mixer setup. This digital twin of a physical setup simulates\ncomplex industrial machinery used to mix preparations or liquids (e.g., similar\nto the pharmaceutical industry) and includes various containers, sensors,\npumps, and flow controllers. This setup demonstrates our system's capabilities\nin a controlled environment while acting as a proof-of-concept for broader\nindustrial applications. The core components of our multimodal AI assistant are\na large language model and a speech-to-text model that process a video and\naudio recording of an expert performing the task in a VR environment. The video\nand speech input extracted from the expert's video enables it to provide\nstep-by-step guidance to support users in executing complex tasks. This\ndemonstration showcases the potential of our AI-powered assistant to reduce\ncognitive load, increase productivity, and enhance safety in industrial\nenvironments.",
        "updated": "2024-07-12 10:30:45 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.09147v1"
    }
]