[
    {
        "title": "Fairness in Social Influence Maximization via Optimal Transport",
        "authors": "Shubham ChowdharyGiulia De PasqualeNicolas LanzettiAna-Andreea StoicaFlorian Dorfler",
        "links": "http://arxiv.org/abs/2406.17736v1",
        "entry_id": "http://arxiv.org/abs/2406.17736v1",
        "pdf_url": "http://arxiv.org/pdf/2406.17736v1",
        "summary": "We study fairness in social influence maximization, whereby one seeks to\nselect seeds that spread a given information throughout a network, ensuring\nbalanced outreach among different communities (e.g. demographic groups). In the\nliterature, fairness is often quantified in terms of the expected outreach\nwithin individual communities. In this paper, we demonstrate that such fairness\nmetrics can be misleading since they ignore the stochastic nature of\ninformation diffusion processes. When information diffusion occurs in a\nprobabilistic manner, multiple outreach scenarios can occur. As such, outcomes\nsuch as \"in 50% of the cases, no one of group 1 receives the information and\neveryone in group 2 receives it and in other 50%, the opposite happens\", which\nalways results in largely unfair outcomes, are classified as fair by a variety\nof fairness metrics in the literature. We tackle this problem by designing a\nnew fairness metric, mutual fairness, that captures variability in outreach\nthrough optimal transport theory. We propose a new seed selection algorithm\nthat optimizes both outreach and mutual fairness, and we show its efficacy on\nseveral real datasets. We find that our algorithm increases fairness with only\na minor decrease (and at times, even an increase) in efficiency.",
        "updated": "2024-06-25 17:24:01 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.17736v1"
    },
    {
        "title": "CuDA2: An approach for Incorporating Traitor Agents into Cooperative Multi-Agent Systems",
        "authors": "Zhen ChenYong LiaoYoupeng ZhaoZipeng DaiJian Zhao",
        "links": "http://arxiv.org/abs/2406.17425v1",
        "entry_id": "http://arxiv.org/abs/2406.17425v1",
        "pdf_url": "http://arxiv.org/pdf/2406.17425v1",
        "summary": "Cooperative Multi-Agent Reinforcement Learning (CMARL) strategies are well\nknown to be vulnerable to adversarial perturbations. Previous works on\nadversarial attacks have primarily focused on white-box attacks that directly\nperturb the states or actions of victim agents, often in scenarios with a\nlimited number of attacks. However, gaining complete access to victim agents in\nreal-world environments is exceedingly difficult. To create more realistic\nadversarial attacks, we introduce a novel method that involves injecting\ntraitor agents into the CMARL system. We model this problem as a Traitor Markov\nDecision Process (TMDP), where traitors cannot directly attack the victim\nagents but can influence their formation or positioning through collisions. In\nTMDP, traitors are trained using the same MARL algorithm as the victim agents,\nwith their reward function set as the negative of the victim agents' reward.\nDespite this, the training efficiency for traitors remains low because it is\nchallenging for them to directly associate their actions with the victim\nagents' rewards. To address this issue, we propose the Curiosity-Driven\nAdversarial Attack (CuDA2) framework. CuDA2 enhances the efficiency and\naggressiveness of attacks on the specified victim agents' policies while\nmaintaining the optimal policy invariance of the traitors. Specifically, we\nemploy a pre-trained Random Network Distillation (RND) module, where the extra\nreward generated by the RND module encourages traitors to explore states\nunencountered by the victim agents. Extensive experiments on various scenarios\nfrom SMAC demonstrate that our CuDA2 framework offers comparable or superior\nadversarial attack capabilities compared to other baselines.",
        "updated": "2024-06-25 09:59:31 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.17425v1"
    },
    {
        "title": "Learnings from Implementation of a BDI Agent-based Battery-less Wireless Sensor",
        "authors": "Ganesh RamanathanAndres GomezSimon Mayer",
        "links": "http://arxiv.org/abs/2406.17303v1",
        "entry_id": "http://arxiv.org/abs/2406.17303v1",
        "pdf_url": "http://arxiv.org/pdf/2406.17303v1",
        "summary": "Battery-less embedded devices powered by energy harvesting are increasingly\nbeing used in wireless sensing applications. However, their limited and often\nuncertain energy availability challenges designing application programs. To\nexamine if BDI-based agent programming can address this challenge, we used it\nfor a real-life application involving an environmental sensor that works on\nenergy harvested from ambient light. This yielded the first ever implementation\nof a BDI agent on a low-power battery-less and energy-harvesting embedded\nsystem. Furthermore, it uncovered conceptual integration challenges between\nembedded systems and BDI-based agent programming that, if overcome, will\nsimplify the deployment of more autonomous systems on low-power devices with\nnon-deterministic energy availability. Specifically, we (1) mapped essential\ndevice states to default \\textit{internal} beliefs, (2) recognized and\naddressed the need for beliefs in general to be \\textit{short-} or\n\\textit{long-term}, and (3) propose dynamic annotation of intentions with their\nrun-time energy impact. We show that incorporating these extensions not only\nsimplified the programming but also improved code readability and understanding\nof its behavior.",
        "updated": "2024-06-25 06:16:38 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.17303v1"
    },
    {
        "title": "Model Checking of vGOAL",
        "authors": "Yi YangTom Holvoet",
        "links": "http://arxiv.org/abs/2406.17206v1",
        "entry_id": "http://arxiv.org/abs/2406.17206v1",
        "pdf_url": "http://arxiv.org/pdf/2406.17206v1",
        "summary": "Developing autonomous decision-making requires safety assurance. Agent\nprogramming languages like AgentSpeak and Gwendolen provide tools for\nprogramming autonomous decision-making. However, despite numerous efforts to\napply model checking to these languages, challenges persist such as a faithful\nsemantic mapping between agent programs and the generated models, efficient\nmodel generation, and efficient model checking.\n  As an extension of the agent programming language GOAL, vGOAL has been\nproposed to formally specify autonomous decisions with an emphasis on safety.\nThis paper tackles the mentioned challenges through two automated\nmodel-checking processes for vGOAL: one for Computation Tree Logic and another\nfor Probabilistic Computation Tree Logic. Compared with the existing\nmodel-checking approaches of agent programming languages, it has three main\nadvantages. First, it efficiently performs automated model-checking analysis\nfor a given vGOAL specification, including efficiently generating input models\nfor NuSMV and Storm and leveraging these efficient model checkers. Second, the\nsemantic equivalence is established for both nondeterministic models and\nprobabilistic models of vGOAL: from vGOAL to transition systems or DTMCs.\nThird, an algorithm is proposed for efficiently detecting errors, which is\nparticularly useful for vGOAL specifications that describe complex scenarios.\nValidation and experiments in a real-world autonomous logistic system with\nthree autonomous mobile robots illustrate both the efficiency and practical\nusability of the automated CTL and PCTL model-checking process for vGOAL.",
        "updated": "2024-06-25 01:22:05 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.17206v1"
    },
    {
        "title": "Hierarchical Framework for Optimizing Wildfire Surveillance and Suppression using Human-Autonomous Teaming",
        "authors": "Mahdi Al-HusseiniKyle WrayMykel Kochenderfer",
        "links": "http://arxiv.org/abs/2406.17189v1",
        "entry_id": "http://arxiv.org/abs/2406.17189v1",
        "pdf_url": "http://arxiv.org/pdf/2406.17189v1",
        "summary": "The integration of manned and unmanned aircraft can help improve wildfire\nresponse. Wildfire containment failures occur when resources available to first\nresponders, who execute the initial stages of wildfire management referred to\nas the initial attack, are ineffective or insufficient. Initial attack\nsurveillance and suppression models have linked action spaces and objectives,\nmaking their optimization computationally challenging. The initial attack may\nbe formulated as a multi-agent partially observable Markov decision process\n(MPOMDP). We divide the initial attack MPOMDP into surveillance and suppression\nprocesses with their respective planners operating on different, but constant,\ntime scales. A hierarchical framework iterates between surveillance and\nsuppression planners while also providing collision avoidance. This framework\nis exemplified by a set of multi-rotor unmanned aircraft surveying an initial\nattack fire while a manned helicopter suppresses the fire with a water bucket.\nWildfire-specific solver extensions are formulated to reduce the otherwise vast\naction spaces. The hierarchical framework outperforms firefighting techniques\nand a myopic baseline by up to 242% for moderate wildfires and 60% for rapid\nwildfires when simulated in abstracted and actual case studies. We also\nvalidate the early dispatching of additional suppression assets using\nregression models to ensure wildfire containment to thresholds established by\nwildfire agencies.",
        "updated": "2024-06-25 00:07:33 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.17189v1"
    }
]