[
    {
        "title": "Transformer Explainer: Interactive Learning of Text-Generative Models",
        "authors": "Aeree ChoGrace C. KimAlexander KarpekovAlec HelblingZijie J. WangSeongmin LeeBenjamin HooverDuen Horng Chau",
        "links": "http://arxiv.org/abs/2408.04619v1",
        "entry_id": "http://arxiv.org/abs/2408.04619v1",
        "pdf_url": "http://arxiv.org/pdf/2408.04619v1",
        "summary": "Transformers have revolutionized machine learning, yet their inner workings\nremain opaque to many. We present Transformer Explainer, an interactive\nvisualization tool designed for non-experts to learn about Transformers through\nthe GPT-2 model. Our tool helps users understand complex Transformer concepts\nby integrating a model overview and enabling smooth transitions across\nabstraction levels of mathematical operations and model structures. It runs a\nlive GPT-2 instance locally in the user's browser, empowering users to\nexperiment with their own input and observe in real-time how the internal\ncomponents and parameters of the Transformer work together to predict the next\ntokens. Our tool requires no installation or special hardware, broadening the\npublic's education access to modern generative AI techniques. Our open-sourced\ntool is available at https://poloclub.github.io/transformer-explainer/. A video\ndemo is available at https://youtu.be/ECR4oAwocjs.",
        "updated": "2024-08-08 17:49:07 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.04619v1"
    },
    {
        "title": "Integrating Annotations into the Design Process for Sonifications and Physicalizations",
        "authors": "Rhys Sorenson-GraffS. Sandra BaeJordan Wirfs-Brock",
        "links": "http://arxiv.org/abs/2408.04574v1",
        "entry_id": "http://arxiv.org/abs/2408.04574v1",
        "pdf_url": "http://arxiv.org/pdf/2408.04574v1",
        "summary": "Annotations are a critical component of visualizations, helping viewers\ninterpret the visual representation and highlighting critical data insights.\nDespite their significant role, we lack an understanding of how annotations can\nbe incorporated into other data representations, such as physicalizations and\nsonifications. Given the emergent nature of these representations,\nsonifications, and physicalizations lack formalized conventions (e.g., design\nspace, vocabulary) that can introduce challenges for audiences to interpret the\nintended data encoding. To address this challenge, this work focuses on how\nannotations can be more tightly integrated into the design process of creating\nsonifications and physicalizations. In an exploratory study with 13 designers,\nwe explore how visualization annotation techniques can be adapted to sonic and\nphysical modalities. Our work highlights how annotations for sonification and\nphysicalizations are inseparable from their data encodings.",
        "updated": "2024-08-08 16:36:14 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.04574v1"
    },
    {
        "title": "ParetoTracker: Understanding Population Dynamics in Multi-objective Evolutionary Algorithms through Visual Analytics",
        "authors": "Zherui ZhangFan YangRan ChengYuxin Ma",
        "links": "http://arxiv.org/abs/2408.04539v1",
        "entry_id": "http://arxiv.org/abs/2408.04539v1",
        "pdf_url": "http://arxiv.org/pdf/2408.04539v1",
        "summary": "Multi-objective evolutionary algorithms (MOEAs) have emerged as powerful\ntools for solving complex optimization problems characterized by multiple,\noften conflicting, objectives. While advancements have been made in\ncomputational efficiency as well as diversity and convergence of solutions, a\ncritical challenge persists: the internal evolutionary mechanisms are opaque to\nhuman users. Drawing upon the successes of explainable AI in explaining complex\nalgorithms and models, we argue that the need to understand the underlying\nevolutionary operators and population dynamics within MOEAs aligns well with a\nvisual analytics paradigm. This paper introduces ParetoTracker, a visual\nanalytics framework designed to support the comprehension and inspection of\npopulation dynamics in the evolutionary processes of MOEAs. Informed by\npreliminary literature review and expert interviews, the framework establishes\na multi-level analysis scheme, which caters to user engagement and exploration\nranging from examining overall trends in performance metrics to conducting\nfine-grained inspections of evolutionary operations. In contrast to\nconventional practices that require manual plotting of solutions for each\ngeneration, ParetoTracker facilitates the examination of temporal trends and\ndynamics across consecutive generations in an integrated visual interface. The\neffectiveness of the framework is demonstrated through case studies and expert\ninterviews focused on widely adopted benchmark optimization problems.",
        "updated": "2024-08-08 15:46:11 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.04539v1"
    },
    {
        "title": "Who ruins the game?: unveiling cheating players in the \"Battlefield\" game",
        "authors": "Dong Young KimHuy Kang Kim",
        "links": "http://arxiv.org/abs/2408.04506v1",
        "entry_id": "http://arxiv.org/abs/2408.04506v1",
        "pdf_url": "http://arxiv.org/pdf/2408.04506v1",
        "summary": "The \"Battlefield\" online game is well-known for its large-scale multiplayer\ncapabilities and unique gaming features, including various vehicle controls.\nHowever, these features make the game a major target for cheating,\nsignificantly detracting from the gaming experience. This study analyzes user\nbehavior in cheating play in the popular online game, the \"Battlefield\", using\nstatistical methods. We aim to provide comprehensive insights into cheating\nplayers through an extensive analysis of over 44,000 reported cheating\nincidents collected via the \"Game-tools API\". Our methodology includes detailed\nstatistical analyses such as calculating basic statistics of key variables,\ncorrelation analysis, and visualizations using histograms, box plots, and\nscatter plots. Our findings emphasize the importance of adaptive, data-driven\napproaches to prevent cheating plays in online games.",
        "updated": "2024-08-08 15:04:23 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.04506v1"
    },
    {
        "title": "\"I Am Human, Just Like You\": What Intersectional, Neurodivergent Lived Experiences Bring to Accessibility Research",
        "authors": "Lindy Le",
        "links": "http://dx.doi.org/10.1145/3663548.3675651",
        "entry_id": "http://arxiv.org/abs/2408.04500v1",
        "pdf_url": "http://arxiv.org/pdf/2408.04500v1",
        "summary": "The increasing prevalence of neurodivergence has led society to give greater\nrecognition to the importance of neurodiversity. Yet societal perceptions of\nneurodivergence continue to be predominantly negative. Drawing on Critical\nDisability Studies, accessibility researchers have demonstrated how\nneuronormative assumptions dominate HCI. Despite their guidance, neurodivergent\nand disabled individuals are still marginalized in technology research. In\nparticular, intersectional identities remain largely absent from HCI\nneurodivergence research. In this paper, I share my perspective as an outsider\nof the academic research community: I use critical autoethnography to analyze\nmy experiences of coming to understand, accept, and value my neurodivergence\nwithin systems of power, privilege, and oppression. Using Data Feminism as an\naccessible and practical guide to intersectionality, I derive three tenets for\nreconceptualizing neurodivergence to be more inclusive of intersectional\nexperiences: (1) neurodivergence is a functional difference, not a deficit; (2)\nneurodivergent disability is a moment of friction, not a static label; and (3)\nneurodivergence accessibility is a collaborative practice, not a one-sided\nsolution. Then, I discuss the tenets in the context of existing HCI research,\napplying the same intersectional lens. Finally, I offer three suggestions for\nhow accessibility research can apply these tenets in future work, to bridge the\ngap between accessibility theory and practice in HCI neurodivergence research",
        "updated": "2024-08-08 14:55:13 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.04500v1"
    }
]