[
    {
        "title": "Towards Physically Talented Aerial Robots with Tactically Smart Swarm Behavior thereof: An Efficient Co-design Approach",
        "authors": "Prajit KrisshnaKumarSteve PaulHemanth ManjunathaMary CorraEhsan EsfahaniSouma Chowdhury",
        "links": "http://arxiv.org/abs/2406.16612v1",
        "entry_id": "http://arxiv.org/abs/2406.16612v1",
        "pdf_url": "http://arxiv.org/pdf/2406.16612v1",
        "summary": "The collective performance or capacity of collaborative autonomous systems\nsuch as a swarm of robots is jointly influenced by the morphology and the\nbehavior of individual systems in that collective. In that context, this paper\nexplores how morphology impacts the learned tactical behavior of unmanned\naerial/ground robots performing reconnaissance and search & rescue. This is\nachieved by presenting a computationally efficient framework to solve this\notherwise challenging problem of jointly optimizing the morphology and tactical\nbehavior of swarm robots. Key novel developments to this end include the use of\nphysical talent metrics and modification of graph reinforcement learning\narchitectures to allow joint learning of the swarm tactical policy and the\ntalent metrics (search speed, flight range, and cruising speed) that constrain\nmobility and object/victim search capabilities of the aerial robots executing\nthese tactics. Implementation of this co-design approach is supported by\nadvancements to an open-source Pybullet-based swarm simulator that allows the\nuse of variable aerial asset capabilities. The results of the co-design are\nobserved to outperform those of tactics learning with a fixed Pareto design,\nwhen compared in terms of mission performance metrics. Significant differences\nin morphology and learned behavior are also observed by comparing the baseline\ndesign and the co-design outcomes.",
        "updated": "2024-06-24 12:52:17 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.16612v1"
    },
    {
        "title": "TornadoDrone: Bio-inspired DRL-based Drone Landing on 6D Platform with Wind Force Disturbances",
        "authors": "Robinroy PeterLavanya RatnabalaDemetros AschuAleksey FedoseevDzmitry Tsetserukou",
        "links": "http://arxiv.org/abs/2406.16164v1",
        "entry_id": "http://arxiv.org/abs/2406.16164v1",
        "pdf_url": "http://arxiv.org/pdf/2406.16164v1",
        "summary": "Autonomous drone navigation faces a critical challenge in achieving accurate\nlandings on dynamic platforms, especially under unpredictable conditions such\nas wind turbulence. Our research introduces TornadoDrone, a novel Deep\nReinforcement Learning (DRL) model that adopts bio-inspired mechanisms to adapt\nto wind forces, mirroring the natural adaptability seen in birds. This model,\nunlike traditional approaches, derives its adaptability from indirect cues such\nas changes in position and velocity, rather than direct wind force\nmeasurements. TornadoDrone was rigorously trained in the gym-pybullet-drone\nsimulator, which closely replicates the complexities of wind dynamics in the\nreal world. Through extensive testing with Crazyflie 2.1 drones in both\nsimulated and real windy conditions, TornadoDrone demonstrated a high\nperformance in maintaining high-precision landing accuracy on moving platforms,\nsurpassing conventional control methods such as PID controllers with Extended\nKalman Filters. The study not only highlights the potential of DRL to tackle\ncomplex aerodynamic challenges but also paves the way for advanced autonomous\nsystems that can adapt to environmental changes in real-time. The success of\nTornadoDrone signifies a leap forward in drone technology, particularly for\ncritical applications such as surveillance and emergency response, where\nreliability and precision are paramount.",
        "updated": "2024-06-23 16:54:07 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.16164v1"
    },
    {
        "title": "Decentralized Transformers with Centralized Aggregation are Sample-Efficient Multi-Agent World Models",
        "authors": "Yang ZhangChenjia BaiBin ZhaoJunchi YanXiu LiXuelong Li",
        "links": "http://arxiv.org/abs/2406.15836v1",
        "entry_id": "http://arxiv.org/abs/2406.15836v1",
        "pdf_url": "http://arxiv.org/pdf/2406.15836v1",
        "summary": "Learning a world model for model-free Reinforcement Learning (RL) agents can\nsignificantly improve the sample efficiency by learning policies in\nimagination. However, building a world model for Multi-Agent RL (MARL) can be\nparticularly challenging due to the scalability issue in a centralized\narchitecture arising from a large number of agents, and also the\nnon-stationarity issue in a decentralized architecture stemming from the\ninter-dependency among agents. To address both challenges, we propose a novel\nworld model for MARL that learns decentralized local dynamics for scalability,\ncombined with a centralized representation aggregation from all agents. We cast\nthe dynamics learning as an auto-regressive sequence modeling problem over\ndiscrete tokens by leveraging the expressive Transformer architecture, in order\nto model complex local dynamics across different agents and provide accurate\nand consistent long-term imaginations. As the first pioneering\nTransformer-based world model for multi-agent systems, we introduce a Perceiver\nTransformer as an effective solution to enable centralized representation\naggregation within this context. Results on Starcraft Multi-Agent Challenge\n(SMAC) show that it outperforms strong model-free approaches and existing\nmodel-based methods in both sample efficiency and overall performance.",
        "updated": "2024-06-22 12:40:03 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.15836v1"
    },
    {
        "title": "Contextual Sprint Classification in Soccer Based on Deep Learning",
        "authors": "Hyunsung KimGun-Hee JoeJinsung YoonSang-Ki Ko",
        "links": "http://arxiv.org/abs/2406.15659v1",
        "entry_id": "http://arxiv.org/abs/2406.15659v1",
        "pdf_url": "http://arxiv.org/pdf/2406.15659v1",
        "summary": "The analysis of high-intensity runs (or sprints) in soccer has long been a\ntopic of interest for sports science researchers and practitioners. In\nparticular, recent studies suggested contextualizing sprints based on their\ntactical purposes to better understand the physical-tactical requirements of\nmodern match-play. However, they have a limitation in scalability, as human\nexperts have to manually classify hundreds of sprints for every match. To\naddress this challenge, this paper proposes a deep learning framework for\nautomatically classifying sprints in soccer into contextual categories. The\nproposed model covers the permutation-invariant and sequential nature of\nmulti-agent trajectories in soccer by deploying Set Transformers and a\nbidirectional GRU. We train the model with category labels made through the\ncollaboration of human annotators and a rule-based classifier. Experimental\nresults show that our model classifies sprints in the test dataset into 15\ncategories with the accuracy of 77.65%, implying the potential of the proposed\nframework for facilitating the integrated analysis of soccer sprints at scale.",
        "updated": "2024-06-21 21:33:51 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.15659v1"
    },
    {
        "title": "Phase-Bounded Broadcast Networks over Topologies of Communication",
        "authors": "Lucie GuillouArnaud SangnierNathalie Sznajder",
        "links": "http://arxiv.org/abs/2406.15202v1",
        "entry_id": "http://arxiv.org/abs/2406.15202v1",
        "pdf_url": "http://arxiv.org/pdf/2406.15202v1",
        "summary": "We study networks of processes that all execute the same finite state\nprotocol and that communicate through broadcasts. The processes are organized\nin a graph (a topology) and only the neighbors of a process in this graph can\nreceive its broadcasts. The coverability problem asks, given a protocol and a\nstate of the protocol, whether there is a topology for the processes such that\none of them (at least) reaches the given state. This problem is undecidable. We\nstudy here an under-approximation of the problem where processes alternate a\nbounded number of times $k$ between phases of broadcasting and phases of\nreceiving messages. We show that, if the problem remains undecidable when $k$\nis greater than 6, it becomes decidable for $k=2$, and EXPSPACE-complete for\n$k=1$. Furthermore, we show that if we restrict ourselves to line topologies,\nthe problem is in $P$ for $k=1$ and $k=2$.",
        "updated": "2024-06-21 14:43:23 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.15202v1"
    }
]