[
    {
        "title": "On The Power of Subtle Expressive Cues in the Perception of Human Affects",
        "authors": "Ezgi DedeKamile Asli AgilonuErgun AklemanMetin Sezgin",
        "links": "http://arxiv.org/abs/2401.18013v1",
        "entry_id": "http://arxiv.org/abs/2401.18013v1",
        "pdf_url": "http://arxiv.org/pdf/2401.18013v1",
        "summary": "In this study, we introduce a sketch-based method for testing how subtle\nexpressive cues influence the perception of affect in illustrations of human\nfigures. We specifically study the impact of human posture and gaze direction,\nimplicitly specified through nose orientation, on perceived emotions and mood.\nThrough a series of user studies using sketchy illustrations of a running\nfigure, where a professional illustrator manipulated gaze direction through\nadjustments on the nose orientation, we found that this simple change resulted\nin a diverse range of perceived affects, spanning from fear to concern and\nwonder. These findings shed light on the importance of fine details in defining\ncontext for context-aware system designs and underscore the importance of\nrecognizing and expressing affect. Understanding minor expressive cues is\ncrucial to developing emotionally intelligent systems capable of expressing\naffect.",
        "updated": "2024-01-31 17:20:36 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.18013v1"
    },
    {
        "title": "Technological Shocks and Algorithmic Decision Aids in Credence Goods Markets",
        "authors": "Alexander ErleiLukas Meub",
        "links": "http://arxiv.org/abs/2401.17929v1",
        "entry_id": "http://arxiv.org/abs/2401.17929v1",
        "pdf_url": "http://arxiv.org/pdf/2401.17929v1",
        "summary": "In credence goods markets such as health care or repair services, consumers\nrely on experts with superior information to adequately diagnose and treat\nthem. Experts, however, are constrained in their diagnostic abilities, which\nhurts market efficiency and consumer welfare. Technological breakthroughs that\nsubstitute or complement expert judgments have the potential to alleviate\nconsumer mistreatment. This article studies how competitive experts adopt novel\ndiagnostic technologies when skills are heterogeneously distributed and\nobfuscated to consumers. We differentiate between novel technologies that\nincrease expert abilities, and algorithmic decision aids that complement expert\njudgments, but do not affect an expert's personal diagnostic precision. We show\nthat high-ability experts may be incentivized to forego the decision aid in\norder to escape a pooling equilibrium by differentiating themselves from\nlow-ability experts. Results from an online experiment support our hypothesis,\nshowing that high-ability experts are significantly less likely than\nlow-ability experts to invest into an algorithmic decision aid. Furthermore, we\ndocument pervasive under-investments, and no effect on expert honesty.",
        "updated": "2024-01-31 15:41:37 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.17929v1"
    },
    {
        "title": "Making Sense of Knowledge Intensive Processes: an Oil & Gas Industry Scenario",
        "authors": "Juliana Jansen FerreiraVinícius SeguraAna FucsRogério de Paula",
        "links": "http://arxiv.org/abs/2401.17866v1",
        "entry_id": "http://arxiv.org/abs/2401.17866v1",
        "pdf_url": "http://arxiv.org/pdf/2401.17866v1",
        "summary": "Sensemaking is a constant and ongoing process by which people associate\nmeaning to experiences. It can be an individual process, known as abduction, or\na group process by which people give meaning to collective experiences. The\nsensemaking of a group is influenced by the abduction process of each person\nabout the experience. Every collaborative process needs some level of\nsensemaking to show results. For a knowledge intensive process, sensemaking is\ncentral and related to most of its tasks. We present findings from a fieldwork\nexecuted in knowledge intensive process from the Oil and Gas industry. Our\nfindings indicated that different types of knowledge can be combined to compose\nthe result of a sensemaking process (e.g. decision, the need for more\ndiscussion, etc.). This paper presents an initial set of knowledge types that\ncan be combined to compose the result of the sensemaking of a collaborative\ndecision making process. We also discuss ideas for using systems powered by\nArtificial Intelligence to support sensemaking processes.",
        "updated": "2024-01-31 14:25:05 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.17866v1"
    },
    {
        "title": "Beyond Numbers: Creating Analogies to Enhance Data Comprehension and Communication with Generative AI",
        "authors": "Qing ChenWei ShuaiJiyao ZhangZhida SunNan Cao",
        "links": "http://arxiv.org/abs/2401.17856v1",
        "entry_id": "http://arxiv.org/abs/2401.17856v1",
        "pdf_url": "http://arxiv.org/pdf/2401.17856v1",
        "summary": "Unfamiliar measurements usually hinder readers from grasping the scale of the\nnumerical data, understanding the content, and feeling engaged with the\ncontext. To enhance data comprehension and communication, we leverage analogies\nto bridge the gap between abstract data and familiar measurements. In this\nwork, we first conduct semi-structured interviews with design experts to\nidentify design problems and summarize design considerations. Then, we collect\nan analogy dataset of 138 cases from various online sources. Based on the\ncollected dataset, we characterize a design space for creating data analogies.\nNext, we build a prototype system, AnalogyMate, that automatically suggests\ndata analogies, their corresponding design solutions, and generated visual\nrepresentations powered by generative AI. The study results show the usefulness\nof AnalogyMate in aiding the creation process of data analogies and the\neffectiveness of data analogy in enhancing data comprehension and\ncommunication.",
        "updated": "2024-01-31 14:17:52 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.17856v1"
    },
    {
        "title": "Network-based Topic Structure Visualization",
        "authors": "Yeseul JeonJina ParkIck Hoon JinDongjun Chungc",
        "links": "http://arxiv.org/abs/2401.17855v1",
        "entry_id": "http://arxiv.org/abs/2401.17855v1",
        "pdf_url": "http://arxiv.org/pdf/2401.17855v1",
        "summary": "In the real world, many topics are inter-correlated, making it challenging to\ninvestigate their structure and relationships. Understanding the interplay\nbetween topics and their relevance can provide valuable insights for\nresearchers, guiding their studies and informing the direction of research. In\nthis paper, we utilize the topic-words distribution, obtained from topic\nmodels, as item-response data to model the structure of topics using a latent\nspace item response model. By estimating the latent positions of topics based\non their distances toward words, we can capture the underlying topic structure\nand reveal their relationships. Visualizing the latent positions of topics in\nEuclidean space allows for an intuitive understanding of their proximity and\nassociations. We interpret relationships among topics by characterizing each\ntopic based on representative words selected using a newly proposed scoring\nscheme. Additionally, we assess the maturity of topics by tracking their latent\npositions using different word sets, providing insights into the robustness of\ntopics. To demonstrate the effectiveness of our approach, we analyze the topic\ncomposition of COVID-19 studies during the early stage of its emergence using\nbiomedical literature in the PubMed database. The software and data used in\nthis paper are publicly available at https://github.com/jeon9677/gViz .",
        "updated": "2024-01-31 14:17:00 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.17855v1"
    }
]