[
    {
        "title": "The computational power of a human society: a new model of social evolution",
        "authors": "David H. WolpertKyle Harper",
        "links": "http://arxiv.org/abs/2408.08861v1",
        "entry_id": "http://arxiv.org/abs/2408.08861v1",
        "pdf_url": "http://arxiv.org/pdf/2408.08861v1",
        "summary": "Social evolutionary theory seeks to explain increases in the scale and\ncomplexity of human societies, from origins to present. Over the course of the\ntwentieth century, social evolutionary theory largely fell out of favor as a\nway of investigating human history, just as advances in complex systems science\nand computer science saw the emergence of powerful new conceptions of complex\nsystems, and in particular new methods of measuring complexity. We propose that\nthese advances in our understanding of complex systems and computer science\nshould be brought to bear on our investigations into human history. To that\nend, we present a new framework for modeling how human societies co-evolve with\ntheir biotic environments, recognizing that both a society and its environment\nare computers. This leads us to model the dynamics of each of those two systems\nusing the same, new kind of computational machine, which we define here. For\nsimplicity, we construe a society as a set of interacting occupations and\ntechnologies. Similarly, under such a model, a biotic environment is a set of\ninteracting distinct ecological and climatic processes. This provides novel\nways to characterize social complexity, which we hope will cast new light on\nthe archaeological and historical records. Our framework also provides a\nnatural way to formalize both the energetic (thermodynamic) costs required by a\nsociety as it runs, and the ways it can extract thermodynamic resources from\nthe environment in order to pay for those costs -- and perhaps to grow with any\nleft-over resources.",
        "updated": "2024-08-16 17:42:28 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.08861v1"
    },
    {
        "title": "AgentSimulator: An Agent-based Approach for Data-driven Business Process Simulation",
        "authors": "Lukas KirchdorferRobert BlümelTimotheus KampikHan van der AaHeiner Stuckenschmidt",
        "links": "http://arxiv.org/abs/2408.08571v1",
        "entry_id": "http://arxiv.org/abs/2408.08571v1",
        "pdf_url": "http://arxiv.org/pdf/2408.08571v1",
        "summary": "Business process simulation (BPS) is a versatile technique for estimating\nprocess performance across various scenarios. Traditionally, BPS approaches\nemploy a control-flow-first perspective by enriching a process model with\nsimulation parameters. Although such approaches can mimic the behavior of\ncentrally orchestrated processes, such as those supported by workflow systems,\ncurrent control-flow-first approaches cannot faithfully capture the dynamics of\nreal-world processes that involve distinct resource behavior and decentralized\ndecision-making. Recognizing this issue, this paper introduces AgentSimulator,\na resource-first BPS approach that discovers a multi-agent system from an event\nlog, modeling distinct resource behaviors and interaction patterns to simulate\nthe underlying process. Our experiments show that AgentSimulator achieves\nstate-of-the-art simulation accuracy with significantly lower computation times\nthan existing approaches while providing high interpretability and adaptability\nto different types of process-execution scenarios.",
        "updated": "2024-08-16 07:19:11 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.08571v1"
    },
    {
        "title": "Multilevel Graph Reinforcement Learning for Consistent Cognitive Decision-making in Heterogeneous Mixed Autonomy",
        "authors": "Xin GaoZhaoyang MaXueyuan LiXiaoqiang MengZirui Li",
        "links": "http://arxiv.org/abs/2408.08516v1",
        "entry_id": "http://arxiv.org/abs/2408.08516v1",
        "pdf_url": "http://arxiv.org/pdf/2408.08516v1",
        "summary": "In the realm of heterogeneous mixed autonomy, vehicles experience dynamic\nspatial correlations and nonlinear temporal interactions in a complex,\nnon-Euclidean space. These complexities pose significant challenges to\ntraditional decision-making frameworks. Addressing this, we propose a\nhierarchical reinforcement learning framework integrated with multilevel graph\nrepresentations, which effectively comprehends and models the spatiotemporal\ninteractions among vehicles navigating through uncertain traffic conditions\nwith varying decision-making systems. Rooted in multilevel graph representation\ntheory, our approach encapsulates spatiotemporal relationships inherent in\nnon-Euclidean spaces. A weighted graph represents spatiotemporal features\nbetween nodes, addressing the degree imbalance inherent in dynamic graphs. We\nintegrate asynchronous parallel hierarchical reinforcement learning with a\nmultilevel graph representation and a multi-head attention mechanism, which\nenables connected autonomous vehicles (CAVs) to exhibit capabilities akin to\nhuman cognition, facilitating consistent decision-making across various\ncritical dimensions. The proposed decision-making strategy is validated in\nchallenging environments characterized by high density, randomness, and\ndynamism on highway roads. We assess the performance of our framework through\nablation studies, comparative analyses, and spatiotemporal trajectory\nevaluations. This study presents a quantitative analysis of decision-making\nmechanisms mirroring human cognitive functions in the realm of heterogeneous\nmixed autonomy, promoting the development of multi-dimensional decision-making\nstrategies and a sophisticated distribution of attentional resources.",
        "updated": "2024-08-16 04:14:06 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.08516v1"
    },
    {
        "title": "Data-driven Construction of Finite Abstractions for Interconnected Systems: A Compositional Approach",
        "authors": "Daniel AjeleyeMajid Zamani",
        "links": "http://arxiv.org/abs/2408.08497v1",
        "entry_id": "http://arxiv.org/abs/2408.08497v1",
        "pdf_url": "http://arxiv.org/pdf/2408.08497v1",
        "summary": "Finite-state abstractions (a.k.a. symbolic models) present a promising avenue\nfor the formal verification and synthesis of controllers in continuous-space\ncontrol systems. These abstractions provide simplified models that capture the\nfundamental behaviors of the original systems. However, the creation of such\nabstractions typically relies on the availability of precise knowledge\nconcerning system dynamics, which might not be available in many real-world\napplications. In this work, we introduce an innovative, data-driven, and\ncompositional approach to generate finite abstractions for interconnected\nsystems that consist of discrete-time control subsystems with unknown dynamics.\nThese subsystems interact through an unknown static interconnection map. Our\nmethodology for abstracting the interconnected system involves constructing\nabstractions for individual subsystems and incorporating an abstraction of the\ninterconnection map.",
        "updated": "2024-08-16 02:42:17 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.08497v1"
    },
    {
        "title": "Stochastic Semi-Gradient Descent for Learning Mean Field Games with Population-Aware Function Approximation",
        "authors": "Chenyu ZhangXu ChenXuan Di",
        "links": "http://arxiv.org/abs/2408.08192v1",
        "entry_id": "http://arxiv.org/abs/2408.08192v1",
        "pdf_url": "http://arxiv.org/pdf/2408.08192v1",
        "summary": "Mean field games (MFGs) model the interactions within a large-population\nmulti-agent system using the population distribution. Traditional learning\nmethods for MFGs are based on fixed-point iteration (FPI), which calculates\nbest responses and induced population distribution separately and sequentially.\nHowever, FPI-type methods suffer from inefficiency and instability, due to\noscillations caused by the forward-backward procedure. This paper considers an\nonline learning method for MFGs, where an agent updates its policy and\npopulation estimates simultaneously and fully asynchronously, resulting in a\nsimple stochastic gradient descent (SGD) type method called SemiSGD. Not only\ndoes SemiSGD exhibit numerical stability and efficiency, but it also provides a\nnovel perspective by treating the value function and population distribution as\na unified parameter. We theoretically show that SemiSGD directs this unified\nparameter along a descent direction to the mean field equilibrium. Motivated by\nthis perspective, we develop a linear function approximation (LFA) for both the\nvalue function and the population distribution, resulting in the first\npopulation-aware LFA for MFGs on continuous state-action space. Finite-time\nconvergence and approximation error analysis are provided for SemiSGD equipped\nwith population-aware LFA.",
        "updated": "2024-08-15 14:51:50 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.08192v1"
    }
]