[
    {
        "title": "SolderlessPCB: Reusing Electronic Components in PCB Prototyping through Detachable 3D Printed Housings",
        "authors": "Zeyu YanJiasheng LiZining ZhangHuaishu Peng",
        "links": "http://dx.doi.org/10.1145/3613904.3642765",
        "entry_id": "http://arxiv.org/abs/2403.18797v1",
        "pdf_url": "http://arxiv.org/pdf/2403.18797v1",
        "summary": "The iterative prototyping process for printed circuit boards (PCBs)\nfrequently employs surface-mounted device (SMD) components, which are often\ndiscarded rather than reused due to the challenges associated with desoldering,\nleading to unnecessary electronic waste. This paper introduces SolderlessPCB, a\ncollection of techniques for solder-free PCB prototyping, specifically designed\nto promote the recycling and reuse of electronic components. Central to this\napproach are custom 3D-printable housings that allow SMD components to be\nmounted onto PCBs without soldering. We detail the design of SolderlessPCB and\nthe experiments conducted to evaluate its design parameters, electrical\nperformance, and durability. To illustrate the potential for reusing SMD\ncomponents with SolderlessPCB, we discuss two scenarios: the reuse of\ncomponents from earlier design iterations and from obsolete prototypes. We also\nprovide examples demonstrating that SolderlessPCB can handle high-current\napplications and is suitable for high-speed data transmission. The paper\nconcludes by discussing the limitations of our approach and suggesting future\ndirections to overcome these challenges.",
        "updated": "2024-03-27 17:44:29 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.18797v1"
    },
    {
        "title": "Teaching Introductory HRI: UChicago Course \"Human-Robot Interaction: Research and Practice\"",
        "authors": "Sarah Sebo",
        "links": "http://arxiv.org/abs/2403.18692v1",
        "entry_id": "http://arxiv.org/abs/2403.18692v1",
        "pdf_url": "http://arxiv.org/pdf/2403.18692v1",
        "summary": "In 2020, I designed the course CMSC 20630/30630 Human-Robot Interaction:\nResearch and Practice as a hands-on introduction to human-robot interaction\n(HRI) research for both undergraduate and graduate students at the University\nof Chicago. Since 2020, I have taught and refined this course each academic\nyear. Human-Robot Interaction: Research and Practice focuses on the core\nconcepts and cutting-edge research in the field of human-robot interaction\n(HRI), covering topics that include: nonverbal robot behavior, verbal robot\nbehavior, social dynamics, norms & ethics, collaboration & learning, group\ninteractions, applications, and future challenges of HRI. Course meetings\ninvolve students in the class leading discussions about cutting-edge\npeer-reviewed research HRI publications. Students also participate in a\nquarter-long collaborative research project, where they pursue an HRI research\nquestion that often involves conducing their own human-subjects research study\nwhere they recruit human subjects to interact with a robot. In this paper, I\ndetail the structure of the course and its learning goals as well as my\nreflections and student feedback on the course.",
        "updated": "2024-03-27 15:42:01 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.18692v1"
    },
    {
        "title": "An Exploratory Study on Upper-Level Computing Students' Use of Large Language Models as Tools in a Semester-Long Project",
        "authors": "Ben Arie TanayLexy ArinzeSiddhant S. JoshiKirsten A. DavisJames C. Davis",
        "links": "http://arxiv.org/abs/2403.18679v1",
        "entry_id": "http://arxiv.org/abs/2403.18679v1",
        "pdf_url": "http://arxiv.org/pdf/2403.18679v1",
        "summary": "Background: Large Language Models (LLMs) such as ChatGPT and CoPilot are\ninfluencing software engineering practice. Software engineering educators must\nteach future software engineers how to use such tools well. As of yet, there\nhave been few studies that report on the use of LLMs in the classroom. It is,\ntherefore, important to evaluate students' perception of LLMs and possible ways\nof adapting the computing curriculum to these shifting paradigms.\n  Purpose: The purpose of this study is to explore computing students'\nexperiences and approaches to using LLMs during a semester-long software\nengineering project.\n  Design/Method: We collected data from a senior-level software engineering\ncourse at Purdue University. This course uses a project-based learning (PBL)\ndesign. The students used LLMs such as ChatGPT and Copilot in their projects. A\nsample of these student teams were interviewed to understand (1) how they used\nLLMs in their projects; and (2) whether and how their perspectives on LLMs\nchanged over the course of the semester. We analyzed the data to identify\nthemes related to students' usage patterns and learning outcomes.\n  Results/Discussion: When computing students utilize LLMs within a project,\ntheir use cases cover both technical and professional applications. In\naddition, these students perceive LLMs to be efficient tools in obtaining\ninformation and completion of tasks. However, there were concerns about the\nresponsible use of LLMs without being detrimental to their own learning\noutcomes. Based on our findings, we recommend future research to investigate\nthe usage of LLM's in lower-level computer engineering courses to understand\nwhether and how LLMs can be integrated as a learning aid without hurting the\nlearning outcomes.",
        "updated": "2024-03-27 15:21:58 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.18679v1"
    },
    {
        "title": "Aiming for Relevance",
        "authors": "Bar Eini PoratDanny EytanUri Shalit",
        "links": "http://arxiv.org/abs/2403.18668v1",
        "entry_id": "http://arxiv.org/abs/2403.18668v1",
        "pdf_url": "http://arxiv.org/pdf/2403.18668v1",
        "summary": "Vital signs are crucial in intensive care units (ICUs). They are used to\ntrack the patient's state and to identify clinically significant changes.\nPredicting vital sign trajectories is valuable for early detection of adverse\nevents. However, conventional machine learning metrics like RMSE often fail to\ncapture the true clinical relevance of such predictions. We introduce novel\nvital sign prediction performance metrics that align with clinical contexts,\nfocusing on deviations from clinical norms, overall trends, and trend\ndeviations. These metrics are derived from empirical utility curves obtained in\na previous study through interviews with ICU clinicians. We validate the\nmetrics' usefulness using simulated and real clinical datasets (MIMIC and\neICU). Furthermore, we employ these metrics as loss functions for neural\nnetworks, resulting in models that excel in predicting clinically significant\nevents. This research paves the way for clinically relevant machine learning\nmodel evaluation and optimization, promising to improve ICU patient care. 10\npages, 9 figures.",
        "updated": "2024-03-27 15:11:07 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.18668v1"
    },
    {
        "title": "Antitrust, Amazon, and Algorithmic Auditing",
        "authors": "Abhisek DashAbhijnan ChakrabortySaptarshi GhoshAnimesh MukherjeeJens FrankenreiterStefan BechtoldKrishna P. Gummadi",
        "links": "http://arxiv.org/abs/2403.18623v1",
        "entry_id": "http://arxiv.org/abs/2403.18623v1",
        "pdf_url": "http://arxiv.org/pdf/2403.18623v1",
        "summary": "In digital markets, antitrust law and special regulations aim to ensure that\nmarkets remain competitive despite the dominating role that digital platforms\nplay today in everyone's life. Unlike traditional markets, market participant\nbehavior is easily observable in these markets. We present a series of\nempirical investigations into the extent to which Amazon engages in practices\nthat are typically described as self-preferencing. We discuss how the computer\nscience tools used in this paper can be used in a regulatory environment that\nis based on algorithmic auditing and requires regulating digital markets at\nscale.",
        "updated": "2024-03-27 14:34:22 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.18623v1"
    }
]