[
    {
        "title": "Safety Verification of Wait-Only Non-Blocking Broadcast Protocols",
        "authors": "Lucie GuillouArnaud SangnierNathalie Sznajder",
        "links": "http://arxiv.org/abs/2403.18591v1",
        "entry_id": "http://arxiv.org/abs/2403.18591v1",
        "pdf_url": "http://arxiv.org/pdf/2403.18591v1",
        "summary": "We study networks of processes that all execute the same finite protocol and\ncommunicate synchronously in two different ways: a process can broadcast one\nmessage to all other processes or send it to at most one other process. In both\ncases, if no process can receive the message, it will still be sent. We\nestablish a precise complexity class for two coverability problems with a\nparameterised number of processes: the state coverability problem and the\nconfiguration coverability problem. It is already known that these problems are\nAckermann-hard (but decidable) in the general case. We show that when the\nprotocol is Wait-Only, i.e., it has no state from which a process can send and\nreceive messages, the complexity drops to P and PSPACE, respectively.",
        "updated": "2024-03-27 14:17:33 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.18591v1"
    },
    {
        "title": "Incentive-Compatible Vertiport Reservation in Advanced Air Mobility: An Auction-Based Approach",
        "authors": "Pan-Yang SuChinmay MaheshwariVictoria TuckShankar Sastry",
        "links": "http://arxiv.org/abs/2403.18166v1",
        "entry_id": "http://arxiv.org/abs/2403.18166v1",
        "pdf_url": "http://arxiv.org/pdf/2403.18166v1",
        "summary": "The rise of advanced air mobility (AAM) is expected to become a\nmultibillion-dollar industry in the near future. Market-based mechanisms are\ntouted to be an integral part of AAM operations, which comprise heterogeneous\noperators with private valuations. In this work, we study the problem of\ndesigning a mechanism to coordinate the movement of electric vertical take-off\nand landing (eVTOL) aircraft, operated by multiple operators each having\nheterogeneous valuations associated with their fleet, between vertiports, while\nenforcing the arrival, departure, and parking constraints at vertiports.\nParticularly, we propose an incentive-compatible and individually rational\nvertiport reservation mechanism that maximizes a social welfare metric, which\nencapsulates the objective of maximizing the overall valuations of all\noperators while minimizing the congestion at vertiports. Additionally, we\nimprove the computational tractability of designing the reservation mechanism\nby proposing a mixed binary linear programming approach that is based on\nconstructing network flow graph corresponding to the underlying problem.",
        "updated": "2024-03-27 00:21:49 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.18166v1"
    },
    {
        "title": "A Real-Time Rescheduling Algorithm for Multi-robot Plan Execution",
        "authors": "Ying FengAdittyo PaulZhe ChenJiaoyang Li",
        "links": "http://arxiv.org/abs/2403.18145v1",
        "entry_id": "http://arxiv.org/abs/2403.18145v1",
        "pdf_url": "http://arxiv.org/pdf/2403.18145v1",
        "summary": "One area of research in multi-agent path finding is to determine how\nreplanning can be efficiently achieved in the case of agents being delayed\nduring execution. One option is to reschedule the passing order of agents,\ni.e., the sequence in which agents visit the same location. In response, we\npropose Switchable-Edge Search (SES), an A*-style algorithm designed to find\noptimal passing orders. We prove the optimality of SES and evaluate its\nefficiency via simulations. The best variant of SES takes less than 1 second\nfor small- and medium-sized problems and runs up to 4 times faster than\nbaselines for large-sized problems.",
        "updated": "2024-03-26 23:10:41 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.18145v1"
    },
    {
        "title": "CMP: Cooperative Motion Prediction with Multi-Agent Communication",
        "authors": "Zhuoyuan WuYuping WangHengbo MaZhaowei LiHang QiuJiachen Li",
        "links": "http://arxiv.org/abs/2403.17916v1",
        "entry_id": "http://arxiv.org/abs/2403.17916v1",
        "pdf_url": "http://arxiv.org/pdf/2403.17916v1",
        "summary": "The confluence of the advancement of Autonomous Vehicles (AVs) and the\nmaturity of Vehicle-to-Everything (V2X) communication has enabled the\ncapability of cooperative connected and automated vehicles (CAVs). Building on\ntop of cooperative perception, this paper explores the feasibility and\neffectiveness of cooperative motion prediction. Our method, CMP, takes LiDAR\nsignals as input to enhance tracking and prediction capabilities. Unlike\nprevious work that focuses separately on either cooperative perception or\nmotion prediction, our framework, to the best of our knowledge, is the first to\naddress the unified problem where CAVs share information in both perception and\nprediction modules. Incorporated into our design is the unique capability to\ntolerate realistic V2X bandwidth limitations and transmission delays, while\ndealing with bulky perception representations. We also propose a prediction\naggregation module, which unifies the predictions obtained by different CAVs\nand generates the final prediction. Through extensive experiments and ablation\nstudies, we demonstrate the effectiveness of our method in cooperative\nperception, tracking, and motion prediction tasks. In particular, CMP reduces\nthe average prediction error by 17.2\\% with fewer missing detections compared\nwith the no cooperation setting. Our work marks a significant step forward in\nthe cooperative capabilities of CAVs, showcasing enhanced performance in\ncomplex scenarios.",
        "updated": "2024-03-26 17:53:27 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.17916v1"
    },
    {
        "title": "Scenario-Based Curriculum Generation for Multi-Agent Autonomous Driving",
        "authors": "Axel BrunnbauerLuigi BerducciPeter PrillerDejan NickovicRadu Grosu",
        "links": "http://arxiv.org/abs/2403.17805v1",
        "entry_id": "http://arxiv.org/abs/2403.17805v1",
        "pdf_url": "http://arxiv.org/pdf/2403.17805v1",
        "summary": "The automated generation of diverse and complex training scenarios has been\nan important ingredient in many complex learning tasks. Especially in\nreal-world application domains, such as autonomous driving, auto-curriculum\ngeneration is considered vital for obtaining robust and general policies.\nHowever, crafting traffic scenarios with multiple, heterogeneous agents is\ntypically considered as a tedious and time-consuming task, especially in more\ncomplex simulation environments. In our work, we introduce MATS-Gym, a\nMulti-Agent Traffic Scenario framework to train agents in CARLA, a\nhigh-fidelity driving simulator. MATS-Gym is a multi-agent training framework\nfor autonomous driving that uses partial scenario specifications to generate\ntraffic scenarios with variable numbers of agents. This paper unifies various\nexisting approaches to traffic scenario description into a single training\nframework and demonstrates how it can be integrated with techniques from\nunsupervised environment design to automate the generation of adaptive\nauto-curricula. The code is available at\nhttps://github.com/AutonomousDrivingExaminer/mats-gym.",
        "updated": "2024-03-26 15:42:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.17805v1"
    }
]