[
    {
        "title": "AI as a Child of Mother Earth: Regrounding Human-AI Interaction in Ecological Thinking",
        "authors": "Chunchen XuXiao Ge",
        "links": "http://dx.doi.org/10.1145/3613905.3644065",
        "entry_id": "http://arxiv.org/abs/2403.06943v1",
        "pdf_url": "http://arxiv.org/pdf/2403.06943v1",
        "summary": "The anthropocentric cultural idea that humans are active agents exerting\ncontrol over their environments has been largely normalized and inscribed in\npractices, policies, and products of contemporary industrialized societies.\nThis view underlies a human-ecology relationship based on resource and\nknowledge extraction. To create a more sustainable and equitable future, it is\nessential to consider alternative cultural ideas rooted in ecological thinking.\nThis perspective underscores the interconnectedness between humans and\nmore-than-human worlds. We propose a path to reshape the human-ecology\nrelationship by advocating for alternative human-AI interactions. In this\npaper, we undertake a critical comparison between anthropocentrism and\necological thinking, using storytelling to illustrate various human-AI\ninteractions that embody ecological thinking. We also delineate a set of design\nprinciples aimed at guiding AI developments toward fostering a more caring\nhuman-ecology relationship.",
        "updated": "2024-03-11 17:30:22 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.06943v1"
    },
    {
        "title": "Data Cubes in Hand: A Design Space of Tangible Cubes for Visualizing 3D Spatio-Temporal Data in Mixed Reality",
        "authors": "Shuqi HeHaonan YaoLuyan JiangKaiwen LiNan XiangYue LiHai-Ning LiangLingyun Yu",
        "links": "http://dx.doi.org/10.1145/3613904.3642740",
        "entry_id": "http://arxiv.org/abs/2403.06891v1",
        "pdf_url": "http://arxiv.org/pdf/2403.06891v1",
        "summary": "Tangible interfaces in mixed reality (MR) environments allow for intuitive\ndata interactions. Tangible cubes, with their rich interaction affordances,\nhigh maneuverability, and stable structure, are particularly well-suited for\nexploring multi-dimensional data types. However, the design potential of these\ncubes is underexplored. This study introduces a design space for tangible cubes\nin MR, focusing on interaction space, visualization space, sizes, and\nmultiplicity. Using spatio-temporal data, we explored the interaction\naffordances of these cubes in a workshop (N=24). We identified unique\ninteractions like rotating, tapping, and stacking, which are linked to\naugmented reality (AR) visualization commands. Integrating user-identified\ninteractions, we created a design space for tangible-cube interactions and\nvisualization. A prototype visualizing global health spending with small cubes\nwas developed and evaluated, supporting both individual and combined cube\nmanipulation. This research enhances our grasp of tangible interaction in MR,\noffering insights for future design and application in diverse data contexts.",
        "updated": "2024-03-11 16:47:39 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.06891v1"
    },
    {
        "title": "Transparent AI Disclosure Obligations: Who, What, When, Where, Why, How",
        "authors": "Abdallah El AliKarthikeya Puttur VenkatrajSophie MorosoliLaurens NaudtsNatali HelbergerPablo Cesar",
        "links": "http://dx.doi.org/10.1145/3613905.3650750",
        "entry_id": "http://arxiv.org/abs/2403.06823v1",
        "pdf_url": "http://arxiv.org/pdf/2403.06823v1",
        "summary": "Advances in Generative Artificial Intelligence (AI) are resulting in\nAI-generated media output that is (nearly) indistinguishable from human-created\ncontent. This can drastically impact users and the media sector, especially\ngiven global risks of misinformation. While the currently discussed European AI\nAct aims at addressing these risks through Article 52's AI transparency\nobligations, its interpretation and implications remain unclear. In this early\nwork, we adopt a participatory AI approach to derive key questions based on\nArticle 52's disclosure obligations. We ran two workshops with researchers,\ndesigners, and engineers across disciplines (N=16), where participants\ndeconstructed Article 52's relevant clauses using the 5W1H framework. We\ncontribute a set of 149 questions clustered into five themes and 18 sub-themes.\nWe believe these can not only help inform future legal developments and\ninterpretations of Article 52, but also provide a starting point for\nHuman-Computer Interaction research to (re-)examine disclosure transparency\nfrom a human-centered AI lens.",
        "updated": "2024-03-11 15:40:36 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.06823v1"
    },
    {
        "title": "Born to Run, Programmed to Play: Mapping the Extended Reality Exergames Landscape",
        "authors": "Sukran KaraosmanogluSebastian CmentowskiLennart E. NackeFrank Steinicke",
        "links": "http://dx.doi.org/10.1145/3613904.3642124",
        "entry_id": "http://arxiv.org/abs/2403.06776v1",
        "pdf_url": "http://arxiv.org/pdf/2403.06776v1",
        "summary": "Many people struggle to exercise regularly, raising the risk of serious\nhealth-related issues. Extended reality (XR) exergames address these hurdles by\ncombining physical exercises with enjoyable, immersive gameplay. While a\ngrowing body of research explores XR exergames, no previous review has\nstructured this rapidly expanding research landscape. We conducted a scoping\nreview of the current state of XR exergame research to (i) provide a structured\noverview, (ii) highlight trends, and (iii) uncover knowledge gaps. After\nidentifying 1318 papers in human-computer interaction and medical databases, we\nultimately included 186 papers in our analysis. We provide a quantitative and\nqualitative summary of XR exergame research, showing current trends and\npotential future considerations. Finally, we provide a taxonomy of XR exergames\nto help future design and methodological investigation and reporting.",
        "updated": "2024-03-11 14:43:56 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.06776v1"
    },
    {
        "title": "HILL: A Hallucination Identifier for Large Language Models",
        "authors": "Florian LeiserSven EckhardtValentin LeutheMerlin KnaebleAlexander MaedcheGerhard SchwabeAli Sunyaev",
        "links": "http://arxiv.org/abs/2403.06710v1",
        "entry_id": "http://arxiv.org/abs/2403.06710v1",
        "pdf_url": "http://arxiv.org/pdf/2403.06710v1",
        "summary": "Large language models (LLMs) are prone to hallucinations, i.e., nonsensical,\nunfaithful, and undesirable text. Users tend to overrely on LLMs and\ncorresponding hallucinations which can lead to misinterpretations and errors.\nTo tackle the problem of overreliance, we propose HILL, the \"Hallucination\nIdentifier for Large Language Models\". First, we identified design features for\nHILL with a Wizard of Oz approach with nine participants. Subsequently, we\nimplemented HILL based on the identified design features and evaluated HILL's\ninterface design by surveying 17 participants. Further, we investigated HILL's\nfunctionality to identify hallucinations based on an existing\nquestion-answering dataset and five user interviews. We find that HILL can\ncorrectly identify and highlight hallucinations in LLM responses which enables\nusers to handle LLM responses with more caution. With that, we propose an\neasy-to-implement adaptation to existing LLMs and demonstrate the relevance of\nuser-centered designs of AI artifacts.",
        "updated": "2024-03-11 13:36:00 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.06710v1"
    }
]