[
    {
        "title": "Generalising Multi-Agent Cooperation through Task-Agnostic Communication",
        "authors": "Dulhan JayalathSteven MoradAmanda Prorok",
        "links": "http://arxiv.org/abs/2403.06750v1",
        "entry_id": "http://arxiv.org/abs/2403.06750v1",
        "pdf_url": "http://arxiv.org/pdf/2403.06750v1",
        "summary": "Existing communication methods for multi-agent reinforcement learning (MARL)\nin cooperative multi-robot problems are almost exclusively task-specific,\ntraining new communication strategies for each unique task. We address this\ninefficiency by introducing a communication strategy applicable to any task\nwithin a given environment. We pre-train the communication strategy without\ntask-specific reward guidance in a self-supervised manner using a set\nautoencoder. Our objective is to learn a fixed-size latent Markov state from a\nvariable number of agent observations. Under mild assumptions, we prove that\npolicies using our latent representations are guaranteed to converge, and upper\nbound the value error introduced by our Markov state approximation. Our method\nenables seamless adaptation to novel tasks without fine-tuning the\ncommunication strategy, gracefully supports scaling to more agents than present\nduring training, and detects out-of-distribution events in an environment.\nEmpirical results on diverse MARL scenarios validate the effectiveness of our\napproach, surpassing task-specific communication strategies in unseen tasks.\nOur implementation of this work is available at\nhttps://github.com/proroklab/task-agnostic-comms.",
        "updated": "2024-03-11 14:20:13 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.06750v1"
    },
    {
        "title": "FashionReGen: LLM-Empowered Fashion Report Generation",
        "authors": "Yujuan DingYunshan MaWenqi FanYige YaoTat-Seng ChuaQing Li",
        "links": "http://arxiv.org/abs/2403.06660v1",
        "entry_id": "http://arxiv.org/abs/2403.06660v1",
        "pdf_url": "http://arxiv.org/pdf/2403.06660v1",
        "summary": "Fashion analysis refers to the process of examining and evaluating trends,\nstyles, and elements within the fashion industry to understand and interpret\nits current state, generating fashion reports. It is traditionally performed by\nfashion professionals based on their expertise and experience, which requires\nhigh labour cost and may also produce biased results for relying heavily on a\nsmall group of people. In this paper, to tackle the Fashion Report Generation\n(FashionReGen) task, we propose an intelligent Fashion Analyzing and Reporting\nsystem based the advanced Large Language Models (LLMs), debbed as GPT-FAR.\nSpecifically, it tries to deliver FashionReGen based on effective catwalk\nanalysis, which is equipped with several key procedures, namely, catwalk\nunderstanding, collective organization and analysis, and report generation. By\nposing and exploring such an open-ended, complex and domain-specific task of\nFashionReGen, it is able to test the general capability of LLMs in fashion\ndomain. It also inspires the explorations of more high-level tasks with\nindustrial significance in other domains. Video illustration and more materials\nof GPT-FAR can be found in https://github.com/CompFashion/FashionReGen.",
        "updated": "2024-03-11 12:29:35 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.06660v1"
    },
    {
        "title": "Decentralized and Lifelong-Adaptive Multi-Agent Collaborative Learning",
        "authors": "Shuo TangRui YeChenxin XuXiaowen DongSiheng ChenYanfeng Wang",
        "links": "http://arxiv.org/abs/2403.06535v1",
        "entry_id": "http://arxiv.org/abs/2403.06535v1",
        "pdf_url": "http://arxiv.org/pdf/2403.06535v1",
        "summary": "Decentralized and lifelong-adaptive multi-agent collaborative learning aims\nto enhance collaboration among multiple agents without a central server, with\neach agent solving varied tasks over time. To achieve efficient collaboration,\nagents should: i) autonomously identify beneficial collaborative relationships\nin a decentralized manner; and ii) adapt to dynamically changing task\nobservations. In this paper, we propose DeLAMA, a decentralized multi-agent\nlifelong collaborative learning algorithm with dynamic collaboration graphs. To\npromote autonomous collaboration relationship learning, we propose a\ndecentralized graph structure learning algorithm, eliminating the need for\nexternal priors. To facilitate adaptation to dynamic tasks, we design a memory\nunit to capture the agents' accumulated learning history and knowledge, while\npreserving finite storage consumption. To further augment the system's\nexpressive capabilities and computational efficiency, we apply algorithm\nunrolling, leveraging the advantages of both mathematical optimization and\nneural networks. This allows the agents to `learn to collaborate' through the\nsupervision of training tasks. Our theoretical analysis verifies that\ninter-agent collaboration is communication efficient under a small number of\ncommunication rounds. The experimental results verify its ability to facilitate\nthe discovery of collaboration strategies and adaptation to dynamic learning\nscenarios, achieving a 98.80% reduction in MSE and a 188.87% improvement in\nclassification accuracy. We expect our work can serve as a foundational\ntechnique to facilitate future works towards an intelligent, decentralized, and\ndynamic multi-agent system. Code is available at\nhttps://github.com/ShuoTang123/DeLAMA.",
        "updated": "2024-03-11 09:21:11 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.06535v1"
    },
    {
        "title": "Scalable Distributed Optimization Despite Byzantine Adversaries",
        "authors": "Kananart KuwaranancharoenLei XinShreyas Sundaram",
        "links": "http://arxiv.org/abs/2403.06502v1",
        "entry_id": "http://arxiv.org/abs/2403.06502v1",
        "pdf_url": "http://arxiv.org/pdf/2403.06502v1",
        "summary": "The problem of distributed optimization requires a group of networked agents\nto compute a parameter that minimizes the average of their local cost\nfunctions. While there are a variety of distributed optimization algorithms\nthat can solve this problem, they are typically vulnerable to ``Byzantine''\nagents that do not follow the algorithm. Recent attempts to address this issue\nfocus on single dimensional functions, or assume certain statistical properties\nof the functions at the agents. In this paper, we provide two resilient,\nscalable, distributed optimization algorithms for multi-dimensional functions.\nOur schemes involve two filters, (1) a distance-based filter and (2) a min-max\nfilter, which each remove neighborhood states that are extreme (defined\nprecisely in our algorithms) at each iteration. We show that these algorithms\ncan mitigate the impact of up to $F$ (unknown) Byzantine agents in the\nneighborhood of each regular agent. In particular, we show that if the network\ntopology satisfies certain conditions, all of the regular agents' states are\nguaranteed to converge to a bounded region that contains the minimizer of the\naverage of the regular agents' functions.",
        "updated": "2024-03-11 08:23:37 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.06502v1"
    },
    {
        "title": "The Geometry of Cyclical Social Trends",
        "authors": "Bernard ChazelleKritkorn KarntikoonJakob Nogler",
        "links": "http://arxiv.org/abs/2403.06376v1",
        "entry_id": "http://arxiv.org/abs/2403.06376v1",
        "pdf_url": "http://arxiv.org/pdf/2403.06376v1",
        "summary": "We investigate the emergence of periodic behavior in opinion dynamics and its\nunderlying geometry. For this, we use a bounded-confidence model with\ncontrarian agents in a convolution social network. This means that agents adapt\ntheir opinions by interacting with their neighbors in a time-varying social\nnetwork. Being contrarian, the agents are kept from reaching consensus. This is\nthe key feature that allows the emergence of cyclical trends. We show that the\nsystems either converge to nonconsensual equilibrium or are attracted to\nperiodic or quasi-periodic orbits. We bound the dimension of the attractors and\nthe period of cyclical trends. We exhibit instances where each orbit is dense\nand uniformly distributed within its attractor. We also investigate the case of\nrandomly changing social networks.",
        "updated": "2024-03-11 02:00:15 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.06376v1"
    }
]