[
    {
        "title": "SwarmRL: Building the Future of Smart Active Systems",
        "authors": "Samuel ToveyChristoph LohrmannTobias MerktDavid ZimmerKonstantin NikolaouSimon KoppenhöferAnna BushmakinaJonas ScheunemannChristian Holm",
        "links": "http://arxiv.org/abs/2404.16388v1",
        "entry_id": "http://arxiv.org/abs/2404.16388v1",
        "pdf_url": "http://arxiv.org/pdf/2404.16388v1",
        "summary": "This work introduces SwarmRL, a Python package designed to study intelligent\nactive particles. SwarmRL provides an easy-to-use interface for developing\nmodels to control microscopic colloids using classical control and deep\nreinforcement learning approaches. These models may be deployed in simulations\nor real-world environments under a common framework. We explain the structure\nof the software and its key features and demonstrate how it can be used to\naccelerate research. With SwarmRL, we aim to streamline research into\nmicro-robotic control while bridging the gap between experimental and\nsimulation-driven sciences. SwarmRL is available open-source on GitHub at\nhttps://github.com/SwarmRL/SwarmRL.",
        "updated": "2024-04-25 07:57:11 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.16388v1"
    },
    {
        "title": "Optimal and Bounded Suboptimal Any-Angle Multi-agent Pathfinding",
        "authors": "Konstantin YakovlevAnton AndreychukRoni Stern",
        "links": "http://arxiv.org/abs/2404.16379v1",
        "entry_id": "http://arxiv.org/abs/2404.16379v1",
        "pdf_url": "http://arxiv.org/pdf/2404.16379v1",
        "summary": "Multi-agent pathfinding (MAPF) is the problem of finding a set of\nconflict-free paths for a set of agents. Typically, the agents' moves are\nlimited to a pre-defined graph of possible locations and allowed transitions\nbetween them, e.g. a 4-neighborhood grid. We explore how to solve MAPF problems\nwhen each agent can move between any pair of possible locations as long as\ntraversing the line segment connecting them does not lead to the collision with\nthe obstacles. This is known as any-angle pathfinding. We present the first\noptimal any-angle multi-agent pathfinding algorithm. Our planner is based on\nthe Continuous Conflict-based Search (CCBS) algorithm and an optimal any-angle\nvariant of the Safe Interval Path Planning (TO-AA-SIPP). The straightforward\ncombination of those, however, scales poorly since any-angle path finding\ninduces search trees with a very large branching factor. To mitigate this, we\nadapt two techniques from classical MAPF to the any-angle setting, namely\nDisjoint Splitting and Multi-Constraints. Experimental results on different\ncombinations of these techniques show they enable solving over 30% more\nproblems than the vanilla combination of CCBS and TO-AA-SIPP. In addition, we\npresent a bounded-suboptimal variant of our algorithm, that enables trading\nruntime for solution cost in a controlled manner.",
        "updated": "2024-04-25 07:41:47 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.16379v1"
    },
    {
        "title": "A Hypergraph Approach to Distributed Broadcast",
        "authors": "Qi CaoYulin ShaoFan Yang",
        "links": "http://arxiv.org/abs/2404.16376v1",
        "entry_id": "http://arxiv.org/abs/2404.16376v1",
        "pdf_url": "http://arxiv.org/pdf/2404.16376v1",
        "summary": "This paper explores the distributed broadcast problem within the context of\nnetwork communications, a critical challenge in decentralized information\ndissemination. We put forth a novel hypergraph-based approach to address this\nissue, focusing on minimizing the number of broadcasts to ensure comprehensive\ndata sharing among all network users. A key contribution of our work is the\nestablishment of a general lower bound for the problem using the min-cut\ncapacity of hypergraphs. Additionally, we present the distributed broadcast for\nquasi-trees (DBQT) algorithm tailored for the unique structure of quasi-trees,\nwhich is proven to be optimal. This paper advances both network communication\nstrategies and hypergraph theory, with implications for a wide range of\nreal-world applications, from vehicular and sensor networks to distributed\nstorage systems.",
        "updated": "2024-04-25 07:31:42 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.16376v1"
    },
    {
        "title": "3D Guidance Law for Maximal Coverage and Target Enclosing with Inherent Safety",
        "authors": "Praveen Kumar RanjanAbhinav SinhaYongcan Cao",
        "links": "http://arxiv.org/abs/2404.16312v1",
        "entry_id": "http://arxiv.org/abs/2404.16312v1",
        "pdf_url": "http://arxiv.org/pdf/2404.16312v1",
        "summary": "In this paper, we address the problem of enclosing an arbitrarily moving\ntarget in three dimensions by a single pursuer, which is an unmanned aerial\nvehicle (UAV), for maximum coverage while also ensuring the pursuer's safety by\npreventing collisions with the target. The proposed guidance strategy steers\nthe pursuer to a safe region of space surrounding the target, allowing it to\nmaintain a certain distance from the latter while offering greater flexibility\nin positioning and converging to any orbit within this safe zone. Our approach\nis distinguished by the use of nonholonomic constraints to model vehicles with\naccelerations serving as control inputs and coupled engagement kinematics to\ncraft the pursuer's guidance law meticulously. Furthermore, we leverage the\nconcept of the Lyapunov Barrier Function as a powerful tool to constrain the\ndistance between the pursuer and the target within asymmetric bounds, thereby\nensuring the pursuer's safety within the predefined region. To validate the\nefficacy and robustness of our algorithm, we conduct experimental tests by\nimplementing a high-fidelity quadrotor model within Software-in-the-loop (SITL)\nsimulations, encompassing various challenging target maneuver scenarios. The\nresults obtained showcase the resilience of the proposed guidance law,\neffectively handling arbitrarily maneuvering targets, vehicle/autopilot\ndynamics, and external disturbances. Our method consistently delivers stable\nglobal enclosing behaviors, even in response to aggressive target maneuvers,\nand requires only relative information for successful execution.",
        "updated": "2024-04-25 03:38:07 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.16312v1"
    },
    {
        "title": "A communication protocol based on NK boolean networks for coordinating collective action",
        "authors": "Yori Ong",
        "links": "http://arxiv.org/abs/2404.16240v1",
        "entry_id": "http://arxiv.org/abs/2404.16240v1",
        "pdf_url": "http://arxiv.org/pdf/2404.16240v1",
        "summary": "In this paper, I describe a digital social communication protocol (Gridt)\nbased on Kauffman's NK boolean networks. The main assertion is that a\ncommunication network with this topology supports infinitely scalable\nself-organization of collective action without requiring hierarchy or central\ncontrol. The paper presents the functionality of this protocol and\nsubstantiates the following propositions about its function and implications:\n(1) Communication via NK boolean networks facilitates coordination on\ncollective action games for any variable number of users, and justifies the\nassumption that the game's payoff structure is common knowledge; (2) Use of\nthis protocol increases its users' transfer empowerment, a form of intrinsic\nmotivation that motivates coordinated action independent of the task or\noutcome; (3) Communication via this network can be considered 'cheap talk' and\nbenefits the strategy of players with aligned interests, but not of players\nwith conflicting interests; (4) Absence of significant barriers for its\nrealization warrants a timely and continuing discussion on the ethics and\nimplications of this technology; (5) Full realization of the technology's\npotential calls for a free-to-use service with maximal transparency of design\nand associated economic incentives.",
        "updated": "2024-04-24 22:56:26 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.16240v1"
    }
]