[
    {
        "title": "Agent-based modeling for realistic reproduction of human mobility and contact behavior to evaluate test and isolation strategies in epidemic infectious disease spread",
        "authors": "David KerkmannSascha KorfKhoa NguyenDaniel AbeleAlain SchengenCarlotta GersteinJens Henrik GöbbertAchim BasermannMartin J. KühnMichael Meyer-Hermann",
        "links": "http://arxiv.org/abs/2410.08050v1",
        "entry_id": "http://arxiv.org/abs/2410.08050v1",
        "pdf_url": "http://arxiv.org/pdf/2410.08050v1",
        "summary": "Agent-based models have proven to be useful tools in supporting\ndecision-making processes in different application domains. The advent of\nmodern computers and supercomputers has enabled these bottom-up approaches to\nrealistically model human mobility and contact behavior. The COVID-19 pandemic\nshowcased the urgent need for detailed and informative models that can answer\nresearch questions on transmission dynamics. We present a sophisticated\nagent-based model to simulate the spread of respiratory diseases. The model is\nhighly modularized and can be used on various scales, from a small collection\nof buildings up to cities or countries. Although not being the focus of this\npaper, the model has undergone performance engineering on a single core and\nprovides an efficient intra- and inter-simulation parallelization for\ntime-critical decision-making processes.\n  In order to allow answering research questions on individual level\nresolution, nonpharmaceutical intervention strategies such as face masks or\nvenue closures can be implemented for particular locations or agents. In\nparticular, we allow for sophisticated testing and isolation strategies to\nstudy the effects of minimal-invasive infectious disease mitigation. With\nrealistic human mobility patterns for the region of Brunswick, Germany, we\nstudy the effects of different interventions between March 1st and May 30, 2021\nin the SARS-CoV-2 pandemic. Our analyses suggest that symptom-independent\ntesting has limited impact on the mitigation of disease dynamics if the dark\nfigure in symptomatic cases is high. Furthermore, we found that quarantine\nlength is more important than quarantine efficiency but that, with sufficient\nsymptomatic control, also short quarantines can have a substantial effect.",
        "updated": "2024-10-10 15:45:27 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.08050v1"
    },
    {
        "title": "Strategic Classification With Externalities",
        "authors": "Yiling ChenSafwan HossainEvi MichaAriel Procaccia",
        "links": "http://arxiv.org/abs/2410.08032v1",
        "entry_id": "http://arxiv.org/abs/2410.08032v1",
        "pdf_url": "http://arxiv.org/pdf/2410.08032v1",
        "summary": "We propose a new variant of the strategic classification problem: a principal\nreveals a classifier, and $n$ agents report their (possibly manipulated)\nfeatures to be classified. Motivated by real-world applications, our model\ncrucially allows the manipulation of one agent to affect another; that is, it\nexplicitly captures inter-agent externalities. The principal-agent interactions\nare formally modeled as a Stackelberg game, with the resulting agent\nmanipulation dynamics captured as a simultaneous game. We show that under\ncertain assumptions, the pure Nash Equilibrium of this agent manipulation game\nis unique and can be efficiently computed. Leveraging this result, PAC learning\nguarantees are established for the learner: informally, we show that it is\npossible to learn classifiers that minimize loss on the distribution, even when\na random number of agents are manipulating their way to a pure Nash\nEquilibrium. We also comment on the optimization of such classifiers through\ngradient-based approaches. This work sets the theoretical foundations for a\nmore realistic analysis of classifiers that are robust against multiple\nstrategic actors interacting in a common environment.",
        "updated": "2024-10-10 15:28:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.08032v1"
    },
    {
        "title": "Dynamic Programming based Local Search approaches for Multi-Agent Path Finding problems on Directed Graphs",
        "authors": "Irene SaccaniStefano ArdizzoniLuca ConsoliniMarco Locatelli",
        "links": "http://arxiv.org/abs/2410.07954v1",
        "entry_id": "http://arxiv.org/abs/2410.07954v1",
        "pdf_url": "http://arxiv.org/pdf/2410.07954v1",
        "summary": "Among sub-optimal Multi-Agent Path Finding (MAPF) solvers, rule-based\nalgorithms are particularly appealing since they are complete. Even in crowded\nscenarios, they allow finding a feasible solution that brings each agent to its\ntarget, preventing deadlock situations. However, generally, rule-based\nalgorithms provide much longer solutions than the shortest one. The main\ncontribution of this paper is introducing a new local search procedure for\nimproving a known feasible solution. We start from a feasible sub-optimal\nsolution, and perform a local search in a neighborhood of this solution. If we\nare able to find a shorter solution, we repeat this procedure until the\nsolution cannot be shortened anymore. At the end, we obtain a solution that is\nstill sub-optimal, but generally of much better quality than the initial one.\nWe propose two different local search policies. In the first, we explore all\npaths in which the agents positions remain in a neighborhood of the\ncorresponding positions of the reference solution. In the second, we set an\nupper limit to the number of agents that can change their path with respect to\nthe reference solution. These two different policies can also be alternated. We\nexplore the neighborhoods by dynamic programming. The fact that our search is\nlocal is fundamental in terms of time complexity. Indeed, if the dynamic\nprogramming approach is applied to the full MAPF problem, the number of\nexplored states grows exponentially with the number of agents. Instead, the\nintroduction of a locality constraint allows exploring the neghborhoods in a\ntime that grows polynomially with respect to the number of agents.",
        "updated": "2024-10-10 14:20:19 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.07954v1"
    },
    {
        "title": "Benchmarking Agentic Workflow Generation",
        "authors": "Shuofei QiaoRunnan FangZhisong QiuXiaobin WangNingyu ZhangYong JiangPengjun XieFei HuangHuajun Chen",
        "links": "http://arxiv.org/abs/2410.07869v1",
        "entry_id": "http://arxiv.org/abs/2410.07869v1",
        "pdf_url": "http://arxiv.org/pdf/2410.07869v1",
        "summary": "Large Language Models (LLMs), with their exceptional ability to handle a wide\nrange of tasks, have driven significant advancements in tackling reasoning and\nplanning tasks, wherein decomposing complex problems into executable workflows\nis a crucial step in this process. Existing workflow evaluation frameworks\neither focus solely on holistic performance or suffer from limitations such as\nrestricted scenario coverage, simplistic workflow structures, and lax\nevaluation standards. To this end, we introduce WorFBench, a unified workflow\ngeneration benchmark with multi-faceted scenarios and intricate graph workflow\nstructures. Additionally, we present WorFEval, a systemic evaluation protocol\nutilizing subsequence and subgraph matching algorithms to accurately quantify\nthe LLM agent's workflow generation capabilities. Through comprehensive\nevaluations across different types of LLMs, we discover distinct gaps between\nthe sequence planning capabilities and graph planning capabilities of LLM\nagents, with even GPT-4 exhibiting a gap of around 15%. We also train two\nopen-source models and evaluate their generalization abilities on held-out\ntasks. Furthermore, we observe that the generated workflows can enhance\ndownstream tasks, enabling them to achieve superior performance with less time\nduring inference. Code and dataset will be available at\nhttps://github.com/zjunlp/WorFBench.",
        "updated": "2024-10-10 12:41:19 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.07869v1"
    },
    {
        "title": "A Hate Speech Moderated Chat Application: Use Case for GDPR and DSA Compliance",
        "authors": "Jan FilliesTheodoros MitsikasRalph SchäfermeierAdrian Paschke",
        "links": "http://arxiv.org/abs/2410.07713v1",
        "entry_id": "http://arxiv.org/abs/2410.07713v1",
        "pdf_url": "http://arxiv.org/pdf/2410.07713v1",
        "summary": "The detection of hate speech or toxic content online is a complex and\nsensitive issue. While the identification itself is highly dependent on the\ncontext of the situation, sensitive personal attributes such as age, language,\nand nationality are rarely available due to privacy concerns. Additionally,\nplatforms struggle with a wide range of local jurisdictions regarding online\nhate speech and the evaluation of content based on their internal ethical\nnorms. This research presents a novel approach that demonstrates a\nGDPR-compliant application capable of implementing legal and ethical reasoning\ninto the content moderation process. The application increases the\nexplainability of moderation decisions by utilizing user information. Two use\ncases fundamental to online communication are presented and implemented using\ntechnologies such as GPT-3.5, Solid Pods, and the rule language Prova. The\nfirst use case demonstrates the scenario of a platform aiming to protect\nadolescents from potentially harmful content by limiting the ability to post\ncertain content when minors are present. The second use case aims to identify\nand counter problematic statements online by providing counter hate speech. The\ncounter hate speech is generated using personal attributes to appeal to the\nuser. This research lays the groundwork for future DSA compliance of online\nplatforms. The work proposes a novel approach to reason within different legal\nand ethical definitions of hate speech and plan the fitting counter hate\nspeech. Overall, the platform provides a fitted protection to users and a more\nexplainable and individualized response. The hate speech detection service, the\nchat platform, and the reasoning in Prova are discussed, and the potential\nbenefits for content moderation and algorithmic hate speech detection are\noutlined. A selection of important aspects for DSA compliance is outlined.",
        "updated": "2024-10-10 08:28:38 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.07713v1"
    }
]