[
    {
        "title": "From Interaction to Impact: Towards Safer AI Agents Through Understanding and Evaluating UI Operation Impacts",
        "authors": "Zhuohao Jerry ZhangEldon SchoopJeffrey NicholsAnuj MahajanAmanda Swearngin",
        "links": "http://arxiv.org/abs/2410.09006v1",
        "entry_id": "http://arxiv.org/abs/2410.09006v1",
        "pdf_url": "http://arxiv.org/pdf/2410.09006v1",
        "summary": "With advances in generative AI, there is increasing work towards creating\nautonomous agents that can manage daily tasks by operating user interfaces\n(UIs). While prior research has studied the mechanics of how AI agents might\nnavigate UIs and understand UI structure, the effects of agents and their\nautonomous actions-particularly those that may be risky or irreversible-remain\nunder-explored. In this work, we investigate the real-world impacts and\nconsequences of UI actions by AI agents. We began by developing a taxonomy of\nthe impacts of UI actions through a series of workshops with domain experts.\nFollowing this, we conducted a data synthesis study to gather realistic UI\nscreen traces and action data that users perceive as impactful. We then used\nour impact categories to annotate our collected data and data repurposed from\nexisting UI navigation datasets. Our quantitative evaluations of different\nlarge language models (LLMs) and variants demonstrate how well different LLMs\ncan understand the impacts of UI actions that might be taken by an agent. We\nshow that our taxonomy enhances the reasoning capabilities of these LLMs for\nunderstanding the impacts of UI actions, but our findings also reveal\nsignificant gaps in their ability to reliably classify more nuanced or complex\ncategories of impact.",
        "updated": "2024-10-11 17:24:00 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.09006v1"
    },
    {
        "title": "UniGlyph: A Seven-Segment Script for Universal Language Representation",
        "authors": "G. V. Bency SherinA. Abijesh EuphrineA. Lenora MoreenL. Arun Jose",
        "links": "http://arxiv.org/abs/2410.08974v1",
        "entry_id": "http://arxiv.org/abs/2410.08974v1",
        "pdf_url": "http://arxiv.org/pdf/2410.08974v1",
        "summary": "UniGlyph is a constructed language (conlang) designed to create a universal\ntransliteration system using a script derived from seven-segment characters.\nThe goal of UniGlyph is to facilitate cross-language communication by offering\na flexible and consistent script that can represent a wide range of phonetic\nsounds. This paper explores the design of UniGlyph, detailing its script\nstructure, phonetic mapping, and transliteration rules. The system addresses\nimperfections in the International Phonetic Alphabet (IPA) and traditional\ncharacter sets by providing a compact, versatile method to represent phonetic\ndiversity across languages. With pitch and length markers, UniGlyph ensures\naccurate phonetic representation while maintaining a small character set.\nApplications of UniGlyph include artificial intelligence integrations, such as\nnatural language processing and multilingual speech recognition, enhancing\ncommunication across different languages. Future expansions are discussed,\nincluding the addition of animal phonetic sounds, where unique scripts are\nassigned to different species, broadening the scope of UniGlyph beyond human\ncommunication. This study presents the challenges and solutions in developing\nsuch a universal script, demonstrating the potential of UniGlyph to bridge\nlinguistic gaps in cross-language communication, educational phonetics, and\nAI-driven applications.",
        "updated": "2024-10-11 16:46:09 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.08974v1"
    },
    {
        "title": "Zero-Shot Pupil Segmentation with SAM 2: A Case Study of Over 14 Million Images",
        "authors": "Virmarie MaquilingSean Anthony ByrneDiederick C. NiehorsterMarco CarminatiEnkelejda Kasneci",
        "links": "http://arxiv.org/abs/2410.08926v1",
        "entry_id": "http://arxiv.org/abs/2410.08926v1",
        "pdf_url": "http://arxiv.org/pdf/2410.08926v1",
        "summary": "We explore the transformative potential of SAM 2, a vision foundation model,\nin advancing gaze estimation and eye tracking technologies. By significantly\nreducing annotation time, lowering technical barriers through its ease of\ndeployment, and enhancing segmentation accuracy, SAM 2 addresses critical\nchallenges faced by researchers and practitioners. Utilizing its zero-shot\nsegmentation capabilities with minimal user input-a single click per video-we\ntested SAM 2 on over 14 million eye images from diverse datasets, including\nvirtual reality setups and the world's largest unified dataset recorded using\nwearable eye trackers. Remarkably, in pupil segmentation tasks, SAM 2 matches\nthe performance of domain-specific models trained solely on eye images,\nachieving competitive mean Intersection over Union (mIoU) scores of up to 93%\nwithout fine-tuning. Additionally, we provide our code and segmentation masks\nfor these widely used datasets to promote further research.",
        "updated": "2024-10-11 15:50:53 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.08926v1"
    },
    {
        "title": "Exploring the Design Space of Cognitive Engagement Techniques with AI-Generated Code for Enhanced Learning",
        "authors": "Majeed KazemitabaarOliver HuangSangho SuhAustin Z. HenleyTovi Grossman",
        "links": "http://arxiv.org/abs/2410.08922v1",
        "entry_id": "http://arxiv.org/abs/2410.08922v1",
        "pdf_url": "http://arxiv.org/pdf/2410.08922v1",
        "summary": "Novice programmers are increasingly relying on Large Language Models (LLMs)\nto generate code for learning programming concepts. However, this interaction\ncan lead to superficial engagement, giving learners an illusion of learning and\nhindering skill development. To address this issue, we conducted a systematic\ndesign exploration to develop seven cognitive engagement techniques aimed at\npromoting deeper engagement with AI-generated code. In this paper, we describe\nour design process, the initial seven techniques and results from a\nbetween-subjects study (N=82). We then iteratively refined the top techniques\nand further evaluated them through a within-subjects study (N=42). We evaluate\nthe friction each technique introduces, their effectiveness in helping learners\napply concepts to isomorphic tasks without AI assistance, and their success in\naligning learners' perceived and actual coding abilities. Ultimately, our\nresults highlight the most effective technique: guiding learners through the\nstep-by-step problem-solving process, where they engage in an interactive\ndialog with the AI, prompting what needs to be done at each stage before the\ncorresponding code is revealed.",
        "updated": "2024-10-11 15:49:42 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.08922v1"
    },
    {
        "title": "Utilizing ChatGPT in a Data Structures and Algorithms Course: A Teaching Assistant's Perspective",
        "authors": "Pooriya JamieReyhaneh HajihashemiSharareh Alipour",
        "links": "http://arxiv.org/abs/2410.08899v1",
        "entry_id": "http://arxiv.org/abs/2410.08899v1",
        "pdf_url": "http://arxiv.org/pdf/2410.08899v1",
        "summary": "Integrating large language models (LLMs) like ChatGPT is revolutionizing the\nfield of computer science education. These models offer new possibilities for\nenriching student learning and supporting teaching assistants (TAs) in\nproviding prompt feedback and supplementary learning resources. This research\ndelves into the use of ChatGPT in a data structures and algorithms (DSA)\ncourse, particularly when combined with TA supervision. The findings\ndemonstrate that incorporating ChatGPT with structured prompts and active TA\nguidance enhances students' understanding of intricate algorithmic concepts,\nboosts engagement, and elevates academic performance. However, challenges exist\nin addressing academic integrity and the limitations of LLMs in tackling\ncomplex problems. The study underscores the importance of active TA involvement\nin reducing students' reliance on AI-generated content and amplifying the\noverall educational impact. The results suggest that while LLMs can be\nadvantageous for education, their successful integration demands continuous\noversight and a thoughtful balance between AI and human guidance.",
        "updated": "2024-10-11 15:18:48 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.08899v1"
    }
]