[
    {
        "title": "Goal Recognition via Linear Programming",
        "authors": "Felipe MeneguzziLuísa R. de A. SantosRamon Fraga PereiraAndré G. Pereira",
        "links": "http://arxiv.org/abs/2404.07934v1",
        "entry_id": "http://arxiv.org/abs/2404.07934v1",
        "pdf_url": "http://arxiv.org/pdf/2404.07934v1",
        "summary": "Goal Recognition is the task by which an observer aims to discern the goals\nthat correspond to plans that comply with the perceived behavior of subject\nagents given as a sequence of observations. Research on Goal Recognition as\nPlanning encompasses reasoning about the model of a planning task, the\nobservations, and the goals using planning techniques, resulting in very\nefficient recognition approaches. In this article, we design novel recognition\napproaches that rely on the Operator-Counting framework, proposing new\nconstraints, and analyze their constraints' properties both theoretically and\nempirically. The Operator-Counting framework is a technique that efficiently\ncomputes heuristic estimates of cost-to-goal using Integer/Linear Programming\n(IP/LP). In the realm of theory, we prove that the new constraints provide\nlower bounds on the cost of plans that comply with observations. We also\nprovide an extensive empirical evaluation to assess how the new constraints\nimprove the quality of the solution, and we found that they are especially\ninformed in deciding which goals are unlikely to be part of the solution. Our\nnovel recognition approaches have two pivotal advantages: first, they employ\nnew IP/LP constraints for efficiently recognizing goals; second, we show how\nthe new IP/LP constraints can improve the recognition of goals under both\npartial and noisy observability.",
        "updated": "2024-04-11 17:34:35 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.07934v1"
    },
    {
        "title": "Leveraging Large Language Models (LLMs) to Support Collaborative Human-AI Online Risk Data Annotation",
        "authors": "Jinkyung ParkPamela WisniewskiVivek Singh",
        "links": "http://arxiv.org/abs/2404.07926v1",
        "entry_id": "http://arxiv.org/abs/2404.07926v1",
        "pdf_url": "http://arxiv.org/pdf/2404.07926v1",
        "summary": "In this position paper, we discuss the potential for leveraging LLMs as\ninteractive research tools to facilitate collaboration between human coders and\nAI to effectively annotate online risk data at scale. Collaborative human-AI\nlabeling is a promising approach to annotating large-scale and complex data for\nvarious tasks. Yet, tools and methods to support effective human-AI\ncollaboration for data annotation are under-studied. This gap is pertinent\nbecause co-labeling tasks need to support a two-way interactive discussion that\ncan add nuance and context, particularly in the context of online risk, which\nis highly subjective and contextualized. Therefore, we provide some of the\nearly benefits and challenges of using LLMs-based tools for risk annotation and\nsuggest future directions for the HCI research community to leverage LLMs as\nresearch tools to facilitate human-AI collaboration in contextualized online\ndata annotation. Our research interests align very well with the purposes of\nthe LLMs as Research Tools workshop to identify ongoing applications and\nchallenges of using LLMs to work with data in HCI research. We anticipate\nlearning valuable insights from organizers and participants into how LLMs can\nhelp reshape the HCI community's methods for working with data.",
        "updated": "2024-04-11 17:20:57 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.07926v1"
    },
    {
        "title": "Snake Story: Exploring Game Mechanics for Mixed-Initiative Co-creative Storytelling Games",
        "authors": "Daijin YangErica KleinmanGiovanni Maria TroianoElina TochilnikovaCasper Harteveld",
        "links": "http://dx.doi.org/10.1145/3649921.3649996",
        "entry_id": "http://arxiv.org/abs/2404.07901v1",
        "pdf_url": "http://arxiv.org/pdf/2404.07901v1",
        "summary": "Mixed-initiative co-creative storytelling games have existed for some time as\na way to merge storytelling with play. However, modern mixed-initiative\nco-creative storytelling games predominantly prioritize story creation over\ngameplay mechanics, which might not resonate with all players. As such, there\nis untapped potential for creating mixed-initiative games with more complex\nmechanics in which players can engage with both co-creation and gameplay goals.\nTo explore the potential of more prominent gameplay in mixed-initiative\nco-creative storytelling games, we created Snake Story, a variation of the\nclassic Snake game featuring a human-AI co-writing element. To explore how\nplayers interact with the mixed-initiative game, we conducted a qualitative\nplaytest with 11 participants. Analysis of both think-aloud and interview data\nrevealed that players' strategies and experiences were affected by their\nperception of Snake Story as either a collaborative tool, a traditional game,\nor a combination of both. Based on these findings, we present design\nconsiderations for future development in mixed-initiative co-creative gaming.",
        "updated": "2024-04-11 16:40:24 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.07901v1"
    },
    {
        "title": "Apprentice Tutor Builder: A Platform For Users to Create and Personalize Intelligent Tutors",
        "authors": "Glen SmithAdit GuptaChristopher MacLellan",
        "links": "http://arxiv.org/abs/2404.07883v1",
        "entry_id": "http://arxiv.org/abs/2404.07883v1",
        "pdf_url": "http://arxiv.org/pdf/2404.07883v1",
        "summary": "Intelligent tutoring systems (ITS) are effective for improving students'\nlearning outcomes. However, their development is often complex, time-consuming,\nand requires specialized programming and tutor design knowledge, thus hindering\ntheir widespread application and personalization. We present the Apprentice\nTutor Builder (ATB) , a platform that simplifies tutor creation and\npersonalization. Instructors can utilize ATB's drag-and-drop tool to build\ntutor interfaces. Instructors can then interactively train the tutors'\nunderlying AI agent to produce expert models that can solve problems. Training\nis achieved via using multiple interaction modalities including demonstrations,\nfeedback, and user labels. We conducted a user study with 14 instructors to\nevaluate the effectiveness of ATB's design with end users. We found that users\nenjoyed the flexibility of the interface builder and ease and speed of agent\nteaching, but often desired additional time-saving features. With these\ninsights, we identified a set of design recommendations for our platform and\nothers that utilize interactive AI agents for tutor creation and customization.",
        "updated": "2024-04-11 16:14:23 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.07883v1"
    },
    {
        "title": "The Dance of Logic and Unpredictability: Examining the Predictability of User Behavior on Visual Analytics Tasks",
        "authors": "Alvitta Ottley",
        "links": "http://dx.doi.org/10.5220/0012671100003660",
        "entry_id": "http://arxiv.org/abs/2404.07865v1",
        "pdf_url": "http://arxiv.org/pdf/2404.07865v1",
        "summary": "The quest to develop intelligent visual analytics (VA) systems capable of\ncollaborating and naturally interacting with humans presents a multifaceted and\nintriguing challenge. VA systems designed for collaboration must adeptly\nnavigate a complex landscape filled with the subtleties and unpredictabilities\nthat characterize human behavior. However, it is noteworthy that scenarios\nexist where human behavior manifests predictably. These scenarios typically\ninvolve routine actions or present a limited range of choices. This paper\ndelves into the predictability of user behavior in the context of visual\nanalytics tasks. It offers an evidence-based discussion on the circumstances\nunder which predicting user behavior is feasible and those where it proves\nchallenging. We conclude with a forward-looking discussion of the future work\nnecessary to cultivate more synergistic and efficient partnerships between\nhumans and the VA system. This exploration is not just about understanding our\ncurrent capabilities and limitations in mirroring human behavior but also about\nenvisioning and paving the way for a future where human-machine interaction is\nmore intuitive and productive.",
        "updated": "2024-04-11 15:57:18 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.07865v1"
    }
]