[
    {
        "title": "Athena: Safe Autonomous Agents with Verbal Contrastive Learning",
        "authors": "Tanmana SadhuAli PesaranghaderYanan ChenDong Hoon Yi",
        "links": "http://arxiv.org/abs/2408.11021v1",
        "entry_id": "http://arxiv.org/abs/2408.11021v1",
        "pdf_url": "http://arxiv.org/pdf/2408.11021v1",
        "summary": "Due to emergent capabilities, large language models (LLMs) have been utilized\nas language-based agents to perform a variety of tasks and make decisions with\nan increasing degree of autonomy. These autonomous agents can understand\nhigh-level instructions, interact with their environments, and execute complex\ntasks using a selection of tools available to them. As the capabilities of the\nagents expand, ensuring their safety and trustworthiness becomes more\nimperative. In this study, we introduce the Athena framework which leverages\nthe concept of verbal contrastive learning where past safe and unsafe\ntrajectories are used as in-context (contrastive) examples to guide the agent\ntowards safety while fulfilling a given task. The framework also incorporates a\ncritiquing mechanism to guide the agent to prevent risky actions at every step.\nFurthermore, due to the lack of existing benchmarks on the safety reasoning\nability of LLM-based agents, we curate a set of 80 toolkits across 8 categories\nwith 180 scenarios to provide a safety evaluation benchmark. Our experimental\nevaluation, with both closed- and open-source LLMs, indicates verbal\ncontrastive learning and interaction-level critiquing improve the safety rate\nsignificantly.",
        "updated": "2024-08-20 17:21:10 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.11021v1"
    },
    {
        "title": "DBHP: Trajectory Imputation in Multi-Agent Sports Using Derivative-Based Hybrid Prediction",
        "authors": "Hanjun ChoiHyunsung KimMinho LeeChang-Jo KimJinsung YoonSang-Ki Ko",
        "links": "http://arxiv.org/abs/2408.10878v1",
        "entry_id": "http://arxiv.org/abs/2408.10878v1",
        "pdf_url": "http://arxiv.org/pdf/2408.10878v1",
        "summary": "Many spatiotemporal domains handle multi-agent trajectory data, but in\nreal-world scenarios, collected trajectory data are often partially missing due\nto various reasons. While existing approaches demonstrate good performance in\ntrajectory imputation, they face challenges in capturing the complex dynamics\nand interactions between agents due to a lack of physical constraints that\ngovern realistic trajectories, leading to suboptimal results. To address this\nissue, the paper proposes a Derivative-Based Hybrid Prediction (DBHP) framework\nthat can effectively impute multiple agents' missing trajectories. First, a\nneural network equipped with Set Transformers produces a naive prediction of\nmissing trajectories while satisfying the permutation-equivariance in terms of\nthe order of input agents. Then, the framework makes alternative predictions\nleveraging velocity and acceleration information and combines all the\npredictions with properly determined weights to provide final imputed\ntrajectories. In this way, our proposed framework not only accurately predicts\nposition, velocity, and acceleration values but also enforces the physical\nrelationship between them, eventually improving both the accuracy and\nnaturalness of the predicted trajectories. Accordingly, the experiment results\nabout imputing player trajectories in team sports show that our framework\nsignificantly outperforms existing imputation baselines.",
        "updated": "2024-08-20 14:08:16 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.10878v1"
    },
    {
        "title": "Multi-Agent Based Simulation for Decentralized Electric Vehicle Charging Strategies and their Impacts",
        "authors": "Kristoffer ChristensenBo Nørregaard JørgensenZheng Grace Ma",
        "links": "http://arxiv.org/abs/2408.10790v1",
        "entry_id": "http://arxiv.org/abs/2408.10790v1",
        "pdf_url": "http://arxiv.org/pdf/2408.10790v1",
        "summary": "The growing shift towards a Smart Grid involves integrating numerous new\ndigital energy solutions into the energy ecosystems to address problems arising\nfrom the transition to carbon neutrality, particularly in linking the\nelectricity and transportation sectors. Yet, this shift brings challenges due\nto mass electric vehicle adoption and the lack of methods to adequately assess\nvarious EV charging algorithms and their ecosystem impacts. This paper\nintroduces a multi-agent based simulation model, validated through a case study\nof a Danish radial distribution network serving 126 households. The study\nreveals that traditional charging leads to grid overload by 2031 at 67% EV\npenetration, while decentralized strategies like Real-Time Pricing could cause\noverloads as early as 2028. The developed multi-agent based simulation\ndemonstrates its ability to offer detailed, hourly analysis of future load\nprofiles in distribution grids, and therefore, can be applied to other\nprospective scenarios in similar energy systems.",
        "updated": "2024-08-20 12:31:43 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.10790v1"
    },
    {
        "title": "Multi-agent based modeling for investigating excess heat utilization from electrolyzer production to district heating network",
        "authors": "Kristoffer ChristensenBo Nørregaard JørgensenZheng Grace Ma",
        "links": "http://arxiv.org/abs/2408.10783v1",
        "entry_id": "http://arxiv.org/abs/2408.10783v1",
        "pdf_url": "http://arxiv.org/pdf/2408.10783v1",
        "summary": "Power-to-Hydrogen is crucial for the renewable energy transition, yet\nexisting literature lacks business models for the significant excess heat it\ngenerates. This study addresses this by evaluating three models for selling\nelectrolyzer-generated heat to district heating grids: constant, flexible, and\nrenewable-source hydrogen production, with and without heat sales. Using\nagent-based modeling and multi-criteria decision-making methods (VIKOR, TOPSIS,\nPROMETHEE), it finds that selling excess heat can cut hydrogen production costs\nby 5.6%. The optimal model operates flexibly with electricity spot prices,\nincludes heat sales, and maintains a hydrogen price of 3.3 EUR/kg.\nEnvironmentally, hydrogen production from grid electricity could emit up to\n13,783.8 tons of CO2 over four years from 2023. The best economic and\nenvironmental model uses renewable sources and sells heat at 3.5 EUR/kg",
        "updated": "2024-08-20 12:21:21 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.10783v1"
    },
    {
        "title": "Multi-Agent Based Simulation for Investigating Centralized Charging Strategies and their Impact on Electric Vehicle Home Charging Ecosystem",
        "authors": "Kristoffer ChristensenBo Nørregaard JørgensenZheng Grace Ma",
        "links": "http://arxiv.org/abs/2408.10773v1",
        "entry_id": "http://arxiv.org/abs/2408.10773v1",
        "pdf_url": "http://arxiv.org/pdf/2408.10773v1",
        "summary": "This paper addresses the critical integration of electric vehicles (EVs) into\nthe electricity grid, which is essential for achieving carbon neutrality by\n2050. The rapid increase in EV adoption poses significant challenges to the\nexisting grid infrastructure, particularly in managing the increasing\nelectricity demand and mitigating the risk of grid overloads. Centralized EV\ncharging strategies are investigated due to their potential to optimize grid\nstability and efficiency, compared to decentralized approaches that may\nexacerbate grid stress. Utilizing a multi-agent based simulation model, the\nstudy provides a realistic representation of the electric vehicle home charging\necosystem in a case study of Strib, Denmark. The findings show that the\nEarliest-deadline-first and Round Robin perform best with 100% EV adoption in\nterms of EV user satisfaction. The simulation considers a realistic adoption\ncurve, EV charging strategies, EV models, and driving patterns to capture the\nfull ecosystem dynamics over a long-term period with high resolution (hourly).\nAdditionally, the study offers detailed load profiles for future distribution\ngrids, demonstrating how centralized charging strategies can efficiently manage\ngrid loads and prevent overloads.",
        "updated": "2024-08-20 12:12:35 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.10773v1"
    }
]