[
    {
        "title": "OptiMUS: Scalable Optimization Modeling with (MI)LP Solvers and Large Language Models",
        "authors": "Ali AhmadiTeshniziWenzhi GaoMadeleine Udell",
        "links": "http://arxiv.org/abs/2402.10172v1",
        "entry_id": "http://arxiv.org/abs/2402.10172v1",
        "pdf_url": "http://arxiv.org/pdf/2402.10172v1",
        "summary": "Optimization problems are pervasive in sectors from manufacturing and\ndistribution to healthcare. However, most such problems are still solved\nheuristically by hand rather than optimally by state-of-the-art solvers because\nthe expertise required to formulate and solve these problems limits the\nwidespread adoption of optimization tools and techniques. This paper introduces\nOptiMUS, a Large Language Model (LLM)-based agent designed to formulate and\nsolve (mixed integer) linear programming problems from their natural language\ndescriptions. OptiMUS can develop mathematical models, write and debug solver\ncode, evaluate the generated solutions, and improve its model and code based on\nthese evaluations. OptiMUS utilizes a modular structure to process problems,\nallowing it to handle problems with long descriptions and complex data without\nlong prompts. Experiments demonstrate that OptiMUS outperforms existing\nstate-of-the-art methods on easy datasets by more than $20\\%$ and on hard\ndatasets (including a new dataset, NLP4LP, released with this paper that\nfeatures long and complex problems) by more than $30\\%$.",
        "updated": "2024-02-15 18:19:18 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.10172v1"
    },
    {
        "title": "Identifying and modelling cognitive biases in mobility choices",
        "authors": "Chloe ConradCarole Adam",
        "links": "http://arxiv.org/abs/2402.09921v1",
        "entry_id": "http://arxiv.org/abs/2402.09921v1",
        "pdf_url": "http://arxiv.org/pdf/2402.09921v1",
        "summary": "This report presents results from an M1 internship dedicated to agent-based\nmodelling and simulation of daily mobility choices. This simulation is intended\nto be realistic enough to serve as a basis for a serious game about the\nmobility transition. In order to ensure this level of realism, we conducted a\nsurvey to measure if real mobility choices are made rationally, or how biased\nthey are. Results analysed here show that various biases could play a role in\ndecisions. We then propose an implementation in a GAMA agent-based simulation.",
        "updated": "2024-02-15 12:58:27 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.09921v1"
    },
    {
        "title": "Strategic Vote Timing in Online Elections With Public Tallies",
        "authors": "Aviv YaishSvetlana AbramovaRainer Böhme",
        "links": "http://arxiv.org/abs/2402.09776v1",
        "entry_id": "http://arxiv.org/abs/2402.09776v1",
        "pdf_url": "http://arxiv.org/pdf/2402.09776v1",
        "summary": "We study the effect of public tallies on online elections, in a setting where\nvoting is costly and voters are allowed to strategically time their votes. The\nstrategic importance of choosing \\emph{when} to vote arises when votes are\npublic, such as in online event scheduling polls (e.\\,g., Doodle), or in\nblockchain governance mechanisms. In particular, there is a tension between\nvoting early to influence future votes and waiting to observe interim results\nand avoid voting costs if the outcome has already been decided.\n  Our study draws on empirical findings showing that ``temporal'' bandwagon\neffects occur when interim results are revealed to the electorate: late voters\nare more likely to vote for leading candidates. To capture this phenomenon, we\nanalyze a novel model where the electorate consists of informed voters who have\na preferred candidate, and uninformed swing voters who can be swayed according\nto the interim outcome at the time of voting. In our main results, we prove the\nexistence of equilibria where both early and late voting occur with a positive\nprobability, and we characterize conditions that lead to the appearance of\n``last minute'' voting behavior, where all informed voters vote late.",
        "updated": "2024-02-15 08:06:21 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.09776v1"
    },
    {
        "title": "An Accelerated Distributed Stochastic Gradient Method with Momentum",
        "authors": "Kun HuangShi PuAngelia Nedić",
        "links": "http://arxiv.org/abs/2402.09714v1",
        "entry_id": "http://arxiv.org/abs/2402.09714v1",
        "pdf_url": "http://arxiv.org/pdf/2402.09714v1",
        "summary": "In this paper, we introduce an accelerated distributed stochastic gradient\nmethod with momentum for solving the distributed optimization problem, where a\ngroup of $n$ agents collaboratively minimize the average of the local objective\nfunctions over a connected network. The method, termed ``Distributed Stochastic\nMomentum Tracking (DSMT)'', is a single-loop algorithm that utilizes the\nmomentum tracking technique as well as the Loopless Chebyshev Acceleration\n(LCA) method. We show that DSMT can asymptotically achieve comparable\nconvergence rates as centralized stochastic gradient descent (SGD) method under\na general variance condition regarding the stochastic gradients. Moreover, the\nnumber of iterations (transient times) required for DSMT to achieve such rates\nbehaves as $\\mathcal{O}(n^{5/3}/(1-\\lambda))$ for minimizing general smooth\nobjective functions, and $\\mathcal{O}(\\sqrt{n/(1-\\lambda)})$ under the\nPolyak-{\\L}ojasiewicz (PL) condition. Here, the term $1-\\lambda$ denotes the\nspectral gap of the mixing matrix related to the underlying network topology.\nNotably, the obtained results do not rely on multiple inter-node communications\nor stochastic gradient accumulation per iteration, and the transient times are\nthe shortest under the setting to the best of our knowledge.",
        "updated": "2024-02-15 05:15:22 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.09714v1"
    },
    {
        "title": "ABIDES-Economist: Agent-Based Simulation of Economic Systems with Learning Agents",
        "authors": "Kshama DwarakanathSvitlana VyetrenkoPeyman TavallaliTucker Balch",
        "links": "http://arxiv.org/abs/2402.09563v1",
        "entry_id": "http://arxiv.org/abs/2402.09563v1",
        "pdf_url": "http://arxiv.org/pdf/2402.09563v1",
        "summary": "We introduce a multi-agent simulator for economic systems comprised of\nheterogeneous Households, heterogeneous Firms, Central Bank and Government\nagents, that could be subjected to exogenous, stochastic shocks. The\ninteraction between agents defines the production and consumption of goods in\nthe economy alongside the flow of money. Each agent can be designed to act\naccording to fixed, rule-based strategies or learn their strategies using\ninteractions with others in the simulator. We ground our simulator by choosing\nagent heterogeneity parameters based on economic literature, while designing\ntheir action spaces in accordance with real data in the United States. Our\nsimulator facilitates the use of reinforcement learning strategies for the\nagents via an OpenAI Gym style environment definition for the economic system.\nWe demonstrate the utility of our simulator by simulating and analyzing two\nhypothetical (yet interesting) economic scenarios. The first scenario\ninvestigates the impact of heterogeneous household skills on their learned\npreferences to work at different firms. The second scenario examines the impact\nof a positive production shock to one of two firms on its pricing strategy in\ncomparison to the second firm. We aspire that our platform sets a stage for\nsubsequent research at the intersection of artificial intelligence and\neconomics.",
        "updated": "2024-02-14 20:26:52 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.09563v1"
    }
]