[
    {
        "title": "Rapid AIdeation: Generating Ideas With the Self and in Collaboration With Large Language Models",
        "authors": "Gionnieve LimSimon T. Perrault",
        "links": "http://arxiv.org/abs/2403.12928v1",
        "entry_id": "http://arxiv.org/abs/2403.12928v1",
        "pdf_url": "http://arxiv.org/pdf/2403.12928v1",
        "summary": "Generative artificial intelligence (GenAI) can rapidly produce large and\ndiverse volumes of content. This lends to it a quality of creativity which can\nbe empowering in the early stages of design. In seeking to understand how\ncreative ways to address practical issues can be conceived between humans and\nGenAI, we conducted a rapid ideation workshop with 21 participants where they\nused a large language model (LLM) to brainstorm potential solutions and\nevaluate them. We found that the LLM produced a greater variety of ideas that\nwere of high quality, though not necessarily of higher quality than\nhuman-generated ideas. Participants typically prompted in a straightforward\nmanner with concise instructions. We also observed two collaborative dynamics\nwith the LLM fulfilling a consulting role or an assisting role depending on the\ngoals of the users. Notably, we observed an atypical anti-collaboration dynamic\nwhere participants used an antagonistic approach to prompt the LLM.",
        "updated": "2024-03-19 17:32:01 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.12928v1"
    },
    {
        "title": "Effects of Automated Misinformation Warning Labels on the Intents to Like, Comment and Share Posts",
        "authors": "Gionnieve LimSimon T. Perrault",
        "links": "http://dx.doi.org/10.1145/3623809.3623856",
        "entry_id": "http://arxiv.org/abs/2403.12916v1",
        "pdf_url": "http://arxiv.org/pdf/2403.12916v1",
        "summary": "With fact-checking by professionals being difficult to scale on social media,\nalgorithmic techniques have been considered. However, it is uncertain how the\npublic may react to labels by automated fact-checkers. In this study, we\ninvestigate the use of automated warning labels derived from misinformation\ndetection literature and investigate their effects on three forms of post\nengagement. Focusing on political posts, we also consider how partisanship\naffects engagement. In a two-phases within-subjects experiment with 200\nparticipants, we found that the generic warnings suppressed intents to comment\non and share posts, but not on the intent to like them. Furthermore, when\ndifferent reasons for the labels were provided, their effects on post\nengagement were inconsistent, suggesting that the reasons could have\nundesirably motivated engagement instead. Partisanship effects were observed\nacross the labels with higher engagement for politically congruent posts. We\ndiscuss the implications on the design and use of automated warning labels.",
        "updated": "2024-03-19 17:16:34 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.12916v1"
    },
    {
        "title": "Fact Checking Chatbot: A Misinformation Intervention for Instant Messaging Apps and an Analysis of Trust in the Fact Checkers",
        "authors": "Gionnieve LimSimon T. Perrault",
        "links": "http://dx.doi.org/10.1007/978-94-024-2225-2_11",
        "entry_id": "http://arxiv.org/abs/2403.12913v1",
        "pdf_url": "http://arxiv.org/pdf/2403.12913v1",
        "summary": "In Singapore, there has been a rise in misinformation on mobile instant\nmessaging services (MIMS). MIMS support both small peer-to-peer networks and\nlarge groups. Misinformation in the former may spread due to recipients' trust\nin the sender while in the latter, misinformation can directly reach a wide\naudience. The encryption of MIMS makes it difficult to address misinformation\ndirectly. As such, chatbots have become an alternative solution where users can\ndisclose their chat content directly to fact checking services. To understand\nhow effective fact checking chatbots are as an intervention and how trust in\nthree different fact checkers (i.e., Government, News Outlets, and Artificial\nIntelligence) may affect this trust, we conducted a within-subjects experiment\nwith 527 Singapore residents. We found mixed results for the fact checkers but\nsupport for the chatbot intervention overall. We also found a striking\ncontradiction between participants' trust in the fact checkers and their\nbehaviour towards them. Specifically, those who reported a high level of trust\nin the government performed worse and tended to follow the fact checking tool\nless when it was endorsed by the government.",
        "updated": "2024-03-19 17:11:25 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.12913v1"
    },
    {
        "title": "LAVA: Long-horizon Visual Action based Food Acquisition",
        "authors": "Amisha BhaskarRui LiuVishnu D. SharmaGuangyao ShiPratap Tokekar",
        "links": "http://arxiv.org/abs/2403.12876v1",
        "entry_id": "http://arxiv.org/abs/2403.12876v1",
        "pdf_url": "http://arxiv.org/pdf/2403.12876v1",
        "summary": "Robotic Assisted Feeding (RAF) addresses the fundamental need for individuals\nwith mobility impairments to regain autonomy in feeding themselves. The goal of\nRAF is to use a robot arm to acquire and transfer food to individuals from the\ntable. Existing RAF methods primarily focus on solid foods, leaving a gap in\nmanipulation strategies for semi-solid and deformable foods. This study\nintroduces Long-horizon Visual Action (LAVA) based food acquisition of liquid,\nsemisolid, and deformable foods. Long-horizon refers to the goal of \"clearing\nthe bowl\" by sequentially acquiring the food from the bowl. LAVA employs a\nhierarchical policy for long-horizon food acquisition tasks. The framework uses\nhigh-level policy to determine primitives by leveraging ScoopNet. At the\nmid-level, LAVA finds parameters for primitives using vision. To carry out\nsequential plans in the real world, LAVA delegates action execution which is\ndriven by Low-level policy that uses parameters received from mid-level policy\nand behavior cloning ensuring precise trajectory execution. We validate our\napproach on complex real-world acquisition trials involving granular, liquid,\nsemisolid, and deformable food types along with fruit chunks and soup\nacquisition. Across 46 bowls, LAVA acquires much more efficiently than\nbaselines with a success rate of 89 +/- 4% and generalizes across realistic\nplate variations such as different positions, varieties, and amount of food in\nthe bowl. Code, datasets, videos, and supplementary materials can be found on\nour website.",
        "updated": "2024-03-19 16:21:40 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.12876v1"
    },
    {
        "title": "RASP: A Drone-based Reconfigurable Actuation and Sensing Platform Towards Ambient Intelligent Systems",
        "authors": "Minghui ZhaoJunxi XiaKaiyuan HouYanchen LiuStephen XiaXiaofan Jiang",
        "links": "http://arxiv.org/abs/2403.12853v1",
        "entry_id": "http://arxiv.org/abs/2403.12853v1",
        "pdf_url": "http://arxiv.org/pdf/2403.12853v1",
        "summary": "Realizing consumer-grade drones that are as useful as robot vacuums\nthroughout our homes or personal smartphones in our daily lives requires drones\nto sense, actuate, and respond to general scenarios that may arise. Towards\nthis vision, we propose RASP, a modular and reconfigurable sensing and\nactuation platform that allows drones to autonomously swap onboard sensors and\nactuators in only 25 seconds, allowing a single drone to quickly adapt to a\ndiverse range of tasks. RASP consists of a mechanical layer to physically swap\nsensor modules, an electrical layer to maintain power and communication lines\nto the sensor/actuator, and a software layer to maintain a common interface\nbetween the drone and any sensor module in our platform. Leveraging recent\nadvances in large language and visual language models, we further introduce the\narchitecture, implementation, and real-world deployments of a personal\nassistant system utilizing RASP. We demonstrate that RASP can enable a diverse\nrange of useful tasks in home, office, lab, and other indoor settings.",
        "updated": "2024-03-19 15:57:32 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.12853v1"
    }
]