[
    {
        "title": "Non-stationary and Sparsely-correlated Multi-output Gaussian Process with Spike-and-Slab Prior",
        "authors": "Wang XinmingLi YongxiangYue XiaoweiWu Jianguo",
        "links": "http://arxiv.org/abs/2409.03149v1",
        "entry_id": "http://arxiv.org/abs/2409.03149v1",
        "pdf_url": "http://arxiv.org/pdf/2409.03149v1",
        "summary": "Multi-output Gaussian process (MGP) is commonly used as a transfer learning\nmethod to leverage information among multiple outputs. A key advantage of MGP\nis providing uncertainty quantification for prediction, which is highly\nimportant for subsequent decision-making tasks. However, traditional MGP may\nnot be sufficiently flexible to handle multivariate data with dynamic\ncharacteristics, particularly when dealing with complex temporal correlations.\nAdditionally, since some outputs may lack correlation, transferring information\namong them may lead to negative transfer. To address these issues, this study\nproposes a non-stationary MGP model that can capture both the dynamic and\nsparse correlation among outputs. Specifically, the covariance functions of MGP\nare constructed using convolutions of time-varying kernel functions. Then a\ndynamic spike-and-slab prior is placed on correlation parameters to\nautomatically decide which sources are informative to the target output in the\ntraining process. An expectation-maximization (EM) algorithm is proposed for\nefficient model fitting. Both numerical studies and a real case demonstrate its\nefficacy in capturing dynamic and sparse correlation structure and mitigating\nnegative transfer for high-dimensional time-series data. Finally, a\nmountain-car reinforcement learning case highlights its potential application\nin decision making problems.",
        "updated": "2024-09-05 00:56:25 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.03149v1"
    },
    {
        "title": "An Introduction to Centralized Training for Decentralized Execution in Cooperative Multi-Agent Reinforcement Learning",
        "authors": "Christopher Amato",
        "links": "http://arxiv.org/abs/2409.03052v1",
        "entry_id": "http://arxiv.org/abs/2409.03052v1",
        "pdf_url": "http://arxiv.org/pdf/2409.03052v1",
        "summary": "Multi-agent reinforcement learning (MARL) has exploded in popularity in\nrecent years. Many approaches have been developed but they can be divided into\nthree main types: centralized training and execution (CTE), centralized\ntraining for decentralized execution (CTDE), and Decentralized training and\nexecution (DTE).\n  CTDE methods are the most common as they can use centralized information\nduring training but execute in a decentralized manner -- using only information\navailable to that agent during execution. CTDE is the only paradigm that\nrequires a separate training phase where any available information (e.g., other\nagent policies, underlying states) can be used. As a result, they can be more\nscalable than CTE methods, do not require communication during execution, and\ncan often perform well. CTDE fits most naturally with the cooperative case, but\ncan be potentially applied in competitive or mixed settings depending on what\ninformation is assumed to be observed.\n  This text is an introduction to CTDE in cooperative MARL. It is meant to\nexplain the setting, basic concepts, and common methods. It does not cover all\nwork in CTDE MARL as the subarea is quite extensive. I have included work that\nI believe is important for understanding the main concepts in the subarea and\napologize to those that I have omitted.",
        "updated": "2024-09-04 19:54:40 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.03052v1"
    },
    {
        "title": "CONClave -- Secure and Robust Cooperative Perception for CAVs Using Authenticated Consensus and Trust Scoring",
        "authors": "Edward AndertFrancis MendozaHans Walter BehrensAviral Shrivastava",
        "links": "http://dx.doi.org/10.1145/3649329.3658491",
        "entry_id": "http://arxiv.org/abs/2409.02863v1",
        "pdf_url": "http://arxiv.org/pdf/2409.02863v1",
        "summary": "Connected Autonomous Vehicles have great potential to improve automobile\nsafety and traffic flow, especially in cooperative applications where\nperception data is shared between vehicles. However, this cooperation must be\nsecured from malicious intent and unintentional errors that could cause\naccidents. Previous works typically address singular security or reliability\nissues for cooperative driving in specific scenarios rather than the set of\nerrors together. In this paper, we propose CONClave, a tightly coupled\nauthentication, consensus, and trust scoring mechanism that provides\ncomprehensive security and reliability for cooperative perception in autonomous\nvehicles. CONClave benefits from the pipelined nature of the steps such that\nfaults can be detected significantly faster and with less compute. Overall,\nCONClave shows huge promise in preventing security flaws, detecting even\nrelatively minor sensing faults, and increasing the robustness and accuracy of\ncooperative perception in CAVs while adding minimal overhead.",
        "updated": "2024-09-04 16:42:40 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.02863v1"
    },
    {
        "title": "A Survey on Emergent Language",
        "authors": "Jannik PetersConstantin Waubert de PuiseauHasan TercanArya GopikrishnanGustavo Adolpho Lucas De CarvalhoChristian BitterTobias Meisen",
        "links": "http://arxiv.org/abs/2409.02645v1",
        "entry_id": "http://arxiv.org/abs/2409.02645v1",
        "pdf_url": "http://arxiv.org/pdf/2409.02645v1",
        "summary": "The field of emergent language represents a novel area of research within the\ndomain of artificial intelligence, particularly within the context of\nmulti-agent reinforcement learning. Although the concept of studying language\nemergence is not new, early approaches were primarily concerned with explaining\nhuman language formation, with little consideration given to its potential\nutility for artificial agents. In contrast, studies based on reinforcement\nlearning aim to develop communicative capabilities in agents that are\ncomparable to or even superior to human language. Thus, they extend beyond the\nlearned statistical representations that are common in natural language\nprocessing research. This gives rise to a number of fundamental questions, from\nthe prerequisites for language emergence to the criteria for measuring its\nsuccess. This paper addresses these questions by providing a comprehensive\nreview of 181 scientific publications on emergent language in artificial\nintelligence. Its objective is to serve as a reference for researchers\ninterested in or proficient in the field. Consequently, the main contributions\nare the definition and overview of the prevailing terminology, the analysis of\nexisting evaluation methods and metrics, and the description of the identified\nresearch gaps.",
        "updated": "2024-09-04 12:22:05 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.02645v1"
    },
    {
        "title": "Context-Aware Agent-based Model for Smart Long Distance Transport System",
        "authors": "Muhammad RaeesAfzal Ahmed",
        "links": "http://arxiv.org/abs/2409.02434v1",
        "entry_id": "http://arxiv.org/abs/2409.02434v1",
        "pdf_url": "http://arxiv.org/pdf/2409.02434v1",
        "summary": "Long-distance transport plays a vital role in the economic growth of\ncountries. However, there is a lack of systems being developed for monitoring\nand support of long-route vehicles (LRV). Sustainable and context-aware\ntransport systems with modern technologies are needed. We model for\nlong-distance vehicle transportation monitoring and support systems in a\nmulti-agent environment. Our model incorporates the distance vehicle transport\nmechanism through agent-based modeling (ABM). This model constitutes the design\nprotocol of ABM called Overview, Design, and Details (ODD). This model\nconstitutes that every category of agents is offering information as a service.\nHence, a federation of services through protocol for the communication between\nsensors and software components is desired. Such integration of services\nsupports monitoring and tracking of vehicles on the route. The model\nsimulations provide useful results for the integration of services based on\nsmart objects.",
        "updated": "2024-09-04 04:25:10 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.02434v1"
    }
]