[
    {
        "title": "Improving Users' Passwords with DPAR: a Data-driven Password Recommendation System",
        "authors": "Assaf MoragLiron DavidEran TochAvishai Wool",
        "links": "http://arxiv.org/abs/2406.03423v1",
        "entry_id": "http://arxiv.org/abs/2406.03423v1",
        "pdf_url": "http://arxiv.org/pdf/2406.03423v1",
        "summary": "Passwords are the primary authentication method online, but even with\npassword policies and meters, users still find it hard to create strong and\nmemorable passwords. In this paper, we propose DPAR: a Data-driven PAssword\nRecommendation system based on a dataset of 905 million leaked passwords. DPAR\ngenerates password recommendations by analyzing the user's given password and\nsuggesting specific tweaks that would make it stronger while still keeping it\nmemorable and similar to the original password. We conducted two studies to\nevaluate our approach: verifying the memorability of generated passwords\n(n=317), and evaluating the strength and recall of DPAR recommendations against\npassword meters (n=441). In a randomized experiment, we show that DPAR\nincreased password strength by 34.8 bits on average and did not significantly\naffect the ability to recall their password. Furthermore, 36.6% of users\naccepted DPAR's recommendations verbatim. We discuss our findings and their\nimplications for enhancing password management with recommendation systems.",
        "updated": "2024-06-05 16:19:24 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.03423v1"
    },
    {
        "title": "RemixTape: Enriching Narratives about Metrics with Semantic Alignment and Contextual Recommendation",
        "authors": "Matthew BrehmerMargaret DrouhardArjun Srinivasan",
        "links": "http://arxiv.org/abs/2406.03415v1",
        "entry_id": "http://arxiv.org/abs/2406.03415v1",
        "pdf_url": "http://arxiv.org/pdf/2406.03415v1",
        "summary": "The temporal dynamics of quantitative metrics or key performance indicators\n(KPIs) are central to decision making within enterprise organizations.\nRecently, major business intelligence providers have introduced new\ninfrastructure for defining, sharing, and monitoring metric values. However,\nthese values are often presented in isolation and appropriate context is seldom\nexternalized. In this design study, we present RemixTape, an application for\nconstructing structured narratives around metrics. With design imperatives\ngrounded in an formative interview study, RemixTape provides a hierarchical\ncanvas for collecting and coordinating sequences of line chart representations\nof metrics, along with the ability to externalize situational context around\nthem. RemixTape incorporates affordances to semantically align and annotate\njuxtaposed charts and text, as well as recommendations of complementary charts\nbased on metrics already present on the canvas. We evaluated RemixTape in a\nuser study in which six enterprise data professionals reproduced and extended\npartial narratives, with participants appreciating RemixTape as a novel\nalternative to dashboards, galleries, and slide presentations for supporting\nconversations about metrics. We conclude with a reflection on how aspects of\nRemixTape could generalize beyond metrics, with a call to define a conceptual\nfoundation for remixing in the context of visualization.",
        "updated": "2024-06-05 16:11:15 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.03415v1"
    },
    {
        "title": "SelfReDepth: Self-Supervised Real-Time Depth Restoration for Consumer-Grade Sensors",
        "authors": "Alexandre DuarteFrancisco FernandesJoão M. PereiraCatarina MoreiraJacinto C. NascimentoJoaquim Jorge",
        "links": "http://arxiv.org/abs/2406.03388v1",
        "entry_id": "http://arxiv.org/abs/2406.03388v1",
        "pdf_url": "http://arxiv.org/pdf/2406.03388v1",
        "summary": "Depth maps produced by consumer-grade sensors suffer from inaccurate\nmeasurements and missing data from either system or scene-specific sources.\nData-driven denoising algorithms can mitigate such problems. However, they\nrequire vast amounts of ground truth depth data. Recent research has tackled\nthis limitation using self-supervised learning techniques, but it requires\nmultiple RGB-D sensors. Moreover, most existing approaches focus on denoising\nsingle isolated depth maps or specific subjects of interest, highlighting a\nneed for methods to effectively denoise depth maps in real-time dynamic\nenvironments. This paper extends state-of-the-art approaches for\ndepth-denoising commodity depth devices, proposing SelfReDepth, a\nself-supervised deep learning technique for depth restoration, via denoising\nand hole-filling by inpainting full-depth maps captured with RGB-D sensors. The\nalgorithm targets depth data in video streams, utilizing multiple sequential\ndepth frames coupled with color data to achieve high-quality depth videos with\ntemporal coherence. Finally, SelfReDepth is designed to be compatible with\nvarious RGB-D sensors and usable in real-time scenarios as a pre-processing\nstep before applying other depth-dependent algorithms. Our results demonstrate\nour approach's real-time performance on real-world datasets. They show that it\noutperforms state-of-the-art denoising and restoration performance at over\n30fps on Commercial Depth Cameras, with potential benefits for augmented and\nmixed-reality applications.",
        "updated": "2024-06-05 15:38:02 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.03388v1"
    },
    {
        "title": "Save It for the \"Hot\" Day: An LLM-Empowered Visual Analytics System for Heat Risk Management",
        "authors": "Haobo LiWong Kam-KwaiYan LuoJuntong ChenChengzhong LiuYaxuan ZhangAlexis Kai Hon LauHuamin QuDongyu Liu",
        "links": "http://arxiv.org/abs/2406.03317v1",
        "entry_id": "http://arxiv.org/abs/2406.03317v1",
        "pdf_url": "http://arxiv.org/pdf/2406.03317v1",
        "summary": "The escalating frequency and intensity of heat-related climate events,\nparticularly heatwaves, emphasize the pressing need for advanced heat risk\nmanagement strategies. Current approaches, primarily relying on numerical\nmodels, face challenges in spatial-temporal resolution and in capturing the\ndynamic interplay of environmental, social, and behavioral factors affecting\nheat risks. This has led to difficulties in translating risk assessments into\neffective mitigation actions. Recognizing these problems, we introduce a novel\napproach leveraging the burgeoning capabilities of Large Language Models (LLMs)\nto extract rich and contextual insights from news reports. We hence propose an\nLLM-empowered visual analytics system, Havior, that integrates the precise,\ndata-driven insights of numerical models with nuanced news report information.\nThis hybrid approach enables a more comprehensive assessment of heat risks and\nbetter identification, assessment, and mitigation of heat-related threats. The\nsystem incorporates novel visualization designs, such as \"thermoglyph\" and news\nglyph, enhancing intuitive understanding and analysis of heat risks. The\nintegration of LLM-based techniques also enables advanced information retrieval\nand semantic knowledge extraction that can be guided by experts' analytics\nneeds. Our case studies on two cities that faced significant heatwave events\nand interviews with five experts have demonstrated the usefulness of our system\nin providing in-depth and actionable insights for heat risk management.",
        "updated": "2024-06-05 14:29:44 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.03317v1"
    },
    {
        "title": "Reconfiguring Participatory Design to Resist AI Realism",
        "authors": "Aakash Gautam",
        "links": "http://dx.doi.org/10.1145/3661455.3669867",
        "entry_id": "http://arxiv.org/abs/2406.03245v1",
        "pdf_url": "http://arxiv.org/pdf/2406.03245v1",
        "summary": "The growing trend of artificial intelligence (AI) as a solution to social and\ntechnical problems reinforces AI Realism -- the belief that AI is an inevitable\nand natural order. In response, this paper argues that participatory design\n(PD), with its focus on democratic values and processes, can play a role in\nquestioning and resisting AI Realism. I examine three concerning aspects of AI\nRealism: the facade of democratization that lacks true empowerment, demands for\nhuman adaptability in contrast to AI systems' inflexibility, and the\nobfuscation of essential human labor enabling the AI system. I propose\nresisting AI Realism by reconfiguring PD to continue engaging with\nvalue-centered visions, increasing its exploration of non-AI alternatives, and\nmaking the essential human labor underpinning AI systems visible. I position PD\nas a means to generate friction against AI Realism and open space for\nalternative futures centered on human needs and values.",
        "updated": "2024-06-05 13:21:46 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.03245v1"
    }
]