[
    {
        "title": "Leveraging Large Language Models to Enhance Domain Expert Inclusion in Data Science Workflows",
        "authors": "Jasmine Y. ShihVishal MohantyYannis KatsisHariharan Subramonyam",
        "links": "http://arxiv.org/abs/2405.02260v1",
        "entry_id": "http://arxiv.org/abs/2405.02260v1",
        "pdf_url": "http://arxiv.org/pdf/2405.02260v1",
        "summary": "Domain experts can play a crucial role in guiding data scientists to optimize\nmachine learning models while ensuring contextual relevance for downstream use.\nHowever, in current workflows, such collaboration is challenging due to\ndiffering expertise, abstract documentation practices, and lack of access and\nvisibility into low-level implementation artifacts. To address these challenges\nand enable domain expert participation, we introduce CellSync, a collaboration\nframework comprising (1) a Jupyter Notebook extension that continuously tracks\nchanges to dataframes and model metrics and (2) a Large Language Model powered\nvisualization dashboard that makes those changes interpretable to domain\nexperts. Through CellSync's cell-level dataset visualization with code\nsummaries, domain experts can interactively examine how individual data and\nmodeling operations impact different data segments. The chat features enable\ndata-centric conversations and targeted feedback to data scientists. Our\npreliminary evaluation shows that CellSync provides transparency and promotes\ncritical discussions about the intents and implications of data operations.",
        "updated": "2024-05-03 17:22:15 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.02260v1"
    },
    {
        "title": "On the Utility of External Agent Intention Predictor for Human-AI Coordination",
        "authors": "Chenxu WangZilong ChenAngelo CangelosiHuaping Liu",
        "links": "http://arxiv.org/abs/2405.02229v1",
        "entry_id": "http://arxiv.org/abs/2405.02229v1",
        "pdf_url": "http://arxiv.org/pdf/2405.02229v1",
        "summary": "Reaching a consensus on the team plans is vital to human-AI coordination.\nAlthough previous studies provide approaches through communications in various\nways, it could still be hard to coordinate when the AI has no explainable plan\nto communicate. To cover this gap, we suggest incorporating external models to\nassist humans in understanding the intentions of AI agents. In this paper, we\npropose a two-stage paradigm that first trains a Theory of Mind (ToM) model\nfrom collected offline trajectories of the target agent, and utilizes the model\nin the process of human-AI collaboration by real-timely displaying the future\naction predictions of the target agent. Such a paradigm leaves the AI agent as\na black box and thus is available for improving any agents. To test our\nparadigm, we further implement a transformer-based predictor as the ToM model\nand develop an extended online human-AI collaboration platform for experiments.\nThe comprehensive experimental results verify that human-AI teams can achieve\nbetter performance with the help of our model. A user assessment attached to\nthe experiment further demonstrates that our paradigm can significantly enhance\nthe situational awareness of humans. Our study presents the potential to\naugment the ability of humans via external assistance in human-AI\ncollaboration, which may further inspire future research.",
        "updated": "2024-05-03 16:39:20 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.02229v1"
    },
    {
        "title": "Task Synthesis for Elementary Visual Programming in XLogoOnline Environment",
        "authors": "Chao WenAhana GhoshJacqueline StaubAdish Singla",
        "links": "http://arxiv.org/abs/2405.02173v1",
        "entry_id": "http://arxiv.org/abs/2405.02173v1",
        "pdf_url": "http://arxiv.org/pdf/2405.02173v1",
        "summary": "In recent years, the XLogoOnline programming platform has gained popularity\namong novice learners. It integrates the Logo programming language with visual\nprogramming, providing a visual interface for learning computing concepts.\nHowever, XLogoOnline offers only a limited set of tasks, which are inadequate\nfor learners to master the computing concepts that require sufficient practice.\nTo address this, we introduce XLogoSyn, a novel technique for synthesizing\nhigh-quality tasks for varying difficulty levels. Given a reference task,\nXLogoSyn can generate practice tasks at varying difficulty levels that cater to\nthe varied needs and abilities of different learners. XLogoSyn achieves this by\ncombining symbolic execution and constraint satisfaction techniques. Our expert\nstudy demonstrates the effectiveness of XLogoSyn. We have also deployed\nsynthesized practice tasks into XLogoOnline, highlighting the educational\nbenefits of these synthesized practice tasks.",
        "updated": "2024-05-03 15:22:46 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.02173v1"
    },
    {
        "title": "Are We in The Zone? Exploring The Features and Method of Detecting Simultaneous Flow Experiences Based on EEG Signals",
        "authors": "Baiqiao ZhangXiangxian LiYunfan ZhouJuan LiuWeiying LiuChao ZhouYulong Bian",
        "links": "http://arxiv.org/abs/2405.02045v1",
        "entry_id": "http://arxiv.org/abs/2405.02045v1",
        "pdf_url": "http://arxiv.org/pdf/2405.02045v1",
        "summary": "When executing interdependent personal tasks for the team's purpose,\nsimultaneous individual flow(simultaneous flow) is the antecedent condition of\nachieving shared team flow. Detecting simultaneous flow helps better\nunderstanding the status of team members, which is thus important for\noptimizing multi-user interaction systems. However, there is currently a lack\nexploration on objective features and methods for detecting simultaneous flow.\nBased on brain mechanism of flow in teamwork and previous studies on\nelectroencephalogram (EEG)-based individual flow detection, this study aims to\nexplore the significant EEG features related to simultaneous flow, as well as\neffective detection methods based on EEG signals. First, a two-player\nsimultaneous flow task is designed, based on which we construct the first\nmulti-EEG signals dataset of simultaneous flow. Then, we explore the potential\nEEG signal features that may be related to individual and simultaneous flow and\nvalidate their effectiveness in simultaneous flow detection with various\nmachine learning models. The results show that 1) the inter-brain synchrony\nfeatures are relevant to simultaneous flow due to enhancing the models'\nperformance in detecting different types of simultaneous flow; 2) the features\nfrom the frontal lobe area seem to be given priority attention when detecting\nsimultaneous flows; 3) Random Forests performed best in binary classification\nwhile Neural Network and Deep Neural Network3 performed best in ternary\nclassification.",
        "updated": "2024-05-03 12:22:35 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.02045v1"
    },
    {
        "title": "Adversarial Botometer: Adversarial Analysis for Social Bot Detection",
        "authors": "Shaghayegh NajariDavood RafieeMostafa SalehiReza Farahbakhsh",
        "links": "http://arxiv.org/abs/2405.02016v1",
        "entry_id": "http://arxiv.org/abs/2405.02016v1",
        "pdf_url": "http://arxiv.org/pdf/2405.02016v1",
        "summary": "Social bots play a significant role in many online social networks (OSN) as\nthey imitate human behavior. This fact raises difficult questions about their\ncapabilities and potential risks. Given the recent advances in Generative AI\n(GenAI), social bots are capable of producing highly realistic and complex\ncontent that mimics human creativity. As the malicious social bots emerge to\ndeceive people with their unrealistic content, identifying them and\ndistinguishing the content they produce has become an actual challenge for\nnumerous social platforms. Several approaches to this problem have already been\nproposed in the literature, but the proposed solutions have not been widely\nevaluated. To address this issue, we evaluate the behavior of a text-based bot\ndetector in a competitive environment where some scenarios are proposed:\n\\textit{First}, the tug-of-war between a bot and a bot detector is examined. It\nis interesting to analyze which party is more likely to prevail and which\ncircumstances influence these expectations. In this regard, we model the\nproblem as a synthetic adversarial game in which a conversational bot and a bot\ndetector are engaged in strategic online interactions. \\textit{Second}, the bot\ndetection model is evaluated under attack examples generated by a social bot;\nto this end, we poison the dataset with attack examples and evaluate the model\nperformance under this condition. \\textit{Finally}, to investigate the impact\nof the dataset, a cross-domain analysis is performed. Through our comprehensive\nevaluation of different categories of social bots using two benchmark datasets,\nwe were able to demonstrate some achivement that could be utilized in future\nworks.",
        "updated": "2024-05-03 11:28:21 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.02016v1"
    }
]