[
    {
        "title": "Robi Butler: Remote Multimodal Interactions with Household Robot Assistant",
        "authors": "Anxing XiaoNuwan JanakaTianrun HuAnshul GuptaKaixin LiCunjun YuDavid Hsu",
        "links": "http://arxiv.org/abs/2409.20548v1",
        "entry_id": "http://arxiv.org/abs/2409.20548v1",
        "pdf_url": "http://arxiv.org/pdf/2409.20548v1",
        "summary": "In this paper, we introduce Robi Butler, a novel household robotic system\nthat enables multimodal interactions with remote users. Building on the\nadvanced communication interfaces, Robi Butler allows users to monitor the\nrobot's status, send text or voice instructions, and select target objects by\nhand pointing. At the core of our system is a high-level behavior module,\npowered by Large Language Models (LLMs), that interprets multimodal\ninstructions to generate action plans. These plans are composed of a set of\nopen vocabulary primitives supported by Vision Language Models (VLMs) that\nhandle both text and pointing queries. The integration of the above components\nallows Robi Butler to ground remote multimodal instructions in the real-world\nhome environment in a zero-shot manner. We demonstrate the effectiveness and\nefficiency of this system using a variety of daily household tasks that involve\nremote users giving multimodal instructions. Additionally, we conducted a user\nstudy to analyze how multimodal interactions affect efficiency and user\nexperience during remote human-robot interaction and discuss the potential\nimprovements.",
        "updated": "2024-09-30 17:49:09 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.20548v1"
    },
    {
        "title": "Does Positive Reinforcement Work?: A Quasi-Experimental Study of the Effects of Positive Feedback on Reddit",
        "authors": "Charlotte LambertKoustuv SahaEshwar Chandrasekharan",
        "links": "http://arxiv.org/abs/2409.20410v1",
        "entry_id": "http://arxiv.org/abs/2409.20410v1",
        "pdf_url": "http://arxiv.org/pdf/2409.20410v1",
        "summary": "Social media platform design often incorporates explicit signals of positive\nfeedback. Some moderators provide positive feedback with the goal of positive\nreinforcement, but are often unsure of their ability to actually influence user\nbehavior. Despite its widespread use and theory touting positive feedback as\ncrucial for user motivation, its effect on recipients is relatively unknown.\nThis paper examines how positive feedback impacts Reddit users and evaluates\nits differential effects to understand who benefits most from receiving\npositive feedback. Through a causal inference study of 11M posts across 4\nmonths, we find that users who received positive feedback made more frequent\n(2% per day) and higher quality (57% higher score; 2% fewer removals per day)\nposts compared to a set of matched control users. Our findings highlight the\nneed for platforms and communities to expand their perspective on moderation\nand complement punitive approaches with positive reinforcement strategies.",
        "updated": "2024-09-30 15:38:33 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.20410v1"
    },
    {
        "title": "Automation from the Worker's Perspective",
        "authors": "Ben ArmstrongValerie K. ChenAlex CuellarAlexandra Forsey-SmerekJulie A. Shah",
        "links": "http://arxiv.org/abs/2409.20387v1",
        "entry_id": "http://arxiv.org/abs/2409.20387v1",
        "pdf_url": "http://arxiv.org/pdf/2409.20387v1",
        "summary": "Common narratives about automation often pit new technologies against\nworkers. The introduction of advanced machine tools, industrial robots, and AI\nhave all been met with concern that technological progress will mean fewer\njobs. However, workers themselves offer a more optimistic, nuanced perspective.\nDrawing on a far-reaching 2024 survey of more than 9,000 workers across nine\ncountries, this paper finds that more workers report potential benefits from\nnew technologies like robots and AI for their safety and comfort at work, their\npay, and their autonomy on the job than report potential costs. Workers with\njobs that ask them to solve complex problems, workers who feel valued by their\nemployers, and workers who are motivated to move up in their careers are all\nmore likely to see new technologies as beneficial. In contrast to assumptions\nin previous research, more formal education is in some cases associated with\nmore negative attitudes toward automation and its impact on work. In an\nexperimental setting, the prospect of financial incentives for workers improve\ntheir perceptions of automation technologies, whereas the prospect of increased\ninput about how new technologies are used does not have a significant effect on\nworkers' attitudes toward automation.",
        "updated": "2024-09-30 15:21:08 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.20387v1"
    },
    {
        "title": "Computer-mediated therapies for stroke rehabilitation: a systematic review and meta-Analysis",
        "authors": "Stanley Mugisha. Mirko Job. Matteo ZoppiMarco TestaRezia Molfino",
        "links": "http://dx.doi.org/10.1016/j.jstrokecerebrovasdis.2022.106454",
        "entry_id": "http://arxiv.org/abs/2409.20260v1",
        "pdf_url": "http://arxiv.org/pdf/2409.20260v1",
        "summary": "OBJECTIVE: To evaluate the efficacy of different forms of virtual reality\n(VR) treatments as either immersive virtual reality (IVR) or non-immersive\nvirtual reality (NIVR) in comparison to conventional therapy (CT) in improving\nphysical and psychological status among stroke patients. METHODS: The\nliterature search was conducted on seven databases. ACM Digital Library,\nMedline (via PubMed), Cochrane, IEEE Xplore, Web of Science, and Scopus. The\neffect sizes of the main outcomes were calculated using Cohen's d. Pooled\nresults were used to present an overall estimate of the treatment effect using\na random-effects model. RESULTS: A total of 22 randomized controlled trials\nwere evaluated. 3 trials demonstrated that immersive virtual reality improved\nupper limb activity, function and activity of daily life in a way comparable to\nCT. 18 trials showed that NIVR had similar benefits to CT for upper limb\nactivity and function, balance and mobility, activities of daily living and\nparticipation. A comparison between the different forms of VR showed that IVR\nmay be more beneficial than NIVR for upper limb training and activities of\ndaily life. CONCLUSIONS: This study found out that IVR therapies may be more\neffective than NIVR but not CT to improve upper limb activity, function, and\ndaily life activities. However, there is no evidence of the durability of IVR\ntreatment. More research involving studies with larger samples is needed to\nassess the long-term effects and promising benefits of immersive virtual\nreality technology.",
        "updated": "2024-09-30 12:50:46 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.20260v1"
    },
    {
        "title": "Investigating Creation Perspectives and Icon Placement Preferences for On-Body Menus in Virtual Reality",
        "authors": "Xiang LiWei HeShan JinJan GugenheimerPan HuiHai-Ning LiangPer Ola Kristensson",
        "links": "http://dx.doi.org/10.1145/3698136",
        "entry_id": "http://arxiv.org/abs/2409.20238v1",
        "pdf_url": "http://arxiv.org/pdf/2409.20238v1",
        "summary": "On-body menus present a novel interaction paradigm within Virtual Reality\n(VR) environments by embedding virtual interfaces directly onto the user's\nbody. Unlike traditional screen-based interfaces, on-body menus enable users to\ninteract with virtual options or icons visually attached to their physical\nform. In this paper, We investigated the impact of the creation process on the\neffectiveness of on-body menus, comparing first-person, third-person, and\nmirror perspectives. Our first study ($N$ = 12) revealed that the mirror\nperspective led to faster creation times and more accurate recall compared to\nthe other two perspectives. To further explore user preferences, we conducted a\nsecond study ($N$ = 18) utilizing a VR system with integrated body tracking. By\ncombining distributions of icons from both studies ($N$ = 30), we confirmed\nsignificant preferences in on-body menu placement based on icon category (e.g.,\nSocial Media icons were consistently placed on forearms). We also discovered\nassociations between categories, such as Leisure and Social Media icons\nfrequently co-occurring. Our findings highlight the importance of the creation\nprocess, uncover user preferences for on-body menu organization, and provide\ninsights to guide the development of intuitive and effective on-body\ninteractions within virtual environments.",
        "updated": "2024-09-30 12:23:24 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.20238v1"
    }
]