[
    {
        "title": "Making Hybrid Languages: A Recipe",
        "authors": "Leif AndersenCameron MoyStephen ChangMatthias Felleisen",
        "links": "http://arxiv.org/abs/2403.01335v1",
        "entry_id": "http://arxiv.org/abs/2403.01335v1",
        "pdf_url": "http://arxiv.org/pdf/2403.01335v1",
        "summary": "The dominant programming languages support only linear text to express ideas.\nVisual languages offer graphical representations for entire programs, when\nviewed with special tools. Hybrid languages, with support from existing tools,\nallow developers to express their ideas with a mix of textual and graphical\nsyntax tailored to an application domain. This mix puts both kinds of syntax on\nequal footing and, importantly, the enriched language does not disrupt a\nprogrammer's typical workflow. This paper presents a recipe for equipping\nexisting textual programming languages as well as accompanying IDEs with a\nmechanism for creating and using graphical interactive syntax. It also presents\nthe first hybrid language and IDE created using the recipe.",
        "updated": "2024-03-02 22:53:06 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.01335v1"
    },
    {
        "title": "Augmenting Automation: Intent-Based User Instruction Classification with Machine Learning",
        "authors": "Lochan BasyalBijay Gaudel",
        "links": "http://arxiv.org/abs/2403.01242v1",
        "entry_id": "http://arxiv.org/abs/2403.01242v1",
        "pdf_url": "http://arxiv.org/pdf/2403.01242v1",
        "summary": "Electric automation systems offer convenience and efficiency in controlling\nelectrical circuits and devices. Traditionally, these systems rely on\npredefined commands for control, limiting flexibility and adaptability. In this\npaper, we propose a novel approach to augment automation by introducing\nintent-based user instruction classification using machine learning techniques.\nOur system represents user instructions as intents, allowing for dynamic\ncontrol of electrical circuits without relying on predefined commands. Through\na machine learning model trained on a labeled dataset of user instructions, our\nsystem classifies intents from user input, enabling a more intuitive and\nadaptable control scheme. We present the design and implementation of our\nintent-based electric automation system, detailing the development of the\nmachine learning model for intent classification. Experimental results\ndemonstrate the effectiveness of our approach in enhancing user experience and\nexpanding the capabilities of electric automation systems. Our work contributes\nto the advancement of smart technologies by providing a more seamless\ninteraction between users and their environments.",
        "updated": "2024-03-02 16:06:03 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.01242v1"
    },
    {
        "title": "The Science of Data Collection: Insights from Surveys can Improve Machine Learning Models",
        "authors": "Stephanie EckmanBarbara PlankFrauke Kreuter",
        "links": "http://arxiv.org/abs/2403.01208v1",
        "entry_id": "http://arxiv.org/abs/2403.01208v1",
        "pdf_url": "http://arxiv.org/pdf/2403.01208v1",
        "summary": "Whether future AI models make the world safer or less safe for humans rests\nin part on our ability to efficiently collect accurate data from people about\nwhat they want the models to do. However, collecting high quality data is\ndifficult, and most AI/ML researchers are not trained in data collection\nmethods. The growing emphasis on data-centric AI highlights the potential of\ndata to enhance model performance. It also reveals an opportunity to gain\ninsights from survey methodology, the science of collecting high-quality survey\ndata.\n  In this position paper, we summarize lessons from the survey methodology\nliterature and discuss how they can improve the quality of training and\nfeedback data, which in turn improve model performance. Based on the cognitive\nresponse process model, we formulate specific hypotheses about the aspects of\nlabel collection that may impact training data quality. We also suggest\ncollaborative research ideas into how possible biases in data collection can be\nmitigated, making models more accurate and human-centric.",
        "updated": "2024-03-02 13:34:43 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.01208v1"
    },
    {
        "title": "Towards RehabCoach: Design and Preliminary Evaluation of a Conversational Agent Supporting Unsupervised Therapy after Stroke",
        "authors": "Giada DevittoriMehdi AkeddarAlexandra RetevoiFabian SchneiderViktoria CvetkovaDaria DinacciAntonella CaliffiPaolo RossiClaudio PetrilloTobias KowatschOlivier Lambercy",
        "links": "http://arxiv.org/abs/2403.01127v1",
        "entry_id": "http://arxiv.org/abs/2403.01127v1",
        "pdf_url": "http://arxiv.org/pdf/2403.01127v1",
        "summary": "Unsupervised therapy after stroke is a promising way to boost therapy dose\nwithout significantly increasing the workload on healthcare professionals.\nHowever, it raises important challenges, such as lower adherence to therapy in\nthe absence of social interaction with therapists. We present the initial\nprototype of RehabCoach, a novel smartphone-based app with conversational agent\nto support unsupervised therapy. RehabCoach is designed to increase patients\nengagement and adherence to therapy and to provide information (e.g., about\nstroke, health) in an interactive and user-friendly manner. We report on the\ndesign and usability evaluation of the first prototype of RehabCoach, assessed\nby four stroke patients and five healthcare professionals, who interacted with\nthe app in a single testing session. Task completion time and success rates\nwere measured for 15 representative tasks, and participants assessed usability\nvia questionnaires and a semi-structured interview. Results show that it was\nfeasible for stroke patients to successfully interact with RehabCoach (task\nsuccess $\\geq$ 93 $\\%$) without requiring extensive training. Participants\npositively rated the usability of RehabCoach (mean mHealth App Usability\nQuestionnaire score: 1.3 for primary users, 1.4 for healthcare professionals,\non a scale from 1 (positive evaluation) to 7). The feedback collected in this\nwork opens the door to further enhance RehabCoach as an interactive digital\ntool to support unsupervised rehabilitation.",
        "updated": "2024-03-02 08:18:02 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.01127v1"
    },
    {
        "title": "Sharing Frissons among Online Video Viewers: Exploring the Design of Affective Communication for Aesthetic Chills",
        "authors": "Zeyu HuangXinyi CaoYuanhao ZhangXiaojuan Ma",
        "links": "http://dx.doi.org/10.1145/3613904.3642818",
        "entry_id": "http://arxiv.org/abs/2403.01090v1",
        "pdf_url": "http://arxiv.org/pdf/2403.01090v1",
        "summary": "On online video platforms, viewers often lack a channel to sense others' and\nexpress their affective state on the fly compared to co-located group-viewing.\nThis study explored the design of complementary affective communication\nspecifically for effortless, spontaneous sharing of frissons during video\nwatching. Also known as aesthetic chills, frissons are instant\npsycho-physiological reactions like goosebumps and shivers to arousing stimuli.\nWe proposed an approach that unobtrusively detects viewers' frissons using skin\nelectrodermal activity sensors and presents the aggregated data alongside\nonline videos. Following a design process of brainstorming, focus group\ninterview (N=7), and design iterations, we proposed three different designs to\nencode viewers' frisson experiences, namely, ambient light, icon, and\nvibration. A mixed-methods within-subject study (N=48) suggested that our\napproach offers a non-intrusive and efficient way to share viewers' frisson\nmoments, increases the social presence of others as if watching together, and\ncan create affective contagion among viewers.",
        "updated": "2024-03-02 04:21:21 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.01090v1"
    }
]