[
    {
        "title": "Bandit Profit-maximization for Targeted Marketing",
        "authors": "Joon Suk HuhEllen VitercikKirthevasan Kandasamy",
        "links": "http://arxiv.org/abs/2403.01361v1",
        "entry_id": "http://arxiv.org/abs/2403.01361v1",
        "pdf_url": "http://arxiv.org/pdf/2403.01361v1",
        "summary": "We study a sequential profit-maximization problem, optimizing for both price\nand ancillary variables like marketing expenditures. Specifically, we aim to\nmaximize profit over an arbitrary sequence of multiple demand curves, each\ndependent on a distinct ancillary variable, but sharing the same price. A\nprototypical example is targeted marketing, where a firm (seller) wishes to\nsell a product over multiple markets. The firm may invest different marketing\nexpenditures for different markets to optimize customer acquisition, but must\nmaintain the same price across all markets. Moreover, markets may have\nheterogeneous demand curves, each responding to prices and marketing\nexpenditures differently. The firm's objective is to maximize its gross profit,\nthe total revenue minus marketing costs.\n  Our results are near-optimal algorithms for this class of problems in an\nadversarial bandit setting, where demand curves are arbitrary non-adaptive\nsequences, and the firm observes only noisy evaluations of chosen points on the\ndemand curves. We prove a regret upper bound of\n$\\widetilde{\\mathcal{O}}\\big(nT^{3/4}\\big)$ and a lower bound of\n$\\Omega\\big((nT)^{3/4}\\big)$ for monotonic demand curves, and a regret bound of\n$\\widetilde{\\Theta}\\big(nT^{2/3}\\big)$ for demands curves that are monotonic in\nprice and concave in the ancillary variables.",
        "updated": "2024-03-03 01:33:47 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.01361v1"
    },
    {
        "title": "a-DCF: an architecture agnostic metric with application to spoofing-robust speaker verification",
        "authors": "Hye-jin ShimJee-weon JungTomi KinnunenNicholas EvansJean-Francois BonastreItshak Lapidot",
        "links": "http://arxiv.org/abs/2403.01355v1",
        "entry_id": "http://arxiv.org/abs/2403.01355v1",
        "pdf_url": "http://arxiv.org/pdf/2403.01355v1",
        "summary": "Spoofing detection is today a mainstream research topic. Standard metrics can\nbe applied to evaluate the performance of isolated spoofing detection solutions\nand others have been proposed to support their evaluation when they are\ncombined with speaker detection. These either have well-known deficiencies or\nrestrict the architectural approach to combine speaker and spoof detectors. In\nthis paper, we propose an architecture-agnostic detection cost function\n(a-DCF). A generalisation of the original DCF used widely for the assessment of\nautomatic speaker verification (ASV), the a-DCF is designed for the evaluation\nof spoofing-robust ASV. Like the DCF, the a-DCF reflects the cost of decisions\nin a Bayes risk sense, with explicitly defined class priors and detection cost\nmodel. We demonstrate the merit of the a-DCF through the benchmarking\nevaluation of architecturally-heterogeneous spoofing-robust ASV solutions.",
        "updated": "2024-03-03 00:58:27 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.01355v1"
    },
    {
        "title": "Improving Uncertainty Sampling with Bell Curve Weight Function",
        "authors": "Zan-Kai ChongHiroyuki OhsakiBok-Min Goi",
        "links": "http://dx.doi.org/10.17706/ijapm.2023.13.4.44-52",
        "entry_id": "http://arxiv.org/abs/2403.01352v1",
        "pdf_url": "http://arxiv.org/pdf/2403.01352v1",
        "summary": "Typically, a supervised learning model is trained using passive learning by\nrandomly selecting unlabelled instances to annotate. This approach is effective\nfor learning a model, but can be costly in cases where acquiring labelled\ninstances is expensive. For example, it can be time-consuming to manually\nidentify spam mails (labelled instances) from thousands of emails (unlabelled\ninstances) flooding an inbox during initial data collection. Generally, we\nanswer the above scenario with uncertainty sampling, an active learning method\nthat improves the efficiency of supervised learning by using fewer labelled\ninstances than passive learning. Given an unlabelled data pool, uncertainty\nsampling queries the labels of instances where the predicted probabilities, p,\nfall into the uncertainty region, i.e., $p \\approx 0.5$. The newly acquired\nlabels are then added to the existing labelled data pool to learn a new model.\nNonetheless, the performance of uncertainty sampling is susceptible to the area\nof unpredictable responses (AUR) and the nature of the dataset. It is difficult\nto determine whether to use passive learning or uncertainty sampling without\nprior knowledge of a new dataset. To address this issue, we propose bell curve\nsampling, which employs a bell curve weight function to acquire new labels.\nWith the bell curve centred at p=0.5, bell curve sampling selects instances\nwhose predicted values are in the uncertainty area most of the time without\nneglecting the rest. Simulation results show that, most of the time bell curve\nsampling outperforms uncertainty sampling and passive learning in datasets of\ndifferent natures and with AUR.",
        "updated": "2024-03-03 00:14:12 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.01352v1"
    },
    {
        "title": "SANGRIA: Stacked Autoencoder Neural Networks with Gradient Boosting for Indoor Localization",
        "authors": "Danish GufranSaideep TikuSudeep Pasricha",
        "links": "http://dx.doi.org/10.1109/LES.2023.3279017",
        "entry_id": "http://arxiv.org/abs/2403.01348v1",
        "pdf_url": "http://arxiv.org/pdf/2403.01348v1",
        "summary": "Indoor localization is a critical task in many embedded applications, such as\nasset tracking, emergency response, and realtime navigation. In this article,\nwe propose a novel fingerprintingbased framework for indoor localization called\nSANGRIA that uses stacked autoencoder neural networks with gradient boosted\ntrees. Our approach is designed to overcome the device heterogeneity challenge\nthat can create uncertainty in wireless signal measurements across embedded\ndevices used for localization. We compare SANGRIA to several state-of-the-art\nframeworks and demonstrate 42.96% lower average localization error across\ndiverse indoor locales and heterogeneous devices.",
        "updated": "2024-03-03 00:01:29 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.01348v1"
    },
    {
        "title": "Improve Cost Efficiency of Active Learning over Noisy Dataset",
        "authors": "Zan-Kai ChongHiroyuki OhsakiBryan Ng",
        "links": "http://arxiv.org/abs/2403.01346v1",
        "entry_id": "http://arxiv.org/abs/2403.01346v1",
        "pdf_url": "http://arxiv.org/pdf/2403.01346v1",
        "summary": "Active learning is a learning strategy whereby the machine learning algorithm\nactively identifies and labels data points to optimize its learning. This\nstrategy is particularly effective in domains where an abundance of unlabeled\ndata exists, but the cost of labeling these data points is prohibitively\nexpensive. In this paper, we consider cases of binary classification, where\nacquiring a positive instance incurs a significantly higher cost compared to\nthat of negative instances. For example, in the financial industry, such as in\nmoney-lending businesses, a defaulted loan constitutes a positive event leading\nto substantial financial loss. To address this issue, we propose a shifted\nnormal distribution sampling function that samples from a wider range than\ntypical uncertainty sampling. Our simulation underscores that our proposed\nsampling function limits both noisy and positive label selection, delivering\nbetween 20% and 32% improved cost efficiency over different test datasets.",
        "updated": "2024-03-02 23:53:24 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.01346v1"
    }
]