[
    {
        "title": "Summary Paper: Use Case on Building Collaborative Safe Autonomous Systems-A Robotdog for Guiding Visually Impaired People",
        "authors": "Aman MalhotraSelma Saidi",
        "links": "http://arxiv.org/abs/2403.01286v1",
        "entry_id": "http://arxiv.org/abs/2403.01286v1",
        "pdf_url": "http://arxiv.org/pdf/2403.01286v1",
        "summary": "This is a summary paper of a use case of a Robotdog dedicated to guide\nvisually impaired people in complex environment like a smart intersection. In\nsuch scenarios, the Robotdog has to autonomously decide whether it is safe to\ncross the intersection or not in order to further guide the human. We leverage\ndata sharing and collaboration between the Robotdog and other autonomous\nsystems operating in the same environment. We propose a system architecture for\nautonomous systems through a separation of a collaborative decision layer, to\nenable collective decision making processes, where data about the environment,\nrelevant to the Robotdog decision, together with evidences for trustworthiness\nabout other systems and the environment are shared.",
        "updated": "2024-03-02 18:59:03 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.01286v1"
    },
    {
        "title": "Optimal Integrated Task and Path Planning and Its Application to Multi-Robot Pickup and Delivery",
        "authors": "Aman AryanManan ModiIndranil SahaRupak MajumdarSwarup Mohalik",
        "links": "http://arxiv.org/abs/2403.01277v1",
        "entry_id": "http://arxiv.org/abs/2403.01277v1",
        "pdf_url": "http://arxiv.org/pdf/2403.01277v1",
        "summary": "We propose a generic multi-robot planning mechanism that combines an optimal\ntask planner and an optimal path planner to provide a scalable solution for\ncomplex multi-robot planning problems. The Integrated planner, through the\ninteraction of the task planner and the path planner, produces optimal\ncollision-free trajectories for the robots. We illustrate our general algorithm\non an object pick-and-drop planning problem in a warehouse scenario where a\ngroup of robots is entrusted with moving objects from one location to another\nin the workspace. We solve the task planning problem by reducing it into an\nSMT-solving problem and employing the highly advanced SMT solver Z3 to solve\nit. To generate collision-free movement of the robots, we extend the\nstate-of-the-art algorithm Conflict Based Search with Precedence Constraints\nwith several domain-specific constraints. We evaluate our integrated task and\npath planner extensively on various instances of the object pick-and-drop\nplanning problem and compare its performance with a state-of-the-art\nmulti-robot classical planner. Experimental results demonstrate that our\nplanning mechanism can deal with complex planning problems and outperforms a\nstate-of-the-art classical planner both in terms of computation time and the\nquality of the generated plan.",
        "updated": "2024-03-02 17:48:40 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.01277v1"
    },
    {
        "title": "Efficient Episodic Memory Utilization of Cooperative Multi-Agent Reinforcement Learning",
        "authors": "Hyungho NaYunkyeong SeoIl-chul Moon",
        "links": "http://arxiv.org/abs/2403.01112v1",
        "entry_id": "http://arxiv.org/abs/2403.01112v1",
        "pdf_url": "http://arxiv.org/pdf/2403.01112v1",
        "summary": "In cooperative multi-agent reinforcement learning (MARL), agents aim to\nachieve a common goal, such as defeating enemies or scoring a goal. Existing\nMARL algorithms are effective but still require significant learning time and\noften get trapped in local optima by complex tasks, subsequently failing to\ndiscover a goal-reaching policy. To address this, we introduce Efficient\nepisodic Memory Utilization (EMU) for MARL, with two primary objectives: (a)\naccelerating reinforcement learning by leveraging semantically coherent memory\nfrom an episodic buffer and (b) selectively promoting desirable transitions to\nprevent local convergence. To achieve (a), EMU incorporates a trainable\nencoder/decoder structure alongside MARL, creating coherent memory embeddings\nthat facilitate exploratory memory recall. To achieve (b), EMU introduces a\nnovel reward structure called episodic incentive based on the desirability of\nstates. This reward improves the TD target in Q-learning and acts as an\nadditional incentive for desirable transitions. We provide theoretical support\nfor the proposed incentive and demonstrate the effectiveness of EMU compared to\nconventional episodic control. The proposed method is evaluated in StarCraft II\nand Google Research Football, and empirical results indicate further\nperformance improvement over state-of-the-art methods.",
        "updated": "2024-03-02 07:37:05 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.01112v1"
    },
    {
        "title": "Composite Distributed Learning and Synchronization of Nonlinear Multi-Agent Systems with Complete Uncertain Dynamics",
        "authors": "Emadodin JandaghiDalton L. SteinAdam HoburgMingxi ZhouChengzhi Yuan",
        "links": "http://arxiv.org/abs/2403.00987v1",
        "entry_id": "http://arxiv.org/abs/2403.00987v1",
        "pdf_url": "http://arxiv.org/pdf/2403.00987v1",
        "summary": "This paper addresses the challenging problem of composite synchronization and\nlearning control in a network of multi-agent robotic manipulator systems\noperating under heterogeneous nonlinear uncertainties within a leader-follower\nframework. A novel two-layer distributed adaptive learning control strategy is\nintroduced, comprising a first-layer distributed cooperative estimator and a\nsecond-layer decentralized deterministic learning controller. The primary\nobjective of the first layer is to facilitate each robotic agent's estimation\nof the leader's information. The second layer is responsible for both enabling\nindividual robot agents to track desired reference trajectories and accurately\nidentifying and learning their nonlinear uncertain dynamics. The proposed\ndistributed learning control scheme represents an advancement in the existing\nliterature due to its ability to manage robotic agents with completely\nuncertain dynamics including uncertain mass matrices. This framework allows the\nrobotic control to be environment-independent which can be used in various\nsettings, from underwater to space where identifying system dynamics parameters\nis challenging. The stability and parameter convergence of the closed-loop\nsystem are rigorously analyzed using the Lyapunov method. Numerical simulations\nconducted on multi-agent robot manipulators validate the effectiveness of the\nproposed scheme. The identified nonlinear dynamics can be saved and reused\nwhenever the system restarts.",
        "updated": "2024-03-01 21:19:28 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.00987v1"
    },
    {
        "title": "Cost-Effective Activity Control of Asymptomatic Carriers in Layered Temporal Social Networks",
        "authors": "Masoumeh MoradianAresh DadlaniRasul KairgeldinAhmad Khonsari",
        "links": "http://arxiv.org/abs/2403.00725v1",
        "entry_id": "http://arxiv.org/abs/2403.00725v1",
        "pdf_url": "http://arxiv.org/pdf/2403.00725v1",
        "summary": "The robustness of human social networks against epidemic propagation relies\non the propensity for physical contact adaptation. During the early phase of\ninfection, asymptomatic carriers exhibit the same activity level as susceptible\nindividuals, which presents challenges for incorporating control measures in\nepidemic projection models. This paper focuses on modeling and cost-efficient\nactivity control of susceptible and carrier individuals in the context of the\nsusceptible-carrier-infected-removed (SCIR) epidemic model over a two-layer\ncontact network. In this model, individuals switch from a static contact layer\nto create new links in a temporal layer based on state-dependent activation\nrates. We derive conditions for the infection to die out or persist in a\nhomogeneous network. Considering the significant costs associated with reducing\nthe activity of susceptible and carrier individuals, we formulate an\noptimization problem to minimize the disease decay rate while constrained by a\nlimited budget. We propose the use of successive geometric programming (SGP)\napproximation for this optimization task. Through simulation experiments on\nPoisson random graphs, we assess the impact of different parameters on disease\nprevalence. The results demonstrate that our SGP framework achieves a cost\nreduction of nearly 33% compared to conventional methods based on degree and\ncloseness centrality.",
        "updated": "2024-03-01 18:21:20 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.00725v1"
    }
]