[
    {
        "title": "ParSEL: Parameterized Shape Editing with Language",
        "authors": "Aditya GaneshanRyan Y. HuangXianghao XuR. Kenny JonesDaniel Ritchie",
        "links": "http://arxiv.org/abs/2405.20319v1",
        "entry_id": "http://arxiv.org/abs/2405.20319v1",
        "pdf_url": "http://arxiv.org/pdf/2405.20319v1",
        "summary": "The ability to edit 3D assets from natural language presents a compelling\nparadigm to aid in the democratization of 3D content creation. However, while\nnatural language is often effective at communicating general intent, it is\npoorly suited for specifying precise manipulation. To address this gap, we\nintroduce ParSEL, a system that enables controllable editing of high-quality 3D\nassets from natural language. Given a segmented 3D mesh and an editing request,\nParSEL produces a parameterized editing program. Adjusting the program\nparameters allows users to explore shape variations with a precise control over\nthe magnitudes of edits. To infer editing programs which align with an input\nedit request, we leverage the abilities of large-language models (LLMs).\nHowever, while we find that LLMs excel at identifying initial edit operations,\nthey often fail to infer complete editing programs, and produce outputs that\nviolate shape semantics. To overcome this issue, we introduce Analytical Edit\nPropagation (AEP), an algorithm which extends a seed edit with additional\noperations until a complete editing program has been formed. Unlike prior\nmethods, AEP searches for analytical editing operations compatible with a range\nof possible user edits through the integration of computer algebra systems for\ngeometric analysis. Experimentally we demonstrate ParSEL's effectiveness in\nenabling controllable editing of 3D objects through natural language requests\nover alternative system designs.",
        "updated": "2024-05-30 17:55:46 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.20319v1"
    },
    {
        "title": "Conversational Agents to Facilitate Deliberation on Harmful Content in WhatsApp Groups",
        "authors": "Dhruv AgarwalFarhana ShahidAditya Vashistha",
        "links": "http://arxiv.org/abs/2405.20254v1",
        "entry_id": "http://arxiv.org/abs/2405.20254v1",
        "pdf_url": "http://arxiv.org/pdf/2405.20254v1",
        "summary": "WhatsApp groups have become a hotbed for the propagation of harmful content\nincluding misinformation, hate speech, polarizing content, and rumors,\nespecially in Global South countries. Given the platform's end-to-end\nencryption, moderation responsibilities lie on group admins and members, who\nrarely contest such content. Another approach is fact-checking, which is\nunscalable, and can only contest factual content (e.g., misinformation) but not\nsubjective content (e.g., hate speech). Drawing on recent literature, we\nexplore deliberation -- open and inclusive discussion -- as an alternative. We\ninvestigate the role of a conversational agent in facilitating deliberation on\nharmful content in WhatsApp groups. We conducted semi-structured interviews\nwith 21 Indian WhatsApp users, employing a design probe to showcase an example\nagent. Participants expressed the need for anonymity and recommended AI\nassistance to reduce the effort required in deliberation. They appreciated the\nagent's neutrality but pointed out the futility of deliberation in echo chamber\ngroups. Our findings highlight design tensions for such an agent, including\nprivacy versus group dynamics and freedom of speech in private spaces. We\ndiscuss the efficacy of deliberation using deliberative theory as a lens,\ncompare deliberation with moderation and fact-checking, and provide design\nrecommendations for future such systems. Ultimately, this work advances CSCW by\noffering insights into designing deliberative systems for combating harmful\ncontent in private group chats on social media.",
        "updated": "2024-05-30 17:07:07 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.20254v1"
    },
    {
        "title": "Using Large Language Models for Humanitarian Frontline Negotiation: Opportunities and Considerations",
        "authors": "Zilin Ma1 SusannahSuNathan ZhaoLinn BieskeBlake BullwinkelYanyi ZhangSophiaYangZiqing LuoSiyao LiGekai LiaoBoxiang WangJinglun GaoZihan WenClaude BruderleinWeiwei Pan",
        "links": "http://arxiv.org/abs/2405.20195v1",
        "entry_id": "http://arxiv.org/abs/2405.20195v1",
        "pdf_url": "http://arxiv.org/pdf/2405.20195v1",
        "summary": "Humanitarian negotiations in conflict zones, called \\emph{frontline\nnegotiation}, are often highly adversarial, complex, and high-risk. Several\nbest-practices have emerged over the years that help negotiators extract\ninsights from large datasets to navigate nuanced and rapidly evolving\nscenarios. Recent advances in large language models (LLMs) have sparked\ninterest in the potential for AI to aid decision making in frontline\nnegotiation. Through in-depth interviews with 13 experienced frontline\nnegotiators, we identified their needs for AI-assisted case analysis and\ncreativity support, as well as concerns surrounding confidentiality and model\nbias. We further explored the potential for AI augmentation of three standard\ntools used in frontline negotiation planning. We evaluated the quality and\nstability of our ChatGPT-based negotiation tools in the context of two real\ncases. Our findings highlight the potential for LLMs to enhance humanitarian\nnegotiations and underscore the need for careful ethical and practical\nconsiderations.",
        "updated": "2024-05-30 15:58:49 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.20195v1"
    },
    {
        "title": "Visual Attention Analysis in Online Learning",
        "authors": "Navarro MiriamBecerra ÁlvaroDaza RobertoCobos RuthMorales AythamiFierrez Julian",
        "links": "http://arxiv.org/abs/2405.20091v1",
        "entry_id": "http://arxiv.org/abs/2405.20091v1",
        "pdf_url": "http://arxiv.org/pdf/2405.20091v1",
        "summary": "In this paper, we present an approach in the Multimodal Learning Analytics\nfield. Within this approach, we have developed a tool to visualize and analyze\neye movement data collected during learning sessions in online courses. The\ntool is named VAAD (an acronym for Visual Attention Analysis Dashboard). These\neye movement data have been gathered using an eye-tracker and subsequently\nprocessed and visualized for interpretation. The purpose of the tool is to\nconduct a descriptive analysis of the data by facilitating its visualization,\nenabling the identification of differences and learning patterns among various\nlearner populations. Additionally, it integrates a predictive module capable of\nanticipating learner activities during a learning session. Consequently, VAAD\nholds the potential to offer valuable insights into online learning behaviors\nfrom both descriptive and predictive perspectives.",
        "updated": "2024-05-30 14:27:40 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.20091v1"
    },
    {
        "title": "PixelsDB: Serverless and Natural-Language-Aided Data Analytics with Flexible Service Levels and Prices",
        "authors": "Haoqiong BianDongyang GengHaoyang LiAnastasia Ailamaki",
        "links": "http://arxiv.org/abs/2405.19784v1",
        "entry_id": "http://arxiv.org/abs/2405.19784v1",
        "pdf_url": "http://arxiv.org/pdf/2405.19784v1",
        "summary": "Serverless query processing has become increasingly popular due to its\nadvantages, including automated hardware and software management, high\nelasticity, and pay-as-you-go pricing. For users who are not system experts,\nserverless query processing greatly reduces the cost of owning a data analytic\nsystem. However, it is still a significant challenge for non-expert users to\ntransform their complex and evolving data analytic needs into proper SQL\nqueries and select a serverless query engine that delivers satisfactory\nperformance and price for each type of query.\n  This paper presents PixelsDB, an open-source data analytic system that allows\nusers who lack system or SQL expertise to explore data efficiently. It allows\nusers to generate and debug SQL queries using a natural language interface\npowered by fine-tuned language models. The queries are then executed by a\nserverless query engine that offers varying prices for different service levels\non query urgency. The service levels are natively supported by dedicated\narchitecture design and heterogeneous resource scheduling that can apply\ncost-efficient resources to process non-urgent queries. We envision that the\ncombination of a serverless paradigm, a natural-language-aided interface, and\nflexible service levels and prices will substantially improve the user\nexperience in data analysis.",
        "updated": "2024-05-30 07:48:43 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.19784v1"
    }
]