[
    {
        "title": "STROOBnet Optimization via GPU-Accelerated Proximal Recurrence Strategies",
        "authors": "Ted Edward HolmbergMahdi AbdelguerfiElias Ioup",
        "links": "http://dx.doi.org/10.1109/BigData59044.2023.10386774",
        "entry_id": "http://arxiv.org/abs/2404.14388v1",
        "pdf_url": "http://arxiv.org/pdf/2404.14388v1",
        "summary": "Spatiotemporal networks' observational capabilities are crucial for accurate\ndata gathering and informed decisions across multiple sectors. This study\nfocuses on the Spatiotemporal Ranged Observer-Observable Bipartite Network\n(STROOBnet), linking observational nodes (e.g., surveillance cameras) to events\nwithin defined geographical regions, enabling efficient monitoring. Using data\nfrom Real-Time Crime Camera (RTCC) systems and Calls for Service (CFS) in New\nOrleans, where RTCC combats rising crime amidst reduced police presence, we\naddress the network's initial observational imbalances. Aiming for uniform\nobservational efficacy, we propose the Proximal Recurrence approach. It\noutperformed traditional clustering methods like k-means and DBSCAN by offering\nholistic event frequency and spatial consideration, enhancing observational\ncoverage.",
        "updated": "2024-04-22 17:46:29 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.14388v1"
    },
    {
        "title": "A Stochastic Geo-spatiotemporal Bipartite Network to Optimize GCOOS Sensor Placement Strategies",
        "authors": "Ted Edward HolmbergElias IoupMahdi Abdelguerfi",
        "links": "http://dx.doi.org/10.1109/BigData55660.2022.10020928",
        "entry_id": "http://arxiv.org/abs/2404.14357v1",
        "pdf_url": "http://arxiv.org/pdf/2404.14357v1",
        "summary": "This paper proposes two new measures applicable in a spatial bipartite\nnetwork model: coverage and coverage robustness. The bipartite network must\nconsist of observer nodes, observable nodes, and edges that connect observer\nnodes to observable nodes. The coverage and coverage robustness scores evaluate\nthe effectiveness of the observer node placements. This measure is beneficial\nfor stochastic data as it may be coupled with Monte Carlo simulations to\nidentify optimal placements for new observer nodes. In this paper, we construct\na Geo-SpatioTemporal Bipartite Network (GSTBN) within the stochastic and\ndynamical environment of the Gulf of Mexico. This GSTBN consists of GCOOS\nsensor nodes and HYCOM Region of Interest (RoI) event nodes. The goal is to\nidentify optimal placements to expand GCOOS to improve the forecasting outcomes\nby the HYCOM ocean prediction model.",
        "updated": "2024-04-22 17:12:06 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.14357v1"
    },
    {
        "title": "Liquid-Graph Time-Constant Network for Multi-Agent Systems Control",
        "authors": "Antonio MarinoClaudio PacchierottiPaolo Robuffo Giordano",
        "links": "http://arxiv.org/abs/2404.13982v1",
        "entry_id": "http://arxiv.org/abs/2404.13982v1",
        "pdf_url": "http://arxiv.org/pdf/2404.13982v1",
        "summary": "In this paper, we propose the Liquid-Graph Time-constant (LGTC) network, a\ncontinuous graph neural network(GNN) model for control of multi-agent systems\nbased on therecent Liquid Time Constant (LTC) network. We analyse itsstability\nleveraging contraction analysis and propose a closed-form model that preserves\nthe model contraction rate and doesnot require solving an ODE at each\niteration. Compared todiscrete models like Graph Gated Neural Networks\n(GGNNs),the higher expressivity of the proposed model guaranteesremarkable\nperformance while reducing the large amountof communicated variables normally\nrequired by GNNs. Weevaluate our model on a distributed multi-agent control\ncasestudy (flocking) taking into account variable communicationrange and\nscalability under non-instantaneous communication",
        "updated": "2024-04-22 08:44:07 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.13982v1"
    },
    {
        "title": "A survey of air combat behavior modeling using machine learning",
        "authors": "Patrick Ribu GortonAndreas StrandKarsten Brathen",
        "links": "http://arxiv.org/abs/2404.13954v1",
        "entry_id": "http://arxiv.org/abs/2404.13954v1",
        "pdf_url": "http://arxiv.org/pdf/2404.13954v1",
        "summary": "With the recent advances in machine learning, creating agents that behave\nrealistically in simulated air combat has become a growing field of interest.\nThis survey explores the application of machine learning techniques for\nmodeling air combat behavior, motivated by the potential to enhance\nsimulation-based pilot training. Current simulated entities tend to lack\nrealistic behavior, and traditional behavior modeling is labor-intensive and\nprone to loss of essential domain knowledge between development steps.\nAdvancements in reinforcement learning and imitation learning algorithms have\ndemonstrated that agents may learn complex behavior from data, which could be\nfaster and more scalable than manual methods. Yet, making adaptive agents\ncapable of performing tactical maneuvers and operating weapons and sensors\nstill poses a significant challenge. The survey examines applications, behavior\nmodel types, prevalent machine learning methods, and the technical and human\nchallenges in developing adaptive and realistically behaving agents. Another\nchallenge is the transfer of agents from learning environments to military\nsimulation systems and the consequent demand for standardization. Four primary\nrecommendations are presented regarding increased emphasis on\nbeyond-visual-range scenarios, multi-agent machine learning and cooperation,\nutilization of hierarchical behavior models, and initiatives for\nstandardization and research collaboration. These recommendations aim to\naddress current issues and guide the development of more comprehensive,\nadaptable, and realistic machine learning-based behavior models for air combat\napplications.",
        "updated": "2024-04-22 07:54:56 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.13954v1"
    },
    {
        "title": "Rate Analysis of Coupled Distributed Stochastic Approximation for Misspecified Optimization",
        "authors": "Yaqun YangJinlong Lei",
        "links": "http://arxiv.org/abs/2404.13669v1",
        "entry_id": "http://arxiv.org/abs/2404.13669v1",
        "pdf_url": "http://arxiv.org/pdf/2404.13669v1",
        "summary": "We consider an $n$ agents distributed optimization problem with imperfect\ninformation characterized in a parametric sense, where the unknown parameter\ncan be solved by a distinct distributed parameter learning problem. Though each\nagent only has access to its local parameter learning and computational\nproblem, they mean to collaboratively minimize the average of their local cost\nfunctions. To address the special optimization problem, we propose a coupled\ndistributed stochastic approximation algorithm, in which every agent updates\nthe current beliefs of its unknown parameter and decision variable by\nstochastic approximation method; and then averages the beliefs and decision\nvariables of its neighbors over network in consensus protocol. Our interest\nlies in the convergence analysis of this algorithm. We quantitatively\ncharacterize the factors that affect the algorithm performance, and prove that\nthe mean-squared error of the decision variable is bounded by\n$\\mathcal{O}(\\frac{1}{nk})+\\mathcal{O}\\left(\\frac{1}{\\sqrt{n}(1-\\rho_w)}\\right)\\frac{1}{k^{1.5}}+\\mathcal{O}\\big(\\frac{1}{(1-\\rho_w)^2}\n\\big)\\frac{1}{k^2}$, where $k$ is the iteration count and $(1-\\rho_w)$ is the\nspectral gap of the network weighted adjacency matrix. It reveals that the\nnetwork connectivity characterized by $(1-\\rho_w)$ only influences the high\norder of convergence rate, while the domain rate still acts the same as the\ncentralized algorithm. In addition, we analyze that the transient iteration\nneeded for reaching its dominant rate $\\mathcal{O}(\\frac{1}{nk})$ is\n$\\mathcal{O}(\\frac{n}{(1-\\rho_w)^2})$. Numerical experiments are carried out to\ndemonstrate the theoretical results by taking different CPUs as agents, which\nis more applicable to real-world distributed scenarios.",
        "updated": "2024-04-21 14:18:49 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.13669v1"
    }
]