[
    {
        "title": "Collaborative Interactive Evolution of Art in the Latent Space of Deep Generative Models",
        "authors": "Ole HallAnil Yaman",
        "links": "http://arxiv.org/abs/2403.19620v1",
        "entry_id": "http://arxiv.org/abs/2403.19620v1",
        "pdf_url": "http://arxiv.org/pdf/2403.19620v1",
        "summary": "Generative Adversarial Networks (GANs) have shown great success in generating\nhigh quality images and are thus used as one of the main approaches to generate\nart images. However, usually the image generation process involves sampling\nfrom the latent space of the learned art representations, allowing little\ncontrol over the output. In this work, we first employ GANs that are trained to\nproduce creative images using an architecture known as Creative Adversarial\nNetworks (CANs), then, we employ an evolutionary approach to navigate within\nthe latent space of the models to discover images. We use automatic aesthetic\nand collaborative interactive human evaluation metrics to assess the generated\nimages. In the human interactive evaluation case, we propose a collaborative\nevaluation based on the assessments of several participants. Furthermore, we\nalso experiment with an intelligent mutation operator that aims to improve the\nquality of the images through local search based on an aesthetic measure. We\nevaluate the effectiveness of this approach by comparing the results produced\nby the automatic and collaborative interactive evolution. The results show that\nthe proposed approach can generate highly attractive art images when the\nevolution is guided by collaborative human feedback.",
        "updated": "2024-03-28 17:40:15 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.19620v1"
    },
    {
        "title": "Exploring Communication Dynamics: Eye-tracking Analysis in Pair Programming of Computer Science Education",
        "authors": "Wunmin JangHong GaoTilman MichaeliEnkelejda Kasneci",
        "links": "http://dx.doi.org/10.1145/3649902.3653942",
        "entry_id": "http://arxiv.org/abs/2403.19560v1",
        "pdf_url": "http://arxiv.org/pdf/2403.19560v1",
        "summary": "Pair programming is widely recognized as an effective educational tool in\ncomputer science that promotes collaborative learning and mirrors real-world\nwork dynamics. However, communication breakdowns within pairs significantly\nchallenge this learning process. In this study, we use eye-tracking data\nrecorded during pair programming sessions to study communication dynamics\nbetween various pair programming roles across different student, expert, and\nmixed group cohorts containing 19 participants. By combining eye-tracking data\nanalysis with focus group interviews and questionnaires, we provide insights\ninto communication's multifaceted nature in pair programming. Our findings\nhighlight distinct eye-tracking patterns indicating changes in communication\nskills across group compositions, with participants prioritizing code\nexploration over communication, especially during challenging tasks. Further,\nstudents showed a preference for pairing with experts, emphasizing the\nimportance of understanding group formation in pair programming scenarios.\nThese insights emphasize the importance of understanding group dynamics and\nenhancing communication skills through pair programming for successful outcomes\nin computer science education.",
        "updated": "2024-03-28 16:44:20 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.19560v1"
    },
    {
        "title": "LLMs as Academic Reading Companions: Extending HCI Through Synthetic Personae",
        "authors": "Celia ChenAlex Leitch",
        "links": "http://arxiv.org/abs/2403.19506v1",
        "entry_id": "http://arxiv.org/abs/2403.19506v1",
        "pdf_url": "http://arxiv.org/pdf/2403.19506v1",
        "summary": "This position paper argues that large language models (LLMs) constitute\npromising yet underutilized academic reading companions capable of enhancing\nlearning. We detail an exploratory study examining Claude.ai from Anthropic, an\nLLM-based interactive assistant that helps students comprehend complex\nqualitative literature content. The study compares quantitative survey data and\nqualitative interviews assessing outcomes between a control group and an\nexperimental group leveraging Claude.ai over a semester across two graduate\ncourses. Initial findings demonstrate tangible improvements in reading\ncomprehension and engagement among participants using the AI agent versus\nunsupported independent study. However, there is potential for overreliance and\nethical considerations that warrant continued investigation. By documenting an\nearly integration of an LLM reading companion into an educational context, this\nwork contributes pragmatic insights to guide development of synthetic personae\nsupporting learning. Broader impacts compel policy and industry actions to\nuphold responsible design in order to maximize benefits of AI integration while\nprioritizing student wellbeing.",
        "updated": "2024-03-28 15:37:10 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.19506v1"
    },
    {
        "title": "A theoretical framework for the design and analysis of computational thinking problems in education",
        "authors": "Giorgia AdorniAlberto PiattiEngin BumbacherLucio NegriniFrancesco MondadaDorit AssafFrancesca MangiliLuca Gambardella",
        "links": "http://arxiv.org/abs/2403.19475v1",
        "entry_id": "http://arxiv.org/abs/2403.19475v1",
        "pdf_url": "http://arxiv.org/pdf/2403.19475v1",
        "summary": "The field of computational thinking education has grown in recent years as\nresearchers and educators have sought to develop and assess students'\ncomputational thinking abilities. While much of the research in this area has\nfocused on defining computational thinking, the competencies it involves and\nhow to assess them in teaching and learning contexts, this work takes a\ndifferent approach. We provide a more situated perspective on computational\nthinking, focusing on the types of problems that require computational thinking\nskills to be solved and the features that support these processes. We develop a\nframework for analysing existing computational thinking problems in an\neducational context. We conduct a comprehensive literature review to identify\nprototypical activities from areas where computational thinking is typically\npursued in education. We identify the main components and characteristics of\nthese activities, along with their influence on activating computational\nthinking competencies. The framework provides a catalogue of computational\nthinking skills that can be used to understand the relationship between problem\nfeatures and competencies activated. This study contributes to the field of\ncomputational thinking education by offering a tool for evaluating and revising\nexisting problems to activate specific skills and for assisting in designing\nnew problems that target the development of particular competencies. The\nresults of this study may be of interest to researchers and educators working\nin computational thinking education.",
        "updated": "2024-03-28 15:02:28 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.19475v1"
    },
    {
        "title": "\"At the end of the day, I am accountable\": Gig Workers' Self-Tracking for Multi-Dimensional Accountability Management",
        "authors": "Rie HeleneHernandezQiurong SongYubo KouXinning Gui",
        "links": "http://arxiv.org/abs/2403.19436v1",
        "entry_id": "http://arxiv.org/abs/2403.19436v1",
        "pdf_url": "http://arxiv.org/pdf/2403.19436v1",
        "summary": "Tracking is inherent in and central to the gig economy. Platforms track gig\nworkers' performance through metrics such as acceptance rate and punctuality,\nwhile gig workers themselves engage in self-tracking. Although prior research\nhas extensively examined how gig platforms track workers through metrics --\nwith some studies briefly acknowledging the phenomenon of self-tracking among\nworkers -- there is a dearth of studies that explore how and why gig workers\ntrack themselves. To address this, we conducted 25 semi-structured interviews,\nrevealing how gig workers self-tracking to manage accountabilities to\nthemselves and external entities across three identities: the holistic self,\nthe entrepreneurial self, and the platformized self. We connect our findings to\nneoliberalism, through which we contextualize gig workers' self-accountability\nand the invisible labor of self-tracking. We further discuss how self-tracking\nmitigates information and power asymmetries in gig work and offer design\nimplications to support gig workers' multi-dimensional self-tracking.",
        "updated": "2024-03-28 14:04:30 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.19436v1"
    }
]