[
    {
        "title": "Human-compatible driving partners through data-regularized self-play reinforcement learning",
        "authors": "Daphne CornelisseEugene Vinitsky",
        "links": "http://arxiv.org/abs/2403.19648v1",
        "entry_id": "http://arxiv.org/abs/2403.19648v1",
        "pdf_url": "http://arxiv.org/pdf/2403.19648v1",
        "summary": "A central challenge for autonomous vehicles is coordinating with humans.\nTherefore, incorporating realistic human agents is essential for scalable\ntraining and evaluation of autonomous driving systems in simulation. Simulation\nagents are typically developed by imitating large-scale, high-quality datasets\nof human driving. However, pure imitation learning agents empirically have high\ncollision rates when executed in a multi-agent closed-loop setting. To build\nagents that are realistic and effective in closed-loop settings, we propose\nHuman-Regularized PPO (HR-PPO), a multi-agent algorithm where agents are\ntrained through self-play with a small penalty for deviating from a human\nreference policy. In contrast to prior work, our approach is RL-first and only\nuses 30 minutes of imperfect human demonstrations. We evaluate agents in a\nlarge set of multi-agent traffic scenes. Results show our HR-PPO agents are\nhighly effective in achieving goals, with a success rate of 93%, an off-road\nrate of 3.5%, and a collision rate of 3%. At the same time, the agents drive in\na human-like manner, as measured by their similarity to existing human driving\nlogs. We also find that HR-PPO agents show considerable improvements on proxy\nmeasures for coordination with human driving, particularly in highly\ninteractive scenarios. We open-source our code and trained agents at\nhttps://github.com/Emerge-Lab/nocturne_lab and provide demonstrations of agent\nbehaviors at https://sites.google.com/view/driving-partners.",
        "updated": "2024-03-28 17:56:56 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.19648v1"
    },
    {
        "title": "Multi-Agent Team Access Monitoring: Environments that Benefit from Target Information Sharing",
        "authors": "Andrew DudashScott JamesRyan Rubel",
        "links": "http://arxiv.org/abs/2403.19375v1",
        "entry_id": "http://arxiv.org/abs/2403.19375v1",
        "pdf_url": "http://arxiv.org/pdf/2403.19375v1",
        "summary": "Robotic access monitoring of multiple target areas has applications including\ncheckpoint enforcement, surveillance and containment of fire and flood hazards.\nMonitoring access for a single target region has been successfully modeled as a\nminimum-cut problem. We generalize this model to support multiple target areas\nusing two approaches: iterating on individual targets and examining the\ncollections of targets holistically. Through simulation we measure the\nperformance of each approach on different scenarios.",
        "updated": "2024-03-28 12:37:11 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.19375v1"
    },
    {
        "title": "Inferring Latent Temporal Sparse Coordination Graph for Multi-Agent Reinforcement Learning",
        "authors": "Wei DuanJie LuJunyu Xuan",
        "links": "http://arxiv.org/abs/2403.19253v1",
        "entry_id": "http://arxiv.org/abs/2403.19253v1",
        "pdf_url": "http://arxiv.org/pdf/2403.19253v1",
        "summary": "Effective agent coordination is crucial in cooperative Multi-Agent\nReinforcement Learning (MARL). While agent cooperation can be represented by\ngraph structures, prevailing graph learning methods in MARL are limited. They\nrely solely on one-step observations, neglecting crucial historical\nexperiences, leading to deficient graphs that foster redundant or detrimental\ninformation exchanges. Additionally, high computational demands for action-pair\ncalculations in dense graphs impede scalability. To address these challenges,\nwe propose inferring a Latent Temporal Sparse Coordination Graph (LTS-CG) for\nMARL. The LTS-CG leverages agents' historical observations to calculate an\nagent-pair probability matrix, where a sparse graph is sampled from and used\nfor knowledge exchange between agents, thereby simultaneously capturing agent\ndependencies and relation uncertainty. The computational complexity of this\nprocedure is only related to the number of agents. This graph learning process\nis further augmented by two innovative characteristics: Predict-Future, which\nenables agents to foresee upcoming observations, and Infer-Present, ensuring a\nthorough grasp of the environmental context from limited data. These features\nallow LTS-CG to construct temporal graphs from historical and real-time\ninformation, promoting knowledge exchange during policy learning and effective\ncollaboration. Graph learning and agent training occur simultaneously in an\nend-to-end manner. Our demonstrated results on the StarCraft II benchmark\nunderscore LTS-CG's superior performance.",
        "updated": "2024-03-28 09:20:15 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.19253v1"
    },
    {
        "title": "Robustness and Visual Explanation for Black Box Image, Video, and ECG Signal Classification with Reinforcement Learning",
        "authors": "Soumyendu SarkarAshwin Ramesh BabuSajad MousaviVineet GundechaAvisek NaugSahand Ghorbanpour",
        "links": "http://dx.doi.org/10.1609/aaai.v38i21.30579",
        "entry_id": "http://arxiv.org/abs/2403.18985v1",
        "pdf_url": "http://arxiv.org/pdf/2403.18985v1",
        "summary": "We present a generic Reinforcement Learning (RL) framework optimized for\ncrafting adversarial attacks on different model types spanning from ECG signal\nanalysis (1D), image classification (2D), and video classification (3D). The\nframework focuses on identifying sensitive regions and inducing\nmisclassifications with minimal distortions and various distortion types. The\nnovel RL method outperforms state-of-the-art methods for all three\napplications, proving its efficiency. Our RL approach produces superior\nlocalization masks, enhancing interpretability for image classification and ECG\nanalysis models. For applications such as ECG analysis, our platform highlights\ncritical ECG segments for clinicians while ensuring resilience against\nprevalent distortions. This comprehensive tool aims to bolster both resilience\nwith adversarial training and transparency across varied applications and data\ntypes.",
        "updated": "2024-03-27 20:07:39 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.18985v1"
    },
    {
        "title": "Safety Verification of Wait-Only Non-Blocking Broadcast Protocols",
        "authors": "Lucie GuillouArnaud SangnierNathalie Sznajder",
        "links": "http://arxiv.org/abs/2403.18591v1",
        "entry_id": "http://arxiv.org/abs/2403.18591v1",
        "pdf_url": "http://arxiv.org/pdf/2403.18591v1",
        "summary": "We study networks of processes that all execute the same finite protocol and\ncommunicate synchronously in two different ways: a process can broadcast one\nmessage to all other processes or send it to at most one other process. In both\ncases, if no process can receive the message, it will still be sent. We\nestablish a precise complexity class for two coverability problems with a\nparameterised number of processes: the state coverability problem and the\nconfiguration coverability problem. It is already known that these problems are\nAckermann-hard (but decidable) in the general case. We show that when the\nprotocol is Wait-Only, i.e., it has no state from which a process can send and\nreceive messages, the complexity drops to P and PSPACE, respectively.",
        "updated": "2024-03-27 14:17:33 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.18591v1"
    }
]