[
    {
        "title": "Anti-Heroes: An Ethics-focused Method for Responsible Designer Intentions",
        "authors": "Shikha MehtaShruthi Sai ChivukulaColin M. GrayRitika Gairola",
        "links": "http://arxiv.org/abs/2405.03674v1",
        "entry_id": "http://arxiv.org/abs/2405.03674v1",
        "pdf_url": "http://arxiv.org/pdf/2405.03674v1",
        "summary": "HCI and design researchers have designed, adopted, and customized a range of\nethics-focused methods to inscribe values and support ethical decision making\nin a design process. In this work-in-progress, we add to this body of\nresources, constructing a method that surfaces the designer's intentions in an\naction-focused way, encouraging consideration of both manipulative and\nvalue-centered roles. Anti-Heroes is a card deck that allows a designer to\nplayfully take on pairs of manipulative (Anti-Hero) and value-centered (Hero)\nroles during design ideation/conceptualization, evaluation, and ethical\ndialogue. The card deck includes twelve cards with Anti-Hero and Hero faces,\nalong with three action cards that include reflective questions for different\nplay modes. Alongside the creation of the Anti-Hero card deck, we describe the\nevaluation and iteration of the card deck through playtesting sessions with\nfour groups of three design students. We propose implications of Anti-Heros for\ntechnology and design education and practice.",
        "updated": "2024-05-06 17:49:32 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.03674v1"
    },
    {
        "title": "The Sociotechnical Stack: Opportunities for Social Computing Research in Non-consensual Intimate Media",
        "authors": "Li QiweiAllison McDonaldOliver L. HaimsonSarita SchoenebeckEric Gilbert",
        "links": "http://arxiv.org/abs/2405.03585v1",
        "entry_id": "http://arxiv.org/abs/2405.03585v1",
        "pdf_url": "http://arxiv.org/pdf/2405.03585v1",
        "summary": "Non-consensual intimate media (NCIM) involves sharing intimate content\nwithout the depicted person's consent, including \"revenge porn\" and sexually\nexplicit deepfakes. While NCIM has received attention in legal, psychological,\nand communication fields over the past decade, it is not sufficiently addressed\nin computing scholarship. This paper addresses this gap by linking NCIM harms\nto the specific technological components that facilitate them. We introduce the\nsociotechnical stack, a conceptual framework designed to map the technical\nstack to its corresponding social impacts. The sociotechnical stack allows us\nto analyze sociotechnical problems like NCIM, and points toward opportunities\nfor computing research. We propose a research roadmap for computing and social\ncomputing communities to deter NCIM perpetration and support victim-survivors\nthrough building and rebuilding technologies.",
        "updated": "2024-05-06 15:58:03 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.03585v1"
    },
    {
        "title": "Spin-Wave Voices: Sonification of Nanoscale Spin Waves as an Engagement and Research Tool",
        "authors": "Santa PileOleg LesotaSilvan David PeterChristina HumerMartin Gasser",
        "links": "http://arxiv.org/abs/2405.03506v1",
        "entry_id": "http://arxiv.org/abs/2405.03506v1",
        "pdf_url": "http://arxiv.org/pdf/2405.03506v1",
        "summary": "Magnonics is an emerging research field that addresses the use of spin waves\n(magnons), purely magnetic waves, for information transport and processing.\nSpin waves are a potential replacement for electric current in modern\ncomputational devices that would make them more compact and energy efficient.\nThe field is yet little known, even among physicists. Additionally, with the\ndevelopment of new measuring techniques and computational physics, the obtained\nmagnetic data becomes more complex, in some cases including 3D vector fields\nand time-resolution. This work presents an approach to the audio-visual\nrepresentation of the spin waves and discusses its use as a tool for science\ncommunication exhibits and possible data analysis tool. The work also details\nan instance of such an exhibit presented at the annual international digital\nart exhibition Ars Electronica Festival in 2022.",
        "updated": "2024-05-06 14:20:42 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.03506v1"
    },
    {
        "title": "Behavioral analysis in immersive learning environments: A systematic literature review and research agenda",
        "authors": "Yu LiuKang YueYue Liu",
        "links": "http://arxiv.org/abs/2405.03442v1",
        "entry_id": "http://arxiv.org/abs/2405.03442v1",
        "pdf_url": "http://arxiv.org/pdf/2405.03442v1",
        "summary": "The rapid growth of immersive technologies in educational areas has increased\nresearch interest in analyzing the specific behavioral patterns of learners in\nimmersive learning environments. Considering the fact that research on the\ntechnical affordances of immersive technologies and the pedagogical affordances\nof behavioral analysis remains fragmented, this study first contributes by\ndeveloping a conceptual framework that amalgamates learning requirements,\nspecification, evaluation, and iteration into an integrated model to identify\nlearning benefits and potential hurdles of behavioral analysis in immersive\nlearning environments. Then, a systematic review was conducted underpinning the\nproposed conceptual framework to retrieve valuable empirical evidence from the\n40 eligible articles during the last decade. The review findings suggest that\n(1) there is an essential need to sufficiently prepare the salient pedagogical\nrequirements to define the specific learning stage, envisage intended cognitive\nobjectives, and specify an appropriate set of learning activities, when\ndeveloping comprehensive plans on behavioral analysis in immersive learning\nenvironments. (2) Researchers could customize the unique immersive experimental\nimplementation by considering factors from four dimensions: learner, pedagogy,\ncontext, and representation. (3) The behavioral patterns constructed in\nimmersive learning environments vary by considering the influence of behavioral\nanalysis techniques, research themes, and immersive technical features. (4) The\nuse of behavioral analysis in immersive learning environments faces several\nchallenges from technical, implementation, and data processing perspectives.\nThis study also articulates critical research agenda that could drive future\ninvestigation on behavioral analysis in immersive learning environments.",
        "updated": "2024-05-06 13:14:28 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.03442v1"
    },
    {
        "title": "Telextiles: End-to-end Remote Transmission of Fabric Tactile Sensation",
        "authors": "Takekazu KitagishiYuichi HiroiYuna WatanabeYuta ItohJun Rekimoto",
        "links": "http://dx.doi.org/10.1145/3586183.3606764",
        "entry_id": "http://arxiv.org/abs/2405.03363v1",
        "pdf_url": "http://arxiv.org/pdf/2405.03363v1",
        "summary": "The tactile sensation of textiles is critical in determining the comfort of\nclothing. For remote use, such as online shopping, users cannot physically\ntouch the textile of clothes, making it difficult to evaluate its tactile\nsensation. Tactile sensing and actuation devices are required to transmit the\ntactile sensation of textiles. The sensing device needs to recognize different\ngarments, even with hand-held sensors. In addition, the existing actuation\ndevice can only present a limited number of known patterns and cannot transmit\nunknown tactile sensations of textiles. To address these issues, we propose\nTelextiles, an interface that can remotely transmit tactile sensations of\ntextiles by creating a latent space that reflects the proximity of textiles\nthrough contrastive self-supervised learning. We confirm that textiles with\nsimilar tactile features are located close to each other in the latent space\nthrough a two-dimensional plot. We then compress the latent features for known\ntextile samples into the 1D distance and apply the 16 textile samples to the\nrollers in the order of the distance. The roller is rotated to select the\ntextile with the closest feature if an unknown textile is detected.",
        "updated": "2024-05-06 11:13:50 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.03363v1"
    }
]