[
    {
        "title": "A survey to measure cognitive biases influencing mobility choices",
        "authors": "Carole Adam",
        "links": "http://arxiv.org/abs/2405.03250v1",
        "entry_id": "http://arxiv.org/abs/2405.03250v1",
        "pdf_url": "http://arxiv.org/pdf/2405.03250v1",
        "summary": "In this paper, we describe a survey about the perceptions of 4 mobility modes\n(car, bus, bicycle, walking) and the preferences of users for 6 modal choice\nfactors. This survey has gathered 650 answers in 2023, that are published as\nopen data. In this study, we analyse these results to highlight the influence\nof 3 cognitive biases on mobility decisions: halo bias, choice-supportive bias,\nand reactance. These cognitive biases are proposed as plausible explanations of\nthe observed behaviour, where the population tends to stick to individual cars\ndespite urban policies aiming at favouring soft mobility. This model can serve\nas the basis for a simulator of mobility decisions in a virtual town, and the\ngathered data can be used to initialise this population with realistic\nattributes. Work is ongoing to design a simulation-based serious game where the\nplayer takes the role of an urban manager faced with planning choices to make\ntheir city more sustainable.",
        "updated": "2024-05-06 08:12:13 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.03250v1"
    },
    {
        "title": "A Multi-Agent Rollout Approach for Highway Bottleneck Decongenston in Mixed Autonomy",
        "authors": "Lu LiuMaonan WangMan-On PunXi Xiong",
        "links": "http://arxiv.org/abs/2405.03132v1",
        "entry_id": "http://arxiv.org/abs/2405.03132v1",
        "pdf_url": "http://arxiv.org/pdf/2405.03132v1",
        "summary": "The integration of autonomous vehicles (AVs) into the existing transportation\ninfrastructure offers a promising solution to alleviate congestion and enhance\nmobility. This research explores a novel approach to traffic optimization by\nemploying a multi-agent rollout approach within a mixed autonomy environment.\nThe study concentrates on coordinating the speed of human-driven vehicles by\nlongitudinally controlling AVs, aiming to dynamically optimize traffic flow and\nalleviate congestion at highway bottlenecks in real-time. We model the problem\nas a decentralized partially observable Markov decision process (Dec-POMDP) and\npropose an improved multi-agent rollout algorithm. By employing agent-by-agent\npolicy iterations, our approach implicitly considers cooperation among multiple\nagents and seamlessly adapts to complex scenarios where the number of agents\ndynamically varies. Validated in a real-world network with varying AV\npenetration rates and traffic flow, the simulations demonstrate that the\nmulti-agent rollout algorithm significantly enhances performance, reducing\naverage travel time on bottleneck segments by 9.42% with a 10% AV penetration\nrate.",
        "updated": "2024-05-06 03:06:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.03132v1"
    },
    {
        "title": "Traffic Performance GPT (TP-GPT): Real-Time Data Informed Intelligent ChatBot for Transportation Surveillance and Management",
        "authors": "Bingzhang WangZhiyuCaiMuhammad Monjurul KarimChenxi LiuYinhai Wang",
        "links": "http://arxiv.org/abs/2405.03076v1",
        "entry_id": "http://arxiv.org/abs/2405.03076v1",
        "pdf_url": "http://arxiv.org/pdf/2405.03076v1",
        "summary": "The digitization of traffic sensing infrastructure has significantly\naccumulated an extensive traffic data warehouse, which presents unprecedented\nchallenges for transportation analytics. The complexities associated with\nquerying large-scale multi-table databases require specialized programming\nexpertise and labor-intensive development. Additionally, traditional analysis\nmethods have focused mainly on numerical data, often neglecting the semantic\naspects that could enhance interpretability and understanding. Furthermore,\nreal-time traffic data access is typically limited due to privacy concerns. To\nbridge this gap, the integration of Large Language Models (LLMs) into the\ndomain of traffic management presents a transformative approach to addressing\nthe complexities and challenges inherent in modern transportation systems. This\npaper proposes an intelligent online chatbot, TP-GPT, for efficient customized\ntransportation surveillance and management empowered by a large real-time\ntraffic database. The innovative framework leverages contextual and generative\nintelligence of language models to generate accurate SQL queries and natural\nlanguage interpretations by employing transportation-specialized prompts,\nChain-of-Thought prompting, few-shot learning, multi-agent collaboration\nstrategy, and chat memory. Experimental study demonstrates that our approach\noutperforms state-of-the-art baselines such as GPT-4 and PaLM 2 on a\nchallenging traffic-analysis benchmark TransQuery. TP-GPT would aid researchers\nand practitioners in real-time transportation surveillance and management in a\nprivacy-preserving, equitable, and customizable manner.",
        "updated": "2024-05-05 22:54:51 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.03076v1"
    },
    {
        "title": "Self-Organized Construction by Minimal Surprise",
        "authors": "Tanja Katharina KaiserHeiko Hamann",
        "links": "http://dx.doi.org/10.1109/FAS-W.2019.00057",
        "entry_id": "http://arxiv.org/abs/2405.02980v1",
        "pdf_url": "http://arxiv.org/pdf/2405.02980v1",
        "summary": "For the robots to achieve a desired behavior, we can program them directly,\ntrain them, or give them an innate driver that makes the robots themselves\ndesire the targeted behavior. With the minimal surprise approach, we implant in\nour robots the desire to make their world predictable. Here, we apply minimal\nsurprise to collective construction. Simulated robots push blocks in a 2D torus\ngrid world. In two variants of our experiment we either allow for emergent\nbehaviors or predefine the expected environment of the robots. In either way,\nwe evolve robot behaviors that move blocks to structure their environment and\nmake it more predictable. The resulting controllers can be applied in\ncollective construction by robots.",
        "updated": "2024-05-05 15:59:22 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.02980v1"
    },
    {
        "title": "Modelling Opaque Bilateral Market Dynamics in Financial Trading: Insights from a Multi-Agent Simulation Study",
        "authors": "Alicia VidlerToby Walsh",
        "links": "http://arxiv.org/abs/2405.02849v1",
        "entry_id": "http://arxiv.org/abs/2405.02849v1",
        "pdf_url": "http://arxiv.org/pdf/2405.02849v1",
        "summary": "Exploring complex adaptive financial trading environments through multi-agent\nbased simulation methods presents an innovative approach within the realm of\nquantitative finance. Despite the dominance of multi-agent reinforcement\nlearning approaches in financial markets with observable data, there exists a\nset of systematically significant financial markets that pose challenges due to\ntheir partial or obscured data availability. We, therefore, devise a\nmulti-agent simulation approach employing small-scale meta-heuristic methods.\nThis approach aims to represent the opaque bilateral market for Australian\ngovernment bond trading, capturing the bilateral nature of bank-to-bank\ntrading, also referred to as \"over-the-counter\" (OTC) trading, and commonly\noccurring between \"market makers\". The uniqueness of the bilateral market,\ncharacterized by negotiated transactions and a limited number of agents, yields\nvaluable insights for agent-based modelling and quantitative finance. The\ninherent rigidity of this market structure, which is at odds with the global\nproliferation of multilateral platforms and the decentralization of finance,\nunderscores the unique insights offered by our agent-based model. We explore\nthe implications of market rigidity on market structure and consider the\nelement of stability, in market design. This extends the ongoing discourse on\ncomplex financial trading environments, providing an enhanced understanding of\ntheir dynamics and implications.",
        "updated": "2024-05-05 08:42:20 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.02849v1"
    }
]