[
    {
        "title": "A New Robust Partial $p$-Wasserstein-Based Metric for Comparing Distributions",
        "authors": "Sharath RaghvendraPouyan ShirzadianKaiyi Zhang",
        "links": "http://arxiv.org/abs/2405.03664v1",
        "entry_id": "http://arxiv.org/abs/2405.03664v1",
        "pdf_url": "http://arxiv.org/pdf/2405.03664v1",
        "summary": "The $2$-Wasserstein distance is sensitive to minor geometric differences\nbetween distributions, making it a very powerful dissimilarity metric. However,\ndue to this sensitivity, a small outlier mass can also cause a significant\nincrease in the $2$-Wasserstein distance between two similar distributions.\nSimilarly, sampling discrepancy can cause the empirical $2$-Wasserstein\ndistance on $n$ samples in $\\mathbb{R}^2$ to converge to the true distance at a\nrate of $n^{-1/4}$, which is significantly slower than the rate of $n^{-1/2}$\nfor $1$-Wasserstein distance.\n  We introduce a new family of distances parameterized by $k \\ge 0$, called\n$k$-RPW, that is based on computing the partial $2$-Wasserstein distance. We\nshow that (1) $k$-RPW satisfies the metric properties, (2) $k$-RPW is robust to\nsmall outlier mass while retaining the sensitivity of $2$-Wasserstein distance\nto minor geometric differences, and (3) when $k$ is a constant, $k$-RPW\ndistance between empirical distributions on $n$ samples in $\\mathbb{R}^2$\nconverges to the true distance at a rate of $n^{-1/3}$, which is faster than\nthe convergence rate of $n^{-1/4}$ for the $2$-Wasserstein distance.\n  Using the partial $p$-Wasserstein distance, we extend our distance to any $p\n\\in [1,\\infty]$. By setting parameters $k$ or $p$ appropriately, we can reduce\nour distance to the total variation, $p$-Wasserstein, and the L\\'evy-Prokhorov\ndistances. Experiments show that our distance function achieves higher accuracy\nin comparison to the $1$-Wasserstein, $2$-Wasserstein, and TV distances for\nimage retrieval tasks on noisy real-world data sets.",
        "updated": "2024-05-06 17:41:13 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.03664v1"
    },
    {
        "title": "$ε$-Policy Gradient for Online Pricing",
        "authors": "Lukasz SzpruchTanut TreetanthiploetYufei Zhang",
        "links": "http://arxiv.org/abs/2405.03624v1",
        "entry_id": "http://arxiv.org/abs/2405.03624v1",
        "pdf_url": "http://arxiv.org/pdf/2405.03624v1",
        "summary": "Combining model-based and model-free reinforcement learning approaches, this\npaper proposes and analyzes an $\\epsilon$-policy gradient algorithm for the\nonline pricing learning task. The algorithm extends $\\epsilon$-greedy algorithm\nby replacing greedy exploitation with gradient descent step and facilitates\nlearning via model inference. We optimize the regret of the proposed algorithm\nby quantifying the exploration cost in terms of the exploration probability\n$\\epsilon$ and the exploitation cost in terms of the gradient descent\noptimization and gradient estimation errors. The algorithm achieves an expected\nregret of order $\\mathcal{O}(\\sqrt{T})$ (up to a logarithmic factor) over $T$\ntrials.",
        "updated": "2024-05-06 16:41:52 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.03624v1"
    },
    {
        "title": "Bridging discrete and continuous state spaces: Exploring the Ehrenfest process in time-continuous diffusion models",
        "authors": "Ludwig WinklerLorenz RichterManfred Opper",
        "links": "http://arxiv.org/abs/2405.03549v1",
        "entry_id": "http://arxiv.org/abs/2405.03549v1",
        "pdf_url": "http://arxiv.org/pdf/2405.03549v1",
        "summary": "Generative modeling via stochastic processes has led to remarkable empirical\nresults as well as to recent advances in their theoretical understanding. In\nprinciple, both space and time of the processes can be discrete or continuous.\nIn this work, we study time-continuous Markov jump processes on discrete state\nspaces and investigate their correspondence to state-continuous diffusion\nprocesses given by SDEs. In particular, we revisit the $\\textit{Ehrenfest\nprocess}$, which converges to an Ornstein-Uhlenbeck process in the infinite\nstate space limit. Likewise, we can show that the time-reversal of the\nEhrenfest process converges to the time-reversed Ornstein-Uhlenbeck process.\nThis observation bridges discrete and continuous state spaces and allows to\ncarry over methods from one to the respective other setting. Additionally, we\nsuggest an algorithm for training the time-reversal of Markov jump processes\nwhich relies on conditional expectations and can thus be directly related to\ndenoising score matching. We demonstrate our methods in multiple convincing\nnumerical experiments.",
        "updated": "2024-05-06 15:12:51 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.03549v1"
    },
    {
        "title": "Hierarchic Flows to Estimate and Sample High-dimensional Probabilities",
        "authors": "Etienne LempereurStéphane Mallat",
        "links": "http://arxiv.org/abs/2405.03468v1",
        "entry_id": "http://arxiv.org/abs/2405.03468v1",
        "pdf_url": "http://arxiv.org/pdf/2405.03468v1",
        "summary": "Finding low-dimensional interpretable models of complex physical fields such\nas turbulence remains an open question, 80 years after the pioneer work of\nKolmogorov. Estimating high-dimensional probability distributions from data\nsamples suffers from an optimization and an approximation curse of\ndimensionality. It may be avoided by following a hierarchic probability flow\nfrom coarse to fine scales. This inverse renormalization group is defined by\nconditional probabilities across scales, renormalized in a wavelet basis. For a\n$\\varphi^4$ scalar potential, sampling these hierarchic models avoids the\ncritical slowing down at the phase transition. An outstanding issue is to also\napproximate non-Gaussian fields having long-range interactions in space and\nacross scales. We introduce low-dimensional models with robust multiscale\napproximations of high order polynomial energies. They are calculated with a\nsecond wavelet transform, which defines interactions over two hierarchies of\nscales. We estimate and sample these wavelet scattering models to generate 2D\nvorticity fields of turbulence, and images of dark matter densities.",
        "updated": "2024-05-06 13:44:51 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.03468v1"
    },
    {
        "title": "Byzantine-Robust Gossip: Insights from a Dual Approach",
        "authors": "Renaud GaucherHadrien HendrikxAymeric Dieuleveut",
        "links": "http://arxiv.org/abs/2405.03449v1",
        "entry_id": "http://arxiv.org/abs/2405.03449v1",
        "pdf_url": "http://arxiv.org/pdf/2405.03449v1",
        "summary": "Distributed approaches have many computational benefits, but they are\nvulnerable to attacks from a subset of devices transmitting incorrect\ninformation. This paper investigates Byzantine-resilient algorithms in a\ndecentralized setting, where devices communicate directly with one another. We\nleverage the so-called dual approach to design a general robust decentralized\noptimization method. We provide both global and local clipping rules in the\nspecial case of average consensus, with tight convergence guarantees. These\nclipping rules are practical, and yield results that finely characterize the\nimpact of Byzantine nodes, highlighting for instance a qualitative difference\nin convergence between global and local clipping thresholds. Lastly, we\ndemonstrate that they can serve as a basis for designing efficient attacks.",
        "updated": "2024-05-06 13:22:54 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.03449v1"
    }
]