[
    {
        "title": "Iterative Graph Alignment",
        "authors": "Fangyuan YuHardeep Singh AroraMatt Johnson",
        "links": "http://arxiv.org/abs/2408.16667v1",
        "entry_id": "http://arxiv.org/abs/2408.16667v1",
        "pdf_url": "http://arxiv.org/pdf/2408.16667v1",
        "summary": "By compressing diverse narratives, LLMs go beyond memorization, achieving\nintelligence by capturing generalizable causal relationships. However, they\nsuffer from local 'representation gaps' due to insufficient training data\ndiversity, limiting their real-world utility, especially in tasks requiring\nstrict alignment to rules. Traditional alignment methods relying on heavy human\nannotations are inefficient and unscalable. Recent self-alignment techniques\nalso fall short, as they often depend on self-selection based prompting and\nmemorization-based learning. To address these issues, we introduce Iterative\nGraph Alignment (IGA), an annotation-free rule-based alignment algorithm. A\nteacher model (VLM) employs Iterative Graph Prompting (IGP) to create logical\ngraphs and reference answers. The student model (LLM) identifies local\nknowledge gaps by attempting to align its responses with these references,\ncollaborating with helper models to generate diverse answers. These aligned\nresponses are then used for iterative supervised fine-tuning (SFT). Our\nevaluations across five rule-based scenarios demonstrate IGP's effectiveness,\nwith a 73.12\\% alignment improvement in Claude Sonnet 3.5, and\nLlama3-8B-Instruct achieving an 86.20\\% improvement, outperforming Claude\nSonnet 3.5 in rule-based alignment.",
        "updated": "2024-08-29 16:15:01 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.16667v1"
    },
    {
        "title": "Consensus Planning with Primal, Dual, and Proximal Agents",
        "authors": "Alvaro MaggiarLee DickerMichael Mahoney",
        "links": "http://arxiv.org/abs/2408.16462v1",
        "entry_id": "http://arxiv.org/abs/2408.16462v1",
        "pdf_url": "http://arxiv.org/pdf/2408.16462v1",
        "summary": "Consensus planning is a method for coordinating decision making across\ncomplex systems and organizations, including complex supply chain optimization\npipelines. It arises when large interdependent distributed agents (systems)\nshare common resources and must act in order to achieve a joint goal. In this\npaper, we introduce a generic Consensus Planning Protocol (CPP) to solve such\nproblems. Our protocol allows for different agents to interact with the\ncoordinating algorithm in different ways (e.g., as a primal or dual or proximal\nagent). In prior consensus planning work, all agents have been assumed to have\nthe same interaction pattern (e.g., all dual agents or all primal agents or all\nproximal agents), most commonly using the Alternating Direction Method of\nMultipliers (ADMM) as proximal agents. However, this is often not a valid\nassumption in practice, where agents consist of large complex systems, and\nwhere we might not have the luxury of modifying these large complex systems at\nwill. Our generic CPP allows for any mix of agents by combining ADMM-like\nupdates for the proximal agents, dual ascent updates for the dual agents, and\nlinearized ADMM updates for the primal agents. We prove convergence results for\nthe generic CPP, namely a sublinear O(1/k) convergence rate under mild\nassumptions, and two-step linear convergence under stronger assumptions. We\nalso discuss enhancements to the basic method and provide illustrative\nempirical results.",
        "updated": "2024-08-29 11:51:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.16462v1"
    },
    {
        "title": "Parametrization and convergence of a primal-dual block-coordinate approach to linearly-constrained nonsmooth optimization",
        "authors": "Olivier Bilenne",
        "links": "http://arxiv.org/abs/2408.16424v1",
        "entry_id": "http://arxiv.org/abs/2408.16424v1",
        "pdf_url": "http://arxiv.org/pdf/2408.16424v1",
        "summary": "This note is concerned with the problem of minimizing a separable, convex,\ncomposite (smooth and nonsmooth) function subject to linear constraints. We\nstudy a randomized block-coordinate interpretation of the Chambolle-Pock\nprimal-dual algorithm, based on inexact proximal gradient steps. A specificity\nof the considered algorithm is its robustness, as it converges even in the\nabsence of strong duality or when the linear program is inconsistent. Using\nmatrix preconditiong, we derive tight sublinear convergence rates with and\nwithout duality assumptions and for both the convex and the strongly convex\nsettings. Our developments are extensions and particularizations of original\nalgorithms proposed by Malitsky (2019) and Luke and Malitsky (2018). Numerical\nexperiments are provided for an optimal transport problem of service pricing.",
        "updated": "2024-08-29 10:34:07 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.16424v1"
    },
    {
        "title": "3D Topological Modeling and Multi-Agent Movement Simulation for Viral Infection Risk Analysis",
        "authors": "Wassim JabiYidan XueThomas E. WoolleyKaterina Kaouri",
        "links": "http://arxiv.org/abs/2408.16417v1",
        "entry_id": "http://arxiv.org/abs/2408.16417v1",
        "pdf_url": "http://arxiv.org/pdf/2408.16417v1",
        "summary": "In this paper, a method to study how the design of indoor spaces and people's\nmovement within them affect disease spread is proposed by integrating\ncomputer-aided modeling, multi-agent movement simulation, and airborne viral\ntransmission modeling. Topologicpy spatial design and analysis software is used\nto model indoor environments, connect spaces, and construct a navigation graph.\nPathways for agents, each with unique characteristics such as walking speed,\ninfection status, and activities, are computed using this graph. Agents follow\na schedule of events with specific locations and times. The software calculates\n\"time-to-leave\" based on walking speed and event start times, and agents are\nmoved along the shortest path within the navigation graph, accurately\nconsidering obstacles, doorways, and walls. Precise distance calculations\nbetween agents are enabled by this setup. Viral aerosol concentration is then\ncomputed and visualized using a reaction-diffusion equation, and each agent's\ninfection risk is determined with an extension of the Wells-Riley ansatz.\nInfection risk simulations are improved by this spatio-temporal and topological\napproach, incorporating realistic human behavior and spatial dynamics. The\nresulting software is designed as a rapid decision-support tool for\npolicymakers, facility managers, stakeholders, architects, and engineers to\nmitigate disease spread in existing buildings and inform the design of new\nones. The software's effectiveness is demonstrated through a comparative\nanalysis of cellular and open commercial office plan layouts.",
        "updated": "2024-08-29 10:22:51 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.16417v1"
    },
    {
        "title": "Improving the Prediction of Individual Engagement in Recommendations Using Cognitive Models",
        "authors": "Roderick SeowYunfan ZhaoDuncan WoodMilind TambeCleotilde Gonzalez",
        "links": "http://arxiv.org/abs/2408.16147v1",
        "entry_id": "http://arxiv.org/abs/2408.16147v1",
        "pdf_url": "http://arxiv.org/pdf/2408.16147v1",
        "summary": "For public health programs with limited resources, the ability to predict how\nbehaviors change over time and in response to interventions is crucial for\ndeciding when and to whom interventions should be allocated. Using data from a\nreal-world maternal health program, we demonstrate how a cognitive model based\non Instance-Based Learning (IBL) Theory can augment existing purely\ncomputational approaches. Our findings show that, compared to general\ntime-series forecasters (e.g., LSTMs), IBL models, which reflect human\ndecision-making processes, better predict the dynamics of individuals' states.\nAdditionally, IBL provides estimates of the volatility in individuals' states\nand their sensitivity to interventions, which can improve the efficiency of\ntraining of other time series models.",
        "updated": "2024-08-28 21:28:45 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.16147v1"
    }
]