[
    {
        "title": "Designing for Fairness in Human-Robot Interactions",
        "authors": "Houston Claure",
        "links": "http://arxiv.org/abs/2405.21044v1",
        "entry_id": "http://arxiv.org/abs/2405.21044v1",
        "pdf_url": "http://arxiv.org/pdf/2405.21044v1",
        "summary": "The foundation of successful human collaboration is deeply rooted in the\nprinciples of fairness. As robots are increasingly prevalent in various parts\nof society where they are working alongside groups and teams of humans, their\nability to understand and act according to principles of fairness becomes\ncrucial for their effective integration. This is especially critical when\nrobots are part of multi-human teams, where they must make continuous decisions\nregarding the allocation of resources. These resources can be material, such as\ntools, or communicative, such as gaze direction, and must be distributed fairly\namong team members to ensure optimal team performance and healthy group\ndynamics. Therefore, our research focuses on understanding how robots can\neffectively participate within human groups by making fair decisions while\ncontributing positively to group dynamics and outcomes. In this paper, I\ndiscuss advances toward ensuring that robots are capable of considering human\nnotions of fairness in their decision-making.",
        "updated": "2024-05-31 17:38:19 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.21044v1"
    },
    {
        "title": "MunchSonic: Tracking Fine-grained Dietary Actions through Active Acoustic Sensing on Eyeglasses",
        "authors": "Saif MahmudDevansh AgarwalAshwin AjitQikang LiangThalia VirandaFrancois GuimbretiereCheng Zhang",
        "links": "http://arxiv.org/abs/2405.21004v1",
        "entry_id": "http://arxiv.org/abs/2405.21004v1",
        "pdf_url": "http://arxiv.org/pdf/2405.21004v1",
        "summary": "We introduce MunchSonic, an AI-powered active acoustic sensing system\nintegrated into eyeglasses, designed to track fine-grained dietary actions like\nhand-to-mouth movements for food intake, chewing, and drinking. MunchSonic\nemits inaudible ultrasonic waves from a commodity eyeglass frame. The reflected\nsignals contain rich information about the position and movements of various\nbody parts, including the mouth, jaw, arms, and hands, all of which are\ninvolved in eating activities. These signals are then processed by a custom\ndeep-learning pipeline to classify six actions: food intake, chewing, drinking,\ntalking, face-hand touching, and other activities (null). In an unconstrained\nuser study with 12 participants, MunchSonic achieves a 93.5% macro F1-score in\na user-independent evaluation with a 2-second time resolution, demonstrating\nits effectiveness. Additionally, MunchSonic accurately tracks eating episodes\nand the frequency of food intake within those episodes.",
        "updated": "2024-05-31 16:44:54 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.21004v1"
    },
    {
        "title": "Heuristic evaluations of back support, shoulder support, hand grip strength support, and sit-stand support exoskeletons using universal design principles",
        "authors": "Alejandra MartinezLaura TovarCarla Irigoyen AmparanKaren GonzalezPrajina EdayathPriyadarshini PennathurArunkumar Pennathur",
        "links": "http://arxiv.org/abs/2405.20819v1",
        "entry_id": "http://arxiv.org/abs/2405.20819v1",
        "pdf_url": "http://arxiv.org/pdf/2405.20819v1",
        "summary": "Occupational exoskeletons promise to reduce the incidence of musculoskeletal\ninjuries; however, we do not know if their designs allow universal use by all\nworkers. We also do not know how easy the tasks of assembling, donning,\ndoffing, and disassembling exoskeletons are. The purpose of our study was to\nheuristically evaluate a back support, a shoulder support, a handgrip strength\nsupport, and a sit-stand exoskeleton for how well they are designed for\nuniversal use when assembling, donning, doffing, and disassembling the\nexoskeleton. Seven evaluators used universal design principles and associated\ncriteria to independently evaluate and rate four exoskeletons when assembling,\ndonning, doffing, and disassembling the devices. The rating scale was a\nLikert-type scale, where a rating of 1 represented not at all, and a rating of\n5 represented an excellent design with respect to the universal design criteria\nfor the task. The results indicate that providing perceptible information to\nthe user, making the design equitable to use for a diverse set of users, making\nthe design simple and intuitive to use with adequate feedback, and designing to\nprevent user errors, and when errors are made, allowing the user to recover\nquickly from the errors, were rated poorly. Assembling and donning tasks\npresented the most challenges.",
        "updated": "2024-05-31 14:14:14 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.20819v1"
    },
    {
        "title": "EM-Assist: Safe Automated ExtractMethod Refactoring with LLMs",
        "authors": "Dorin PomianAbhiram BellurMalinda DilharaZarina KurbatovaEgor BogomolovAndrey SokolovTimofey BryksinDanny Dig",
        "links": "http://dx.doi.org/10.1145/3663529.3663803",
        "entry_id": "http://arxiv.org/abs/2405.20551v1",
        "pdf_url": "http://arxiv.org/pdf/2405.20551v1",
        "summary": "Excessively long methods, loaded with multiple responsibilities, are\nchallenging to understand, debug, reuse, and maintain. The solution lies in the\nwidely recognized Extract Method refactoring. While the application of this\nrefactoring is supported in modern IDEs, recommending which code fragments to\nextract has been the topic of many research tools. However, they often struggle\nto replicate real-world developer practices, resulting in recommendations that\ndo not align with what a human developer would do in real life. To address this\nissue, we introduce EM-Assist, an IntelliJ IDEA plugin that uses LLMs to\ngenerate refactoring suggestions and subsequently validates, enhances, and\nranks them. Finally, EM-Assist uses the IntelliJ IDE to apply the user-selected\nrecommendation. In our extensive evaluation of 1,752 real-world refactorings\nthat actually took place in open-source projects, EM-Assist's recall rate was\n53.4% among its top-5 recommendations, compared to 39.4% for the previous\nbest-in-class tool that relies solely on static analysis. Moreover, we\nconducted a usability survey with 18 industrial developers and 94.4% gave a\npositive rating.",
        "updated": "2024-05-31 00:32:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.20551v1"
    },
    {
        "title": "Impact of Connected and Automated Vehicles on Transport Injustices",
        "authors": "Laura Martinez-BuelvasAndry RakotonirainyDeanna Grant-SmithOscar Oviedo-Trespalacios",
        "links": "http://arxiv.org/abs/2405.20530v1",
        "entry_id": "http://arxiv.org/abs/2405.20530v1",
        "pdf_url": "http://arxiv.org/pdf/2405.20530v1",
        "summary": "Connected and automated vehicles are poised to transform the transport\nsystem. However, significant uncertainties remain about their impact,\nparticularly regarding concerns that this advanced technology might exacerbate\ninjustices, such as safety disparities for vulnerable road users. Therefore,\nunderstanding the potential conflicts of this technology with societal values\nsuch as justice and safety is crucial for responsible implementation. To date,\nno research has focused on what safety and justice in transport mean in the\ncontext of CAV deployment and how the potential benefits of CAVs can be\nharnessed without exacerbating the existing vulnerabilities and injustices VRUs\nface. This paper addresses this gap by exploring car drivers' and pedestrians'\nperceptions of safety and justice issues that CAVs might exacerbate using an\nexisting theoretical framework. Employing a qualitative approach, the study\ndelves into the nuanced aspects of these concepts. Interviews were conducted\nwith 30 participants aged between 18 and 79 in Queensland, Australia. These\ninterviews were recorded, transcribed, organised, and analysed using reflexive\nthematic analysis. Three main themes emerged from the participants'\ndiscussions: CAVs as a safety problem for VRUs, CAVs as a justice problem for\nVRUs, and CAVs as an alignment with societal values problem. Participants\nemphasised the safety challenges CAVs pose for VRUs, highlighting the need for\nthorough evaluation and regulatory oversight. Concerns were also raised about\nCAVs potentially marginalising vulnerable groups within society. Participants\nadvocated for inclusive discussions and a justice-oriented approach to\ndesigning a comprehensive transport system to address these concerns.",
        "updated": "2024-05-30 23:07:01 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.20530v1"
    }
]