[
    {
        "title": "A multi-objective combinatorial optimisation framework for large scale hierarchical population synthesis",
        "authors": "Imran MahmoodNicholas BishopAnisoara CalinescuMichael WooldridgeIoannis Zachos",
        "links": "http://arxiv.org/abs/2407.03180v1",
        "entry_id": "http://arxiv.org/abs/2407.03180v1",
        "pdf_url": "http://arxiv.org/pdf/2407.03180v1",
        "summary": "In agent-based simulations, synthetic populations of agents are commonly used\nto represent the structure, behaviour, and interactions of individuals.\nHowever, generating a synthetic population that accurately reflects real\npopulation statistics is a challenging task, particularly when performed at\nscale. In this paper, we propose a multi objective combinatorial optimisation\ntechnique for large scale population synthesis. We demonstrate the\neffectiveness of our approach by generating a synthetic population for selected\nregions and validating it on contingency tables from real population data. Our\napproach supports complex hierarchical structures between individuals and\nhouseholds, is scalable to large populations and achieves minimal contigency\ntable reconstruction error. Hence, it provides a useful tool for policymakers\nand researchers for simulating the dynamics of complex populations.",
        "updated": "2024-07-03 15:01:12 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.03180v1"
    },
    {
        "title": "Wildfire Autonomous Response and Prediction Using Cellular Automata (WARP-CA)",
        "authors": "Abdelrahman Ramadan",
        "links": "http://arxiv.org/abs/2407.02613v1",
        "entry_id": "http://arxiv.org/abs/2407.02613v1",
        "pdf_url": "http://arxiv.org/pdf/2407.02613v1",
        "summary": "Wildfires pose a severe challenge to ecosystems and human settlements,\nexacerbated by climate change and environmental factors. Traditional wildfire\nmodeling, while useful, often fails to adapt to the rapid dynamics of such\nevents. This report introduces the (Wildfire Autonomous Response and Prediction\nUsing Cellular Automata) WARP-CA model, a novel approach that integrates\nterrain generation using Perlin noise with the dynamism of Cellular Automata\n(CA) to simulate wildfire spread. We explore the potential of Multi-Agent\nReinforcement Learning (MARL) to manage wildfires by simulating autonomous\nagents, such as UAVs and UGVs, within a collaborative framework. Our\nmethodology combines world simulation techniques and investigates emergent\nbehaviors in MARL, focusing on efficient wildfire suppression and considering\ncritical environmental factors like wind patterns and terrain features.",
        "updated": "2024-07-02 19:01:59 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.02613v1"
    },
    {
        "title": "Impact of the Network Size and Frequency of Information Receipt on Polarization in Social Networks",
        "authors": "Sudhakar KrisharaoShaja Arul Selvamani",
        "links": "http://dx.doi.org/10.1155/2024/4742401",
        "entry_id": "http://arxiv.org/abs/2407.01788v1",
        "pdf_url": "http://arxiv.org/pdf/2407.01788v1",
        "summary": "Opinion Dynamics is an interdisciplinary area of research. Psychology and\nSociology have proposed models of how individuals form opinions and how social\ninteractions influence this process. Socio-Physicists have interpreted patterns\nin opinion formation as arising from non-linearity in the underlying process,\nshaping the models. Agent-based modeling has offered a platform to study the\nOpinion Dynamics of large groups. This paper recasts recent models in opinion\nformation into a proper dynamical system, injecting the idea of clock time into\nevolving opinions. The time interval between successive receipts of new\ninformation (frequency of information receipts) becomes a factor to study.\nSocial media has shrunk time intervals between information receipts, increasing\ntheir frequency. The recast models show that shorter intervals and larger\nnetworks increase an individual's propensity for polarization, defined as an\ninability to hold a neutral opinion. A Polarization number based on\nsociological parameters is proposed, with critical values beyond which\nindividuals are prone to polarization, depending on psychological parameters.\nReduced time intervals and larger interacting groups can push the Polarization\nnumber to critical values, contributing to polarization. The Extent of\nPolarization is defined as the width of the region around neutral within which\nan individual cannot hold an opinion. Results are reported for model parameters\nfound in the literature. The findings offer an opportunity to adjust model\nparameters to align with empirical evidence, aiding the study of Opinion\nDynamics in large social networks using Agent-Based Modeling.",
        "updated": "2024-07-01 20:30:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.01788v1"
    },
    {
        "title": "Distributed Instruments for Planetary Surface Science: Scientific Opportunities and Technology Feasibility",
        "authors": "Federico RossiRobert C. AndersonSaptarshi BandyopadhyayErik BrandonAshish GoelJoshua Vander HookMichael MischnaMichaela VillarrealMark Wronkiewicz",
        "links": "http://arxiv.org/abs/2407.01757v1",
        "entry_id": "http://arxiv.org/abs/2407.01757v1",
        "pdf_url": "http://arxiv.org/pdf/2407.01757v1",
        "summary": "In this paper, we assess the scientific promise and technology feasibility of\ndistributed instruments for planetary science. A distributed instrument is an\ninstrument designed to collect spatially and temporally correlated data from\nmultiple networked, geographically distributed point sensors. Distributed\ninstruments are ubiquitous in Earth science, where they are routinely employed\nfor weather and climate science, seismic studies and resource prospecting, and\ndetection of industrial emissions. However, to date, their adoption in\nplanetary surface science has been minimal. It is natural to ask whether this\nlack of adoption is driven by low potential to address high-priority questions\nin planetary science; immature technology; or both. To address this question,\nwe survey high-priority planetary science questions that are uniquely\nwell-suited to distributed instruments. We identify four areas of research\nwhere distributed instruments hold promise to unlock answers that are largely\ninaccessible to monolithic sensors, namely, weather and climate studies of\nMars; localization of seismic events on rocky and icy bodies; localization of\ntrace gas emissions, primarily on Mars; and magnetometry studies of internal\ncomposition. Next, we survey enabling technologies for distributed sensors and\nassess their maturity. We identify sensor placement (including descent and\nlanding on planetary surfaces), power, and instrument autonomy as three key\nareas requiring further investment to enable future distributed instruments.\nOverall, this work shows that distributed instruments hold great promise for\nplanetary science, and paves the way for follow-on studies of future\ndistributed instruments for Solar System in-situ science.",
        "updated": "2024-07-01 19:41:41 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.01757v1"
    },
    {
        "title": "Online Learning of Temporal Dependencies for Sustainable Foraging Problem",
        "authors": "John PayneAishwaryaprajnaPeter R. Lewis",
        "links": "http://arxiv.org/abs/2407.01501v1",
        "entry_id": "http://arxiv.org/abs/2407.01501v1",
        "pdf_url": "http://arxiv.org/pdf/2407.01501v1",
        "summary": "The sustainable foraging problem is a dynamic environment testbed for\nexploring the forms of agent cognition in dealing with social dilemmas in a\nmulti-agent setting. The agents need to resist the temptation of individual\nrewards through foraging and choose the collective long-term goal of\nsustainability. We investigate methods of online learning in Neuro-Evolution\nand Deep Recurrent Q-Networks to enable agents to attempt the problem one-shot\nas is often required by wicked social problems. We further explore if learning\ntemporal dependencies with Long Short-Term Memory may be able to aid the agents\nin developing sustainable foraging strategies in the long term. It was found\nthat the integration of Long Short-Term Memory assisted agents in developing\nsustainable strategies for a single agent, however failed to assist agents in\nmanaging the social dilemma that arises in the multi-agent scenario.",
        "updated": "2024-07-01 17:47:31 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.01501v1"
    }
]