[
    {
        "title": "A Multi-Agent Model for Opinion Evolution under Cognitive Biases",
        "authors": "Mário S. AlvimArtur Gaspar da SilvaSophia KnightFrank Valencia",
        "links": "http://arxiv.org/abs/2402.17615v1",
        "entry_id": "http://arxiv.org/abs/2402.17615v1",
        "pdf_url": "http://arxiv.org/pdf/2402.17615v1",
        "summary": "We generalize the DeGroot model for opinion dynamics to better capture\nrealistic social scenarios. We introduce a model where each agent has their own\nindividual cognitive biases. Society is represented as a directed graph whose\nedges indicate how much agents influence one another. Biases are represented as\nthe functions in the square region $[-1,1]^2$ and categorized into four\nsub-regions based on the potential reactions they may elicit in an agent during\ninstances of opinion disagreement. Under the assumption that each bias of every\nagent is a continuous function within the region of receptive but resistant\nreactions ($\\mathbf{R}$), we show that the society converges to a consensus if\nthe graph is strongly connected. Under the same assumption, we also establish\nthat the entire society converges to a unanimous opinion if and only if the\nsource components of the graph-namely, strongly connected components with no\nexternal influence-converge to that opinion. We illustrate that convergence is\nnot guaranteed for strongly connected graphs when biases are either\ndiscontinuous functions in $\\mathbf{R}$ or not included in $\\mathbf{R}$. We\nshowcase our model through a series of examples and simulations, offering\ninsights into how opinions form in social networks under cognitive biases.",
        "updated": "2024-02-27 15:44:12 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.17615v1"
    },
    {
        "title": "Multi-Agent, Human-Agent and Beyond: A Survey on Cooperation in Social Dilemmas",
        "authors": "Hao GuoChunjiang MuYang ChenChen ShenShuyue HuZhen Wang",
        "links": "http://arxiv.org/abs/2402.17270v1",
        "entry_id": "http://arxiv.org/abs/2402.17270v1",
        "pdf_url": "http://arxiv.org/pdf/2402.17270v1",
        "summary": "The study of cooperation within social dilemmas has long been a fundamental\ntopic across various disciplines, including computer science and social\nscience. Recent advancements in Artificial Intelligence (AI) have significantly\nreshaped this field, offering fresh insights into understanding and enhancing\ncooperation. This survey examines three key areas at the intersection of AI and\ncooperation in social dilemmas. First, focusing on multi-agent cooperation, we\nreview the intrinsic and external motivations that support cooperation among\nrational agents, and the methods employed to develop effective strategies\nagainst diverse opponents. Second, looking into human-agent cooperation, we\ndiscuss the current AI algorithms for cooperating with humans and the human\nbiases towards AI agents. Third, we review the emergent field of leveraging AI\nagents to enhance cooperation among humans. We conclude by discussing future\nresearch avenues, such as using large language models, establishing unified\ntheoretical frameworks, revisiting existing theories of human cooperation, and\nexploring multiple real-world applications.",
        "updated": "2024-02-27 07:31:30 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.17270v1"
    },
    {
        "title": "Large Language Model for Participatory Urban Planning",
        "authors": "Zhilun ZhouYuming LinDepeng JinYong Li",
        "links": "http://arxiv.org/abs/2402.17161v1",
        "entry_id": "http://arxiv.org/abs/2402.17161v1",
        "pdf_url": "http://arxiv.org/pdf/2402.17161v1",
        "summary": "Participatory urban planning is the mainstream of modern urban planning that\ninvolves the active engagement of residents. However, the traditional\nparticipatory paradigm requires experienced planning experts and is often\ntime-consuming and costly. Fortunately, the emerging Large Language Models\n(LLMs) have shown considerable ability to simulate human-like agents, which can\nbe used to emulate the participatory process easily. In this work, we introduce\nan LLM-based multi-agent collaboration framework for participatory urban\nplanning, which can generate land-use plans for urban regions considering the\ndiverse needs of residents. Specifically, we construct LLM agents to simulate a\nplanner and thousands of residents with diverse profiles and backgrounds. We\nfirst ask the planner to carry out an initial land-use plan. To deal with the\ndifferent facilities needs of residents, we initiate a discussion among the\nresidents in each community about the plan, where residents provide feedback\nbased on their profiles. Furthermore, to improve the efficiency of discussion,\nwe adopt a fishbowl discussion mechanism, where part of the residents discuss\nand the rest of them act as listeners in each round. Finally, we let the\nplanner modify the plan based on residents' feedback. We deploy our method on\ntwo real-world regions in Beijing. Experiments show that our method achieves\nstate-of-the-art performance in residents satisfaction and inclusion metrics,\nand also outperforms human experts in terms of service accessibility and\necology metrics.",
        "updated": "2024-02-27 02:47:50 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.17161v1"
    },
    {
        "title": "Replicating Electoral Success",
        "authors": "Kiran TomlinsonTanvi NamjoshiJohan UganderJon Kleinberg",
        "links": "http://arxiv.org/abs/2402.17109v1",
        "entry_id": "http://arxiv.org/abs/2402.17109v1",
        "pdf_url": "http://arxiv.org/pdf/2402.17109v1",
        "summary": "A core tension in the study of plurality elections is the clash between the\nclassic Hotelling-Downs model, which predicts that two office-seeking\ncandidates should position themselves at the median voter's policy, and the\nempirical observation that real-world democracies often have two major parties\nwith divergent policies. Motivated by this tension and drawing from bounded\nrationality, we introduce a dynamic model of candidate positioning based on a\nsimple behavioral heuristic: candidates imitate the policy of previous winners.\nThe resulting model is closely connected to evolutionary replicator dynamics\nand exhibits complex behavior, despite its simplicity. For\nuniformly-distributed voters, we prove that when there are $k = 2$, $3$, or $4$\ncandidates per election, any symmetric candidate distribution converges over\ntime to a concentration of candidates at the center. With $k \\ge 5$, however,\nwe prove that the candidate distribution does not converge to the center. For\ninitial distributions without any extreme candidates, we prove a stronger\nstatement than non-convergence, showing that the density in an interval around\nthe center goes to zero when $k \\ge 5$. As a matter of robustness, our\nconclusions are qualitatively unchanged if a small fraction of candidates are\nnot winner-copiers and are instead positioned uniformly at random. Beyond our\ntheoretical analysis, we illustrate our results in simulation; for five or more\ncandidates, we find a tendency towards the emergence of two clusters, a\nmechanism suggestive of Duverger's Law, the empirical finding that plurality\nleads to two-party systems. Our simulations also explore several variations of\nthe model, including non-uniform voter distributions and other forms of noise,\nwhich exhibit similar convergence patterns. Finally, we discuss the\nrelationship between our model and prior work on strategic equilibria of\ncandidate positioning games.",
        "updated": "2024-02-27 01:04:07 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.17109v1"
    },
    {
        "title": "Language Agents as Optimizable Graphs",
        "authors": "Mingchen ZhugeWenyi WangLouis KirschFrancesco FaccioDmitrii KhizbullinJürgen Schmidhuber",
        "links": "http://arxiv.org/abs/2402.16823v2",
        "entry_id": "http://arxiv.org/abs/2402.16823v2",
        "pdf_url": "http://arxiv.org/pdf/2402.16823v2",
        "summary": "Various human-designed prompt engineering techniques have been proposed to\nimprove problem solvers based on Large Language Models (LLMs), yielding many\ndisparate code bases. We unify these approaches by describing LLM-based agents\nas computational graphs. The nodes implement functions to process multimodal\ndata or query LLMs, and the edges describe the information flow between\noperations. Graphs can be recursively combined into larger composite graphs\nrepresenting hierarchies of inter-agent collaboration (where edges connect\noperations of different agents). Our novel automatic graph optimizers (1)\nrefine node-level LLM prompts (node optimization) and (2) improve agent\norchestration by changing graph connectivity (edge optimization). Experiments\ndemonstrate that our framework can be used to efficiently develop, integrate,\nand automatically improve various LLM agents. The code can be found at\nhttps://github.com/metauto-ai/gptswarm.",
        "updated": "2024-02-27 11:03:10 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.16823v2"
    }
]