[
    {
        "title": "Esports Training in StarCraft II: Stance Stability and Grip Strength",
        "authors": "Andrzej BiałeckiMichał StaniszewskiRobert BiałeckiJan Gajewski",
        "links": "http://arxiv.org/abs/2408.11764v1",
        "entry_id": "http://arxiv.org/abs/2408.11764v1",
        "pdf_url": "http://arxiv.org/pdf/2408.11764v1",
        "summary": "Esports are a mostly sedentary activity. There is a growing need for\ninvestigation into how biomechanical and physical abilities can be optimized\nfor esports through training. One such research avenue concerns the ability of\nesports players to perform balance tasks due to the prolonged sedentary states\nthat are required to reach the top echelon of performance.\n  Our aim for this work is to describe and compare physical abilities (balance,\ngrip strength, and self-reported training habits) of top Polish StarCraft~2\ntournament players.\n  Esports players differed significantly from the reference group in their\nability to balance on one leg. Additionally, in a grip strength test, the\nesports group fared worse than the reference group in all consecutive attempts.\n  Despite self-reported physical activity in the esports group, player fitness\nrequires further research. Training optimization could offset the issues\narising from sedentary activity, and intensifying esports training so it could\ntake less time overall.",
        "updated": "2024-08-21 16:39:25 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.11764v1"
    },
    {
        "title": "Cultural Windows: Towards a Workflow for Immersive Journeys into Global Living Spaces",
        "authors": "Hessam DjavaherpourPierre DragicevicYvonne Jansen",
        "links": "http://arxiv.org/abs/2408.11723v1",
        "entry_id": "http://arxiv.org/abs/2408.11723v1",
        "pdf_url": "http://arxiv.org/pdf/2408.11723v1",
        "summary": "\"Cultural Windows\" is a research initiative designed to enrich cross-cultural\nunderstanding through immersive extended reality (XR) experiences. This project\nproposes a workflow for deploying AR and VR platforms, allowing users to\nexplore living spaces from diverse cultures and socio-economic statuses. The\nprocess involves 3D scanning of culturally significant objects, creating\naccurate models of living spaces, and integrating them into immersive systems\nto facilitate engagement with global living designs. Targeted at individuals\ncurious about how people live in different parts of the world, the project aims\nto expand cross-cultural understanding and design perspectives, providing\ninsights into the effectiveness of immersive technologies in cultural\neducation. By detailing its conceptual framework, \"Cultural Windows\" aims to\nenhance comprehension and appreciation of global domestic aesthetics by\ncomparing participants' perceptions with immersive, realistic representations\nof living spaces from different cultures. This can help bridge the gap between\npreconceived notions and the actual appearance and feel of these spaces.",
        "updated": "2024-08-21 15:52:10 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.11723v1"
    },
    {
        "title": "Improved Visual Saliency of Graph Clusters with Orderable Node-Link Layouts",
        "authors": "Nora Al-NaamiNicolas MédocMatteo MagnaniMohammad Ghoniem",
        "links": "http://arxiv.org/abs/2408.11673v1",
        "entry_id": "http://arxiv.org/abs/2408.11673v1",
        "pdf_url": "http://arxiv.org/pdf/2408.11673v1",
        "summary": "Graphs are often used to model relationships between entities. The\nidentification and visualization of clusters in graphs enable insight discovery\nin many application areas, such as life sciences and social sciences.\nForce-directed graph layouts promote the visual saliency of clusters, as they\nbring adjacent nodes closer together, and push non-adjacent nodes apart. At the\nsame time, matrices can effectively show clusters when a suitable row/column\nordering is applied, but are less appealing to untrained users not providing an\nintuitive node-link metaphor. It is thus worth exploring layouts combining the\nstrengths of the node-link metaphor and node ordering. In this work, we study\nthe impact of node ordering on the visual saliency of clusters in orderable\nnode-link diagrams, namely radial diagrams, arc diagrams and symmetric arc\ndiagrams. Through a crowdsourced controlled experiment, we show that users can\ncount clusters consistently more accurately, and to a large extent faster, with\norderable node-link diagrams than with three state-of-the art force-directed\nlayout algorithms, i.e., `Linlog', `Backbone' and `sfdp'. The measured\nadvantage is greater in case of low cluster separability and/or low\ncompactness. A free copy of this paper and all supplemental materials are\navailable at https://osf.io/kc3dg/.",
        "updated": "2024-08-21 14:50:37 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.11673v1"
    },
    {
        "title": "The Problems with Proxies: Making Data Work Visible through Requester Practices",
        "authors": "Annabel RothschildDing WangNiveditha Jayakumar VilvanathanLauren WilcoxCarl DiSalvoBetsy DiSalvo",
        "links": "http://arxiv.org/abs/2408.11667v1",
        "entry_id": "http://arxiv.org/abs/2408.11667v1",
        "pdf_url": "http://arxiv.org/pdf/2408.11667v1",
        "summary": "Fairness in AI and ML systems is increasingly linked to the proper treatment\nand recognition of data workers involved in training dataset development. Yet,\nthose who collect and annotate the data, and thus have the most intimate\nknowledge of its development, are often excluded from critical discussions.\nThis exclusion prevents data annotators, who are domain experts, from\ncontributing effectively to dataset contextualization. Our investigation into\nthe hiring and engagement practices of 52 data work requesters on platforms\nlike Amazon Mechanical Turk reveals a gap: requesters frequently hold naive or\nunchallenged notions of worker identities and capabilities and rely on ad-hoc\nqualification tasks that fail to respect the workers' expertise. These\npractices not only undermine the quality of data but also the ethical standards\nof AI development. To rectify these issues, we advocate for policy changes to\nenhance how data annotation tasks are designed and managed and to ensure data\nworkers are treated with the respect they deserve.",
        "updated": "2024-08-21 14:39:34 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.11667v1"
    },
    {
        "title": "Audio Description Customization",
        "authors": "Rosiana NatalieRuei-Che ChangSmitha SheshadriAnhong GuoKotaro Hara",
        "links": "http://dx.doi.org/10.1145/3663548.3675617",
        "entry_id": "http://arxiv.org/abs/2408.11406v1",
        "pdf_url": "http://arxiv.org/pdf/2408.11406v1",
        "summary": "Blind and low-vision (BLV) people use audio descriptions (ADs) to access\nvideos. However, current ADs are unalterable by end users, thus are incapable\nof supporting BLV individuals' potentially diverse needs and preferences. This\nresearch investigates if customizing AD could improve how BLV individuals\nconsume videos. We conducted an interview study (Study 1) with fifteen BLV\nparticipants, which revealed desires for customizing properties like length,\nemphasis, speed, voice, format, tone, and language. At the same time, concerns\nlike interruptions and increased interaction load due to customization emerged.\nTo examine AD customization's effectiveness and tradeoffs, we designed\nCustomAD, a prototype that enables BLV users to customize AD content and\npresentation. An evaluation study (Study 2) with twelve BLV participants showed\nusing CustomAD significantly enhanced BLV people's video understanding,\nimmersion, and information navigation efficiency. Our work illustrates the\nimportance of AD customization and offers a design that enhances video\naccessibility for BLV individuals.",
        "updated": "2024-08-21 08:04:22 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.11406v1"
    }
]