[
    {
        "title": "Deviations from the Nash equilibrium and emergence of tacit collusion in a two-player optimal execution game with reinforcement learning",
        "authors": "Fabrizio LilloAndrea Macrì",
        "links": "http://arxiv.org/abs/2408.11773v1",
        "entry_id": "http://arxiv.org/abs/2408.11773v1",
        "pdf_url": "http://arxiv.org/pdf/2408.11773v1",
        "summary": "The use of reinforcement learning algorithms in financial trading is becoming\nincreasingly prevalent. However, the autonomous nature of these algorithms can\nlead to unexpected outcomes that deviate from traditional game-theoretical\npredictions and may even destabilize markets. In this study, we examine a\nscenario in which two autonomous agents, modeled with Double Deep Q-Learning,\nlearn to liquidate the same asset optimally in the presence of market impact,\nusing the Almgren-Chriss (2000) framework. Our results show that the strategies\nlearned by the agents deviate significantly from the Nash equilibrium of the\ncorresponding market impact game. Notably, the learned strategies exhibit tacit\ncollusion, closely aligning with the Pareto-optimal solution. We further\nexplore how different levels of market volatility influence the agents'\nperformance and the equilibria they discover, including scenarios where\nvolatility differs between the training and testing phases.",
        "updated": "2024-08-21 16:54:53 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.11773v1"
    },
    {
        "title": "Scalable and non-iterative graphical model estimation",
        "authors": "Kshitij KhareSyed RahmanBala RajaratnamJiayuan Zhou",
        "links": "http://arxiv.org/abs/2408.11718v1",
        "entry_id": "http://arxiv.org/abs/2408.11718v1",
        "pdf_url": "http://arxiv.org/pdf/2408.11718v1",
        "summary": "Graphical models have found widespread applications in many areas of modern\nstatistics and machine learning. Iterative Proportional Fitting (IPF) and its\nvariants have become the default method for undirected graphical model\nestimation, and are thus ubiquitous in the field. As the IPF is an iterative\napproach, it is not always readily scalable to modern high-dimensional data\nregimes. In this paper we propose a novel and fast non-iterative method for\npositive definite graphical model estimation in high dimensions, one that\ndirectly addresses the shortcomings of IPF and its variants. In addition, the\nproposed method has a number of other attractive properties. First, we show\nformally that as the dimension p grows, the proportion of graphs for which the\nproposed method will outperform the state-of-the-art in terms of computational\ncomplexity and performance tends to 1, affirming its efficacy in modern\nsettings. Second, the proposed approach can be readily combined with scalable\nnon-iterative thresholding-based methods for high-dimensional sparsity\nselection. Third, the proposed method has high-dimensional statistical\nguarantees. Moreover, our numerical experiments also show that the proposed\nmethod achieves scalability without compromising on statistical precision.\nFourth, unlike the IPF, which depends on the Gaussian likelihood, the proposed\nmethod is much more robust.",
        "updated": "2024-08-21 15:46:00 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.11718v1"
    },
    {
        "title": "Plug-in estimation of Schrödinger bridges",
        "authors": "Aram-Alexandre PooladianJonathan Niles-Weed",
        "links": "http://arxiv.org/abs/2408.11686v1",
        "entry_id": "http://arxiv.org/abs/2408.11686v1",
        "pdf_url": "http://arxiv.org/pdf/2408.11686v1",
        "summary": "We propose a procedure for estimating the Schr\\\"odinger bridge between two\nprobability distributions. Unlike existing approaches, our method does not\nrequire iteratively simulating forward and backward diffusions or training\nneural networks to fit unknown drifts. Instead, we show that the potentials\nobtained from solving the static entropic optimal transport problem between the\nsource and target samples can be modified to yield a natural plug-in estimator\nof the time-dependent drift that defines the bridge between two measures. Under\nminimal assumptions, we show that our proposal, which we call the\n\\emph{Sinkhorn bridge}, provably estimates the Schr\\\"odinger bridge with a rate\nof convergence that depends on the intrinsic dimensionality of the target\nmeasure. Our approach combines results from the areas of sampling, and\ntheoretical and statistical entropic optimal transport.",
        "updated": "2024-08-21 15:07:25 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.11686v1"
    },
    {
        "title": "On Quasi-Localized Dual Pairs in Reproducing Kernel Hilbert Spaces",
        "authors": "Helmut HarbrechtRüdiger KempfMichael Multerer",
        "links": "http://arxiv.org/abs/2408.11389v1",
        "entry_id": "http://arxiv.org/abs/2408.11389v1",
        "pdf_url": "http://arxiv.org/pdf/2408.11389v1",
        "summary": "In scattered data approximation, the span of a finite number of translates of\na chosen radial basis function is used as approximation space and the basis of\ntranslates is used for representing the approximate. However, this natural\nchoice is by no means mandatory and different choices, like, for example, the\nLagrange basis, are possible and might offer additional features. In this\narticle, we discuss different alternatives together with their canonical duals.\nWe study a localized version of the Lagrange basis, localized orthogonal bases,\nsuch as the Newton basis, and multiresolution versions thereof, constructed by\nmeans of samplets. We argue that the choice of orthogonal bases is particularly\nuseful as they lead to symmetric preconditioners. All bases under consideration\nare compared numerically to illustrate their feasibility for scattered data\napproximation. We provide benchmark experiments in two spatial dimensions and\nconsider the reconstruction of an implicit surface as a relevant application\nfrom computer graphics.",
        "updated": "2024-08-21 07:33:30 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.11389v1"
    },
    {
        "title": "Learning Flock: Enhancing Sets of Particles for Multi~Sub-State Particle Filtering with Neural Augmentation",
        "authors": "Itai NuriNir Shlezinger",
        "links": "http://arxiv.org/abs/2408.11348v1",
        "entry_id": "http://arxiv.org/abs/2408.11348v1",
        "pdf_url": "http://arxiv.org/pdf/2408.11348v1",
        "summary": "A leading family of algorithms for state estimation in dynamic systems with\nmultiple sub-states is based on particle filters (PFs). PFs often struggle when\noperating under complex or approximated modelling (necessitating many\nparticles) with low latency requirements (limiting the number of particles), as\nis typically the case in multi target tracking (MTT). In this work, we\nintroduce a deep neural network (DNN) augmentation for PFs termed learning\nflock (LF). LF learns to correct a particles-weights set, which we coin flock,\nbased on the relationships between all sub-particles in the set itself, while\ndisregarding the set acquisition procedure. Our proposed LF, which can be\nreadily incorporated into different PFs flow, is designed to facilitate rapid\noperation by maintaining accuracy with a reduced number of particles. We\nintroduce a dedicated training algorithm, allowing both supervised and\nunsupervised training, and yielding a module that supports a varying number of\nsub-states and particles without necessitating re-training. We experimentally\nshow the improvements in performance, robustness, and latency of LF\naugmentation for radar multi-target tracking, as well its ability to mitigate\nthe effect of a mismatched observation modelling. We also compare and\nillustrate the advantages of LF over a state-of-the-art DNN-aided PF, and\ndemonstrate that LF enhances both classic PFs as well as DNN-based filters.",
        "updated": "2024-08-21 05:28:12 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.11348v1"
    }
]