[
    {
        "title": "An Algorithmic Theory of Simplicity in Mechanism Design",
        "authors": "Diodato FerraioliCarmine Ventre",
        "links": "http://arxiv.org/abs/2403.08610v1",
        "entry_id": "http://arxiv.org/abs/2403.08610v1",
        "pdf_url": "http://arxiv.org/pdf/2403.08610v1",
        "summary": "A growing body of work in economics and computation focuses on the trade-off\nbetween implementability and simplicity in mechanism design. The goal is to\ndevelop a theory that not only allows to design an incentive structure easy to\ngrasp for imperfectly rational agents, but also understand the ensuing\nlimitations on the class of mechanisms that enforce it. In this context, the\nconcept of OSP mechanisms has assumed a prominent role since they provably\naccount for the absence of contingent reasoning skills, a specific cognitive\nlimitation. For single-dimensional agents, it is known that OSP mechanisms need\nto use certain greedy algorithms.\n  In this work, we introduce a notion that interpolates between OSP and SOSP, a\nmore stringent notion where agents only plan a subset of their own future\nmoves. We provide an algorithmic characterization of this novel class of\nmechanisms for single-dimensional domains and binary allocation problems, that\nprecisely measures the interplay between simplicity and implementability. We\nbuild on this to show how mechanisms based on reverse greedy algorithms\n(a.k.a., deferred acceptance auctions) are algorithmically more robust to\nimperfectly rationality than those adopting greedy algorithms.",
        "updated": "2024-03-13 15:22:18 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.08610v1"
    },
    {
        "title": "CleanAgent: Automating Data Standardization with LLM-based Agents",
        "authors": "Danrui QiJiannan Wang",
        "links": "http://arxiv.org/abs/2403.08291v1",
        "entry_id": "http://arxiv.org/abs/2403.08291v1",
        "pdf_url": "http://arxiv.org/pdf/2403.08291v1",
        "summary": "Data standardization is a crucial part in data science life cycle. While\ntools like Pandas offer robust functionalities, their complexity and the manual\neffort required for customizing code to diverse column types pose significant\nchallenges. Although large language models (LLMs) like ChatGPT have shown\npromise in automating this process through natural language understanding and\ncode generation, it still demands expert-level programming knowledge and\ncontinuous interaction for prompt refinement. To solve these challenges, our\nkey idea is to propose a Python library with declarative, unified APIs for\nstandardizing column types, simplifying the code generation of LLM with concise\nAPI calls. We first propose Dataprep.Clean which is written as a component of\nthe Dataprep Library, offers a significant reduction in complexity by enabling\nthe standardization of specific column types with a single line of code. Then\nwe introduce the CleanAgent framework integrating Dataprep.Clean and LLM-based\nagents to automate the data standardization process. With CleanAgent, data\nscientists need only provide their requirements once, allowing for a\nhands-free, automatic standardization process.",
        "updated": "2024-03-13 06:54:15 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.08291v1"
    },
    {
        "title": "Emergence of Social Norms in Large Language Model-based Agent Societies",
        "authors": "Siyue RenZhiyao CuiRuiqi SongZhen WangShuyue Hu",
        "links": "http://arxiv.org/abs/2403.08251v1",
        "entry_id": "http://arxiv.org/abs/2403.08251v1",
        "pdf_url": "http://arxiv.org/pdf/2403.08251v1",
        "summary": "The emergence of social norms has attracted much interest in a wide array of\ndisciplines, ranging from social science and cognitive science to artificial\nintelligence. In this paper, we propose the first generative agent architecture\nthat empowers the emergence of social norms within a population of large\nlanguage model-based agents. Our architecture, named CRSEC, consists of four\nmodules: Creation & Representation, Spreading, Evaluation, and Compliance. Our\narchitecture addresses several important aspects of the emergent processes all\nin one: (i) where social norms come from, (ii) how they are formally\nrepresented, (iii) how they spread through agents' communications and\nobservations, (iv) how they are examined with a sanity check and synthesized in\nthe long term, and (v) how they are incorporated into agents' planning and\nactions. Our experiments deployed in the Smallville sandbox game environment\ndemonstrate the capability of our architecture to establish social norms and\nreduce social conflicts within large language model-based multi-agent systems.\nThe positive outcomes of our human evaluation, conducted with 30 evaluators,\nfurther affirm the effectiveness of our approach.",
        "updated": "2024-03-13 05:08:10 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.08251v1"
    },
    {
        "title": "Transforming Competition into Collaboration: The Revolutionary Role of Multi-Agent Systems and Language Models in Modern Organizations",
        "authors": "Carlos Jose Xavier Cruz",
        "links": "http://arxiv.org/abs/2403.07769v1",
        "entry_id": "http://arxiv.org/abs/2403.07769v1",
        "pdf_url": "http://arxiv.org/pdf/2403.07769v1",
        "summary": "This article explores the dynamic influence of computational entities based\non multi-agent systems theory (SMA) combined with large language models (LLM),\nwhich are characterized by their ability to simulate complex human\ninteractions, as a possibility to revolutionize human user interaction from the\nuse of specialized artificial agents to support everything from operational\norganizational processes to strategic decision making based on applied\nknowledge and human orchestration. Previous investigations reveal that there\nare limitations, particularly in the autonomous approach of artificial agents,\nespecially when dealing with new challenges and pragmatic tasks such as\ninducing logical reasoning and problem solving. It is also considered that\ntraditional techniques, such as the stimulation of chains of thoughts, require\nexplicit human guidance. In our approach we employ agents developed from large\nlanguage models (LLM), each with distinct prototyping that considers behavioral\nelements, driven by strategies that stimulate the generation of knowledge based\non the use case proposed in the scenario (role-play) business, using a\ndiscussion approach between agents (guided conversation). We demonstrate the\npotential of developing agents useful for organizational strategies, based on\nmulti-agent system theories (SMA) and innovative uses based on large language\nmodels (LLM based), offering a differentiated and adaptable experiment to\ndifferent applications, complexities, domains, and capabilities from LLM.",
        "updated": "2024-03-12 15:56:10 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.07769v1"
    },
    {
        "title": "Ariadne and Theseus: Exploration and Rendezvous with Two Mobile Agents in an Unknown Graph",
        "authors": "Romain Cosson",
        "links": "http://arxiv.org/abs/2403.07748v1",
        "entry_id": "http://arxiv.org/abs/2403.07748v1",
        "pdf_url": "http://arxiv.org/pdf/2403.07748v1",
        "summary": "We investigate two fundamental problems in mobile computing: exploration and\nrendezvous, with two distinct mobile agents in an unknown graph. The agents can\nread and write information on whiteboards that are located at all nodes. They\nboth move along one adjacent edge at every time-step. In the exploration\nproblem, both agents start from the same node of the graph and must traverse\nall of its edges. We show that a simple variant of depth-first search achieves\ncollective exploration in $m$ synchronous time-steps, where $m$ is the number\nof edges of the graph. This improves the competitive ratio of collective graph\nexploration. In the rendezvous problem, the agents start from different nodes\nof the graph and must meet as fast as possible. We introduce an algorithm\nguaranteeing rendezvous in at most $\\frac{3}{2}m$ time-steps. This improves\nover the so-called `wait for Mommy' algorithm which requires $2m$ time-steps.\nAll our guarantees are derived from a more general asynchronous setting in\nwhich the speeds of the agents are controlled by an adversary at all times. Our\nguarantees also generalize to weighted graphs, if the number of edges $m$ is\nreplaced by the sum of all edge lengths.",
        "updated": "2024-03-12 15:33:09 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.07748v1"
    }
]