[
    {
        "title": "Exploring the potential of AI in nurturing learner empathy, prosocial values and environmental stewardship",
        "authors": "Kenneth Y T LimMinh Anh Nguyen DucMinh Tuan Nguyen Thien",
        "links": "http://arxiv.org/abs/2408.15906v1",
        "entry_id": "http://arxiv.org/abs/2408.15906v1",
        "pdf_url": "http://arxiv.org/pdf/2408.15906v1",
        "summary": "With Artificial Intelligence (AI) becoming a powerful tool for education\n(Zawacki-Richter et al., 2019), this chapter describes the concept of combining\ngenerative and traditional AI, citizen-science physiological, neuroergonomic\nwearables and environmental sensors into activities for learners to understand\ntheir own well-being and emotional states better with a view to developing\nempathy and environmental stewardship. Alongside bespoke and affordable\nwearables (DIY EEG headsets and biometric wristbands), interpretable AI and\ndata science are used for learners to explore how the environment affects them\nphysiologically and mentally in authentic environments. For example,\nrelationships between environmental changes (e.g. poorer air quality) and their\nwell-being (e.g. cognitive functioning) can be discovered. This is particularly\ncrucial, as relevant knowledge can influence the way people treat the\nenvironment, as suggested by the disciplines of environmental neuroscience and\nenvironmental psychology (Doell et al., 2023). Yet, according to Palme and\nSalvati, there have been relatively few studies on the relationships between\nmicroclimates and human health and emotions (Palme and Salvati, 2021). As\nanthropogenic environmental pollution is becoming a prevalent problem, our\nresearch also aims to leverage on generative AI to introduce hypothetical\nscenarios of the environment as emotionally strong stimuli of relevance to the\nlearners. This would provoke an emotional response for them to learn about\ntheir own physiological and neurological responses (using neuro-physiological\ndata). Ultimately, we hope to establish a bidirectional understanding of how\nthe environment affects humans physiologically and mentally; after which, to\ngain insights as to how AI can be used to effectively foster empathy,\npro-environmental attitudes and stewardship.",
        "updated": "2024-08-28 16:19:55 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.15906v1"
    },
    {
        "title": "A quantitative model of takeover request time budget for conditionally automated driving",
        "authors": "Foghor TanshiDirk Söffker",
        "links": "http://dx.doi.org/10.1109/ACCESS.2023.0322000",
        "entry_id": "http://arxiv.org/abs/2408.15682v1",
        "pdf_url": "http://arxiv.org/pdf/2408.15682v1",
        "summary": "In conditional automation, the automated driving system assumes full control\nand only issues a takeover request to a human driver to resume driving in\ncritical situations. Previous studies have concluded that the time budget\nrequired by drivers to resume driving after a takeover request varies with\nsituations and different takeover variables. However, no comprehensive\ngeneralized approaches for estimating in advance the time budget required by\ndrivers to takeover have been provided. In this contribution, fixed (7 s) and\nvariable time budgets (6 s, 5 s, and 4 s) with and without visual imagery\nassistance were investigated for suitability in three takeover scenarios using\nperformance measures such as average lateral displacement. The results indicate\nthat 7 s is suitable for two of the studied scenarios based on their\ncharacteristics. Using the obtained results and known relations between\ntakeover variables, a mathematical formula for estimating takeover request time\nbudget is proposed. The proposed formula integrates individual stimulus\nresponse time, driving experience, scenario specific requirements and allows\nincreased safety for takeover maneuvers. Furthermore, the visual imagery\nresulted in increased takeover time which invariably increases the time budget.\nThus the time demand of the visualized information if applicable (such as\nvisual imagery) should be included in the time budget.",
        "updated": "2024-08-28 10:12:44 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.15682v1"
    },
    {
        "title": "Super-intelligent society for the silver segment: Ethics in design",
        "authors": "Jaana LeikasRebekah RousiHannu VilpponenPertti Saariluoma",
        "links": "http://arxiv.org/abs/2408.15618v1",
        "entry_id": "http://arxiv.org/abs/2408.15618v1",
        "pdf_url": "http://arxiv.org/pdf/2408.15618v1",
        "summary": "A super-intelligent AI- society should be based on inclusion, so that all\nmembers of society can equally benefit from the possibilities new technologies\noffer in everyday life. At present, the digital society is overwhelming many\npeople, a large group of whom are older adults, whose quality of life has been\nundermined in many respects by their difficulties in using digital technology.\nHowever, this silver segment should be kept involved as active users of digital\nservices and contribute to the functioning and development of a\nsuper-intelligent, AI-enabled society. The paper calls for action-oriented\ndesign thinking that considers the challenge to improve the quality of life,\nwith an emphasis on ethical design and ethical impact assessment.",
        "updated": "2024-08-28 08:18:33 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.15618v1"
    },
    {
        "title": "An Investigation of Warning Erroneous Chat Translations in Cross-lingual Communication",
        "authors": "Yunmeng LiJun SuzukiMakoto MorishitaKaori AbeKentaro Inui",
        "links": "http://dx.doi.org/10.18653/v1/2023.ijcnlp-srw.2",
        "entry_id": "http://arxiv.org/abs/2408.15543v1",
        "pdf_url": "http://arxiv.org/pdf/2408.15543v1",
        "summary": "The complexities of chats pose significant challenges for machine translation\nmodels. Recognizing the need for a precise evaluation metric to address the\nissues of chat translation, this study introduces Multidimensional Quality\nMetrics for Chat Translation (MQM-Chat). Through the experiments of five models\nusing MQM-Chat, we observed that all models generated certain fundamental\nerrors, while each of them has different shortcomings, such as omission, overly\ncorrecting ambiguous source content, and buzzword issues, resulting in the loss\nof stylized information. Our findings underscore the effectiveness of MQM-Chat\nin evaluating chat translation, emphasizing the importance of stylized content\nand dialogue consistency for future studies.",
        "updated": "2024-08-28 05:36:25 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.15543v1"
    },
    {
        "title": "How Much is too Much: Exploring the Effect of Verbal Route Description Length on Indoor Navigation",
        "authors": "Fathima Nourin NPradip PramanickChayan Sarkar",
        "links": "http://arxiv.org/abs/2408.15367v1",
        "entry_id": "http://arxiv.org/abs/2408.15367v1",
        "pdf_url": "http://arxiv.org/pdf/2408.15367v1",
        "summary": "Navigating through a new indoor environment can be stressful. Recently, many\nplaces have deployed robots to assist visitors. One of the features of such\nrobots is escorting the visitors to their desired destination within the\nenvironment, but this is neither scalable nor necessary for every visitor.\nInstead, a robot assistant could be deployed at a strategic location to provide\nwayfinding instructions. This not only increases the user experience but can be\nhelpful in many time-critical scenarios e.g., escorting someone to their\nboarding gate at an airport. However, delivering route descriptions verbally\nposes a challenge. If the description is too verbose, people may struggle to\nrecall all the information, while overly brief descriptions may be simply\nunhelpful. This article focuses on studying the optimal length of verbal route\ndescriptions that are effective for reaching the destination and easy for\npeople to recall. This work proposes a theoretical framework that links route\nsegments to chunks in working memory. Based on this framework, an experiment is\ndesigned and conducted to examine the effects of route descriptions of\ndifferent lengths on navigational performance. The results revealed intriguing\npatterns suggesting an ideal length of four route segments. This study lays a\nfoundation for future research exploring the relationship between route\ndescription lengths, working memory capacity, and navigational performance in\nindoor environments.",
        "updated": "2024-08-27 19:04:07 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.15367v1"
    }
]