[
    {
        "title": "Different Facets for Different Experts: A Framework for Streamlining The Integration of Qualitative Insights into ABM Development",
        "authors": "Vivek NallurPedram AghaeiGraham Finlay",
        "links": "http://arxiv.org/abs/2408.15725v1",
        "entry_id": "http://arxiv.org/abs/2408.15725v1",
        "pdf_url": "http://arxiv.org/pdf/2408.15725v1",
        "summary": "A key problem in agent-based simulation is that integrating qualitative\ninsights from multiple discipline experts is extremely hard. In most\nsimulations, agent capabilities and corresponding behaviour needs to be\nprogrammed into the agent. We report on the architecture of a tool that\ndisconnects the programmed functions of the agent, from the acquisition of\ncapability and displayed behaviour. This allows multiple different domain\nexperts to represent qualitative insights, without the need for code to be\nchanged. It also allows a continuous integration (or even change) of\nqualitative behaviour processes, as more insights are gained. The consequent\nbehaviour observed in the model is both, more faithful to the expert's insight\nas well as able to be contrasted against other models representing other\ninsights.",
        "updated": "2024-08-28 11:43:14 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.15725v1"
    },
    {
        "title": "TrafficGamer: Reliable and Flexible Traffic Simulation for Safety-Critical Scenarios with Game-Theoretic Oracles",
        "authors": "Guanren QiaoGuorui QuanJiawei YuShujun JiaGuiliang Liu",
        "links": "http://arxiv.org/abs/2408.15538v1",
        "entry_id": "http://arxiv.org/abs/2408.15538v1",
        "pdf_url": "http://arxiv.org/pdf/2408.15538v1",
        "summary": "While modern Autonomous Vehicle (AV) systems can develop reliable driving\npolicies under regular traffic conditions, they frequently struggle with\nsafety-critical traffic scenarios. This difficulty primarily arises from the\nrarity of such scenarios in driving datasets and the complexities associated\nwith predictive modeling among multiple vehicles. To support the testing and\nrefinement of AV policies, simulating safety-critical traffic events is an\nessential challenge to be addressed. In this work, we introduce TrafficGamer,\nwhich facilitates game-theoretic traffic simulation by viewing common road\ndriving as a multi-agent game. In evaluating the empirical performance across\nvarious real-world datasets, TrafficGamer ensures both fidelity and\nexploitability of the simulated scenarios, guaranteeing that they not only\nstatically align with real-world traffic distribution but also efficiently\ncapture equilibriums for representing safety-critical scenarios involving\nmultiple agents. Additionally, the results demonstrate that TrafficGamer\nexhibits highly flexible simulation across various contexts. Specifically, we\ndemonstrate that the generated scenarios can dynamically adapt to equilibriums\nof varying tightness by configuring risk-sensitive constraints during\noptimization. To the best of our knowledge, TrafficGamer is the first simulator\ncapable of generating diverse traffic scenarios involving multiple agents. We\nhave provided a demo webpage for the project at\nhttps://qiaoguanren.github.io/trafficgamer-demo/.",
        "updated": "2024-08-28 05:11:16 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.15538v1"
    },
    {
        "title": "Graph Attention Inference of Network Topology in Multi-Agent Systems",
        "authors": "Akshay KolliReza AzadehKshitj Jerath",
        "links": "http://arxiv.org/abs/2408.15449v1",
        "entry_id": "http://arxiv.org/abs/2408.15449v1",
        "pdf_url": "http://arxiv.org/pdf/2408.15449v1",
        "summary": "Accurately identifying the underlying graph structures of multi-agent systems\nremains a difficult challenge. Our work introduces a novel machine\nlearning-based solution that leverages the attention mechanism to predict\nfuture states of multi-agent systems by learning node representations. The\ngraph structure is then inferred from the strength of the attention values.\nThis approach is applied to both linear consensus dynamics and the non-linear\ndynamics of Kuramoto oscillators, resulting in implicit learning the graph by\nlearning good agent representations. Our results demonstrate that the presented\ndata-driven graph attention machine learning model can identify the network\ntopology in multi-agent systems, even when the underlying dynamic model is not\nknown, as evidenced by the F1 scores achieved in the link prediction.",
        "updated": "2024-08-27 23:58:51 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.15449v1"
    },
    {
        "title": "Decentralized Unlabeled Multi-agent Pathfinding Via Target And Priority Swapping (With Supplementary)",
        "authors": "Stepan DergachevKonstantin Yakovlev",
        "links": "http://arxiv.org/abs/2408.14948v1",
        "entry_id": "http://arxiv.org/abs/2408.14948v1",
        "pdf_url": "http://arxiv.org/pdf/2408.14948v1",
        "summary": "In this paper we study a challenging variant of the multi-agent pathfinding\nproblem (MAPF), when a set of agents must reach a set of goal locations, but it\ndoes not matter which agent reaches a specific goal - Anonymous MAPF (AMAPF).\nCurrent optimal and suboptimal AMAPF solvers rely on the existence of a\ncentralized controller which is in charge of both target assignment and\npathfinding. We extend the state of the art and present the first AMAPF solver\ncapable of solving the problem at hand in a fully decentralized fashion, when\neach agent makes decisions individually and relies only on the local\ncommunication with the others. The core of our method is a priority and target\nswapping procedure tailored to produce consistent goal assignments (i.e. making\nsure that no two agents are heading towards the same goal). Coupled with an\nestablished rule-based path planning, we end up with a TP-SWAP, an efficient\nand flexible approach to solve decentralized AMAPF. On the theoretical side, we\nprove that TP-SWAP is complete (i.e. TP-SWAP guarantees that each target will\nbe reached by some agent). Empirically, we evaluate TP-SWAP across a wide range\nof setups and compare it to both centralized and decentralized baselines.\nIndeed, TP-SWAP outperforms the fully-decentralized competitor and can even\noutperform the semi-decentralized one (i.e. the one relying on the initial\nconsistent goal assignment) in terms of flowtime (a widespread cost objective\nin MAPF",
        "updated": "2024-08-27 10:45:57 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.14948v1"
    },
    {
        "title": "Multi-Agent Path Finding with Real Robot Dynamics and Interdependent Tasks for Automated Warehouses",
        "authors": "Vassilissa Lehoux-LebacqueTomi SilanderChristelle LoiodiceSeungjoon LeeAlbert WangSofia Michel",
        "links": "http://arxiv.org/abs/2408.14527v1",
        "entry_id": "http://arxiv.org/abs/2408.14527v1",
        "pdf_url": "http://arxiv.org/pdf/2408.14527v1",
        "summary": "Multi-Agent Path Finding (MAPF) is an important optimization problem\nunderlying the deployment of robots in automated warehouses and factories.\nDespite the large body of work on this topic, most approaches make heavy\nsimplifications, both on the environment and the agents, which make the\nresulting algorithms impractical for real-life scenarios. In this paper, we\nconsider a realistic problem of online order delivery in a warehouse, where a\nfleet of robots bring the products belonging to each order from shelves to\nworkstations. This creates a stream of inter-dependent pickup and delivery\ntasks and the associated MAPF problem consists of computing realistic\ncollision-free robot trajectories fulfilling these tasks. To solve this MAPF\nproblem, we propose an extension of the standard Prioritized Planning algorithm\nto deal with the inter-dependent tasks (Interleaved Prioritized Planning) and a\nnovel Via-Point Star (VP*) algorithm to compute an optimal dynamics-compliant\nrobot trajectory to visit a sequence of goal locations while avoiding moving\nobstacles. We prove the completeness of our approach and evaluate it in\nsimulation as well as in a real warehouse.",
        "updated": "2024-08-26 15:13:38 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.14527v1"
    }
]