[
    {
        "title": "Fully Independent Communication in Multi-Agent Reinforcement Learning",
        "authors": "Rafael PinaVaruna De SilvaCorentin ArtaudXiaolan Liu",
        "links": "http://arxiv.org/abs/2401.15059v1",
        "entry_id": "http://arxiv.org/abs/2401.15059v1",
        "pdf_url": "http://arxiv.org/pdf/2401.15059v1",
        "summary": "Multi-Agent Reinforcement Learning (MARL) comprises a broad area of research\nwithin the field of multi-agent systems. Several recent works have focused\nspecifically on the study of communication approaches in MARL. While multiple\ncommunication methods have been proposed, these might still be too complex and\nnot easily transferable to more practical contexts. One of the reasons for that\nis due to the use of the famous parameter sharing trick. In this paper, we\ninvestigate how independent learners in MARL that do not share parameters can\ncommunicate. We demonstrate that this setting might incur into some problems,\nto which we propose a new learning scheme as a solution. Our results show that,\ndespite the challenges, independent agents can still learn communication\nstrategies following our method. Additionally, we use this method to\ninvestigate how communication in MARL is affected by different network\ncapacities, both for sharing and not sharing parameters. We observe that\ncommunication may not always be needed and that the chosen agent network sizes\nneed to be considered when used together with communication in order to achieve\nefficient learning.",
        "updated": "2024-01-26 18:42:01 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.15059v1"
    },
    {
        "title": "Distributed Simultaneous Localisation and Auto-Calibration using Gaussian Belief Propagation",
        "authors": "Riku MuraiIgnacio AlzugarayPaul H. J. KellyAndrew J. Davison",
        "links": "http://dx.doi.org/10.1109/LRA.2024.3352361",
        "entry_id": "http://arxiv.org/abs/2401.15036v1",
        "pdf_url": "http://arxiv.org/pdf/2401.15036v1",
        "summary": "We present a novel scalable, fully distributed, and online method for\nsimultaneous localisation and extrinsic calibration for multi-robot setups.\nIndividual a priori unknown robot poses are probabilistically inferred as\nrobots sense each other while simultaneously calibrating their sensors and\nmarkers extrinsic using Gaussian Belief Propagation. In the presented\nexperiments, we show how our method not only yields accurate robot localisation\nand auto-calibration but also is able to perform under challenging\ncircumstances such as highly noisy measurements, significant communication\nfailures or limited communication range.",
        "updated": "2024-01-26 17:54:55 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.15036v1"
    },
    {
        "title": "Multi-Agent Coordination for a Partially Observable and Dynamic Robot Soccer Environment with Limited Communication",
        "authors": "Daniele AffinitaFlavio VolpiValerio SpagnoliVincenzo SurianiDaniele NardiDomenico D. Bloisi",
        "links": "http://arxiv.org/abs/2401.15026v1",
        "entry_id": "http://arxiv.org/abs/2401.15026v1",
        "pdf_url": "http://arxiv.org/pdf/2401.15026v1",
        "summary": "RoboCup represents an International testbed for advancing research in AI and\nrobotics, focusing on a definite goal: developing a robot team that can win\nagainst the human world soccer champion team by the year 2050. To achieve this\ngoal, autonomous humanoid robots' coordination is crucial. This paper explores\nnovel solutions within the RoboCup Standard Platform League (SPL), where a\nreduction in WiFi communication is imperative, leading to the development of\nnew coordination paradigms. The SPL has experienced a substantial decrease in\nnetwork packet rate, compelling the need for advanced coordination\narchitectures to maintain optimal team functionality in dynamic environments.\nInspired by market-based task assignment, we introduce a novel distributed\ncoordination system to orchestrate autonomous robots' actions efficiently in\nlow communication scenarios. This approach has been tested with NAO robots\nduring official RoboCup competitions and in the SimRobot simulator,\ndemonstrating a notable reduction in task overlaps in limited communication\nsettings.",
        "updated": "2024-01-26 17:37:25 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.15026v1"
    },
    {
        "title": "Energy Flexibility Potential in the Brewery Sector: A Multi-agent Based Simulation of 239 Danish Breweries",
        "authors": "Daniel Anthony HowardZheng Grace MaJacob Alstrup EngvangMorten HagenauKathrine Lau JorgensenJonas Fausing OlesenBo Nørregaard Jørgensen",
        "links": "http://dx.doi.org/10.1109/APPEEC53445.2022.10072200",
        "entry_id": "http://arxiv.org/abs/2401.14903v1",
        "pdf_url": "http://arxiv.org/pdf/2401.14903v1",
        "summary": "The beverage industry is a typical food processing industry, accounts for\nsignificant energy consumption, and has flexible demands. However, the\ndeployment of energy flexibility in the beverage industry is complex and\nchallenging. Furthermore, activation of energy flexibility from the whole\nbrewery industry is necessary to ensure grid stability. Therefore, this paper\nassesses the energy flexibility potential of Denmark's brewery sector based on\na multi-agent-based simulation. 239 individual brewery facilities are\nsimulated, and each facility, as an agent, can interact with the energy system\nmarket and make decisions based on its underlying parameters and operational\nrestrictions. The results show that the Danish breweries could save 1.56 % of\nelectricity costs annually while maintaining operational security and reducing\napproximately 1745 tonnes of CO2 emissions. Furthermore, medium-size breweries\ncould obtain higher relative benefits by providing energy flexibility,\nespecially those producing lager and ale. The result also shows that the\nbreweries' relative saving potential is electricity market-dependent.",
        "updated": "2024-01-26 14:32:35 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.14903v1"
    },
    {
        "title": "Keeping the Harmony Between Neighbors: Local Fairness in Graph Fair Division",
        "authors": "Halvard HummelAyumi Igarashi",
        "links": "http://arxiv.org/abs/2401.14825v1",
        "entry_id": "http://arxiv.org/abs/2401.14825v1",
        "pdf_url": "http://arxiv.org/pdf/2401.14825v1",
        "summary": "We study the problem of allocating indivisible resources under the\nconnectivity constraints of a graph $G$. This model, initially introduced by\nBouveret et al. (published in IJCAI, 2017), effectively encompasses a diverse\narray of scenarios characterized by spatial or temporal limitations, including\nthe division of land plots and the allocation of time plots. In this paper, we\nintroduce a novel fairness concept that integrates local comparisons within the\nsocial network formed by a connected allocation of the item graph. Our\nparticular focus is to achieve pairwise-maximin fair share (PMMS) among the\n\"neighbors\" within this network. For any underlying graph structure, we show\nthat a connected allocation that maximizes Nash welfare guarantees a\n$(1/2)$-PMMS fairness. Moreover, for two agents, we establish that a\n$(3/4)$-PMMS allocation can be efficiently computed. Additionally, we\ndemonstrate that for three agents and the items aligned on a path, a PMMS\nallocation is always attainable and can be computed in polynomial time. Lastly,\nwhen agents have identical additive utilities, we present a\npseudo-polynomial-time algorithm for a $(3/4)$-PMMS allocation, irrespective of\nthe underlying graph $G$. Furthermore, we provide a polynomial-time algorithm\nfor obtaining a PMMS allocation when $G$ is a tree.",
        "updated": "2024-01-26 12:52:49 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.14825v1"
    }
]