[
    {
        "title": "COMBO: Compositional World Models for Embodied Multi-Agent Cooperation",
        "authors": "Hongxin ZhangZeyuan WangQiushi LyuZheyuan ZhangSunli ChenTianmin ShuYilun DuChuang Gan",
        "links": "http://arxiv.org/abs/2404.10775v1",
        "entry_id": "http://arxiv.org/abs/2404.10775v1",
        "pdf_url": "http://arxiv.org/pdf/2404.10775v1",
        "summary": "In this paper, we investigate the problem of embodied multi-agent\ncooperation, where decentralized agents must cooperate given only partial\negocentric views of the world. To effectively plan in this setting, in contrast\nto learning world dynamics in a single-agent scenario, we must simulate world\ndynamics conditioned on an arbitrary number of agents' actions given only\npartial egocentric visual observations of the world. To address this issue of\npartial observability, we first train generative models to estimate the overall\nworld state given partial egocentric observations. To enable accurate\nsimulation of multiple sets of actions on this world state, we then propose to\nlearn a compositional world model for multi-agent cooperation by factorizing\nthe naturally composable joint actions of multiple agents and compositionally\ngenerating the video. By leveraging this compositional world model, in\ncombination with Vision Language Models to infer the actions of other agents,\nwe can use a tree search procedure to integrate these modules and facilitate\nonline cooperative planning. To evaluate the efficacy of our methods, we create\ntwo challenging embodied multi-agent long-horizon cooperation tasks using the\nThreeDWorld simulator and conduct experiments with 2-4 agents. The results show\nour compositional world model is effective and the framework enables the\nembodied agents to cooperate efficiently with different agents across various\ntasks and an arbitrary number of agents, showing the promising future of our\nproposed framework. More videos can be found at\nhttps://vis-www.cs.umass.edu/combo/.",
        "updated": "2024-04-16 17:59:11 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.10775v1"
    },
    {
        "title": "Driver Fatigue Prediction using Randomly Activated Neural Networks for Smart Ridesharing Platforms",
        "authors": "Sree Pooja AkulaMukund TelukuntaVenkata Sriram Siddhardh Nadendla",
        "links": "http://arxiv.org/abs/2404.10684v1",
        "entry_id": "http://arxiv.org/abs/2404.10684v1",
        "pdf_url": "http://arxiv.org/pdf/2404.10684v1",
        "summary": "Drivers in ridesharing platforms exhibit cognitive atrophy and fatigue as\nthey accept ride offers along the day, which can have a significant impact on\nthe overall efficiency of the ridesharing platform. In contrast to the current\nliterature which focuses primarily on modeling and learning driver's\npreferences across different ride offers, this paper proposes a novel Dynamic\nDiscounted Satisficing (DDS) heuristic to model and predict driver's sequential\nride decisions during a given shift. Based on DDS heuristic, a novel stochastic\nneural network with random activations is proposed to model DDS heuristic and\npredict the final decision made by a given driver. The presence of random\nactivations in the network necessitated the development of a novel training\nalgorithm called Sampling-Based Back Propagation Through Time (SBPTT), where\ngradients are computed for independent instances of neural networks (obtained\nvia sampling the distribution of activation threshold) and aggregated to update\nthe network parameters. Using both simulation experiments as well as on real\nChicago taxi dataset, this paper demonstrates the improved performance of the\nproposed approach, when compared to state-of-the-art methods.",
        "updated": "2024-04-16 16:04:11 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.10684v1"
    },
    {
        "title": "A Cloud Resources Portfolio Optimization Business Model - From Theory to Practice",
        "authors": "Valentin HaagMaximilian KiesslerBenedikt PittlErich Schikuta",
        "links": "http://arxiv.org/abs/2404.10641v1",
        "entry_id": "http://arxiv.org/abs/2404.10641v1",
        "pdf_url": "http://arxiv.org/pdf/2404.10641v1",
        "summary": "Cloud resources have become increasingly important, with many businesses\nusing cloud solutions to supplement or outright replace their existing IT\ninfrastructure. However, as there is a plethora of providers with varying\nproducts, services, and markets, it has become increasingly more challenging to\nkeep track of the best solutions for each application. Cloud service\nintermediaries aim to alleviate this problem by offering services that help\nusers meet their requirements.\n  This paper aims to lay the groundwork for developing a cloud portfolio\nmanagement platform and its business model, defined via a business model\ncanvas. Furthermore, a prototype of a platform is developed offering a cloud\nportfolio optimization service, using two algorithms developed in previous\nresearch to create suitable and well-utilized allocations for a customer's\napplications.",
        "updated": "2024-04-16 15:15:59 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.10641v1"
    },
    {
        "title": "Concurrency Model of BDI Programming Frameworks: Why Should We Control It?",
        "authors": "Martina BaiardiSamuele BurattiniGiovanni CiattoDanilo PianiniAndrea OmiciniAlessandro Ricci",
        "links": "http://arxiv.org/abs/2404.10421v1",
        "entry_id": "http://arxiv.org/abs/2404.10421v1",
        "pdf_url": "http://arxiv.org/pdf/2404.10421v1",
        "summary": "We provide a taxonomy of concurrency models for BDI frameworks, elicited by\nanalysing state-of-the-art technologies, and aimed at helping both BDI\ndesigners and developers in making informed decisions. Comparison among BDI\ntechnologies w.r.t. concurrency models reveals heterogeneous support, and low\ncustomisability.",
        "updated": "2024-04-16 09:38:40 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.10421v1"
    },
    {
        "title": "On the external concurrency of current BDI frameworks for MAS",
        "authors": "Martina BaiardiSamuele BurattiniGiovanni CiattoDanilo PianiniAlessandro RicciAndrea Omicini",
        "links": "http://arxiv.org/abs/2404.10397v1",
        "entry_id": "http://arxiv.org/abs/2404.10397v1",
        "pdf_url": "http://arxiv.org/pdf/2404.10397v1",
        "summary": "The execution of Belief-Desire-Intention (BDI) agents in a Multi-Agent System\n(MAS) can be practically implemented on top of low-level concurrency mechanisms\nthat impact on efficiency, determinism, and reproducibility. We argue that\ndevelopers should specify the MAS behaviour independently of the execution\nmodel, and choose or configure the concurrency model later on, according to\ntheir target domain's specific needs, leaving the MAS specification unaffected.\nWe identify patterns for mapping the agent execution over the underlying\nconcurrency abstractions, and investigate which concurrency models are\nsupported by some of the most commonly used BDI platforms. Although most\nframeworks support multiple concurrency models, we find that they tend to hide\nthem under the hood, making them opaque to the developer, and effectively\nlimiting the possibility of fine-tuning the MAS.",
        "updated": "2024-04-16 08:55:46 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.10397v1"
    }
]