[
    {
        "title": "Decentralized Unlabeled Multi-agent Pathfinding Via Target And Priority Swapping (With Supplementary)",
        "authors": "Stepan DergachevKonstantin Yakovlev",
        "links": "http://arxiv.org/abs/2408.14948v1",
        "entry_id": "http://arxiv.org/abs/2408.14948v1",
        "pdf_url": "http://arxiv.org/pdf/2408.14948v1",
        "summary": "In this paper we study a challenging variant of the multi-agent pathfinding\nproblem (MAPF), when a set of agents must reach a set of goal locations, but it\ndoes not matter which agent reaches a specific goal - Anonymous MAPF (AMAPF).\nCurrent optimal and suboptimal AMAPF solvers rely on the existence of a\ncentralized controller which is in charge of both target assignment and\npathfinding. We extend the state of the art and present the first AMAPF solver\ncapable of solving the problem at hand in a fully decentralized fashion, when\neach agent makes decisions individually and relies only on the local\ncommunication with the others. The core of our method is a priority and target\nswapping procedure tailored to produce consistent goal assignments (i.e. making\nsure that no two agents are heading towards the same goal). Coupled with an\nestablished rule-based path planning, we end up with a TP-SWAP, an efficient\nand flexible approach to solve decentralized AMAPF. On the theoretical side, we\nprove that TP-SWAP is complete (i.e. TP-SWAP guarantees that each target will\nbe reached by some agent). Empirically, we evaluate TP-SWAP across a wide range\nof setups and compare it to both centralized and decentralized baselines.\nIndeed, TP-SWAP outperforms the fully-decentralized competitor and can even\noutperform the semi-decentralized one (i.e. the one relying on the initial\nconsistent goal assignment) in terms of flowtime (a widespread cost objective\nin MAPF",
        "updated": "2024-08-27 10:45:57 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.14948v1"
    },
    {
        "title": "Multi-Agent Path Finding with Real Robot Dynamics and Interdependent Tasks for Automated Warehouses",
        "authors": "Vassilissa Lehoux-LebacqueTomi SilanderChristelle LoiodiceSeungjoon LeeAlbert WangSofia Michel",
        "links": "http://arxiv.org/abs/2408.14527v1",
        "entry_id": "http://arxiv.org/abs/2408.14527v1",
        "pdf_url": "http://arxiv.org/pdf/2408.14527v1",
        "summary": "Multi-Agent Path Finding (MAPF) is an important optimization problem\nunderlying the deployment of robots in automated warehouses and factories.\nDespite the large body of work on this topic, most approaches make heavy\nsimplifications, both on the environment and the agents, which make the\nresulting algorithms impractical for real-life scenarios. In this paper, we\nconsider a realistic problem of online order delivery in a warehouse, where a\nfleet of robots bring the products belonging to each order from shelves to\nworkstations. This creates a stream of inter-dependent pickup and delivery\ntasks and the associated MAPF problem consists of computing realistic\ncollision-free robot trajectories fulfilling these tasks. To solve this MAPF\nproblem, we propose an extension of the standard Prioritized Planning algorithm\nto deal with the inter-dependent tasks (Interleaved Prioritized Planning) and a\nnovel Via-Point Star (VP*) algorithm to compute an optimal dynamics-compliant\nrobot trajectory to visit a sequence of goal locations while avoiding moving\nobstacles. We prove the completeness of our approach and evaluate it in\nsimulation as well as in a real warehouse.",
        "updated": "2024-08-26 15:13:38 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.14527v1"
    },
    {
        "title": "A Survey on Small-Scale Testbeds for Connected and Automated Vehicles and Robot Swarms",
        "authors": "Armin MokhtarianJianye XuPatrick ScheffeMaximilian KloockSimon SchäferHeeseung BangViet-Anh LeSangeet UlhasJohannes BetzSean WilsonSpring BermanLiam PaullAmanda ProrokBassam Alrifaee",
        "links": "http://dx.doi.org/10.13140/RG.2.2.16176.74248/1",
        "entry_id": "http://arxiv.org/abs/2408.14199v1",
        "pdf_url": "http://arxiv.org/pdf/2408.14199v1",
        "summary": "Connected and automated vehicles and robot swarms hold transformative\npotential for enhancing safety, efficiency, and sustainability in the\ntransportation and manufacturing sectors. Extensive testing and validation of\nthese technologies is crucial for their deployment in the real world. While\nsimulations are essential for initial testing, they often have limitations in\ncapturing the complex dynamics of real-world interactions. This limitation\nunderscores the importance of small-scale testbeds. These testbeds provide a\nrealistic, cost-effective, and controlled environment for testing and\nvalidating algorithms, acting as an essential intermediary between simulation\nand full-scale experiments. This work serves to facilitate researchers' efforts\nin identifying existing small-scale testbeds suitable for their experiments and\nprovide insights for those who want to build their own. In addition, it\ndelivers a comprehensive survey of the current landscape of these testbeds. We\nderive 62 characteristics of testbeds based on the well-known sense-plan-act\nparadigm and offer an online table comparing 22 small-scale testbeds based on\nthese characteristics. The online table is hosted on our designated public\nwebpage www.cpm-remote.de/testbeds, and we invite testbed creators and\ndevelopers to contribute to it. We closely examine nine testbeds in this paper,\ndemonstrating how the derived characteristics can be used to present testbeds.\nFurthermore, we discuss three ongoing challenges concerning small-scale\ntestbeds that we identified, i.e., small-scale to full-scale transition,\nsustainability, and power and resource management.",
        "updated": "2024-08-26 11:54:27 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.14199v1"
    },
    {
        "title": "Decentralized Stochastic Control in Standard Borel Spaces: Centralized MDP Reductions, Near Optimality of Finite Window Local Information, and Q-Learning",
        "authors": "Omar Mrani-ZentarSerdar Yüksel",
        "links": "http://arxiv.org/abs/2408.13828v1",
        "entry_id": "http://arxiv.org/abs/2408.13828v1",
        "pdf_url": "http://arxiv.org/pdf/2408.13828v1",
        "summary": "Decentralized stochastic control problems are intrinsically difficult to\nstudy because of the inapplicability of standard tools from centralized control\nsuch as dynamic programming and the resulting computational complexity. In this\npaper, we address some of these challenges for decentralized stochastic control\nwith Borel spaces under three different but tightly related information\nstructures under a unified theme: the one-step delayed information sharing\npattern, the K-step periodic information sharing pattern, and the completely\ndecentralized information structure where no sharing of information occurs. We\nwill show that the one-step delayed and K-step periodic problems can be reduced\nto a centralized MDP, generalizing prior results which considered finite,\nlinear, or static models, by addressing several measurability questions. The\nseparated nature of policies under both information structures is then\nestablished. We then provide sufficient conditions for the transition kernels\nof both centralized reductions to be weak-Feller, which facilitates rigorous\napproximation and learning theoretic results. We will then show that for the\ncompletely decentralized control problem finite memory local policies are near\noptimal under a joint conditional mixing condition. This is achieved by\nobtaining a bound for finite memory policies which goes to zero as memory size\nincreases. We will also provide a performance bound for the K-periodic problem,\nwhich results from replacing the full common information by a finite sliding\nwindow of information. The latter will depend on the condition of predictor\nstability in expected total variation, which we will establish. We finally show\nthat under the periodic information sharing pattern, a quantized Q-learning\nalgorithm converges asymptotically towards a near optimal solution. Each of the\nabove, to our knowledge, is a new contribution to the literature.",
        "updated": "2024-08-25 13:07:34 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.13828v1"
    },
    {
        "title": "Multi-Agent Target Assignment and Path Finding for Intelligent Warehouse: A Cooperative Multi-Agent Deep Reinforcement Learning Perspective",
        "authors": "Qi LiuJianqi GaoDongjie ZhuXizheng PangPengbin ChenJingxiang GuoYanjie Li",
        "links": "http://arxiv.org/abs/2408.13750v1",
        "entry_id": "http://arxiv.org/abs/2408.13750v1",
        "pdf_url": "http://arxiv.org/pdf/2408.13750v1",
        "summary": "Multi-agent target assignment and path planning (TAPF) are two key problems\nin intelligent warehouse. However, most literature only addresses one of these\ntwo problems separately. In this study, we propose a method to simultaneously\nsolve target assignment and path planning from a perspective of cooperative\nmulti-agent deep reinforcement learning (RL). To the best of our knowledge,\nthis is the first work to model the TAPF problem for intelligent warehouse to\ncooperative multi-agent deep RL, and the first to simultaneously address TAPF\nbased on multi-agent deep RL. Furthermore, previous literature rarely considers\nthe physical dynamics of agents. In this study, the physical dynamics of the\nagents is considered. Experimental results show that our method performs well\nin various task settings, which means that the target assignment is solved\nreasonably well and the planned path is almost shortest. Moreover, our method\nis more time-efficient than baselines.",
        "updated": "2024-08-25 07:32:58 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.13750v1"
    }
]