[
    {
        "title": "Transformer Guided Coevolution: Improved Team Formation in Multiagent Adversarial Games",
        "authors": "Pranav RajbhandariPrithviraj DasguptaDonald Sofge",
        "links": "http://arxiv.org/abs/2410.13769v1",
        "entry_id": "http://arxiv.org/abs/2410.13769v1",
        "pdf_url": "http://arxiv.org/pdf/2410.13769v1",
        "summary": "We consider the problem of team formation within multiagent adversarial\ngames. We propose BERTeam, a novel algorithm that uses a transformer-based deep\nneural network with Masked Language Model training to select the best team of\nplayers from a trained population. We integrate this with coevolutionary deep\nreinforcement learning, which trains a diverse set of individual players to\nchoose teams from. We test our algorithm in the multiagent adversarial game\nMarine Capture-The-Flag, and we find that BERTeam learns non-trivial team\ncompositions that perform well against unseen opponents. For this game, we find\nthat BERTeam outperforms MCAA, an algorithm that similarly optimizes team\nformation.",
        "updated": "2024-10-17 17:06:41 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.13769v1"
    },
    {
        "title": "Rapid and Automated Alloy Design with Graph Neural Network-Powered LLM-Driven Multi-Agent Systems",
        "authors": "Alireza GhafarollahiMarkus J. Buehler",
        "links": "http://arxiv.org/abs/2410.13768v1",
        "entry_id": "http://arxiv.org/abs/2410.13768v1",
        "pdf_url": "http://arxiv.org/pdf/2410.13768v1",
        "summary": "A multi-agent AI model is used to automate the discovery of new metallic\nalloys, integrating multimodal data and external knowledge including insights\nfrom physics via atomistic simulations. Our multi-agent system features three\nkey components: (a) a suite of LLMs responsible for tasks such as reasoning and\nplanning, (b) a group of AI agents with distinct roles and expertise that\ndynamically collaborate, and (c) a newly developed graph neural network (GNN)\nmodel for rapid retrieval of key physical properties. A set of LLM-driven AI\nagents collaborate to automate the exploration of the vast design space of\nMPEAs, guided by predictions from the GNN. We focus on the NbMoTa family of\nbody-centered cubic (bcc) alloys, modeled using an ML-based interatomic\npotential, and target two key properties: the Peierls barrier and solute/screw\ndislocation interaction energy. Our GNN model accurately predicts these\natomic-scale properties, providing a faster alternative to costly brute-force\ncalculations and reducing the computational burden on multi-agent systems for\nphysics retrieval. This AI system revolutionizes materials discovery by\nreducing reliance on human expertise and overcoming the limitations of direct\nall-atom simulations. By synergizing the predictive power of GNNs with the\ndynamic collaboration of LLM-based agents, the system autonomously navigates\nvast alloy design spaces, identifying trends in atomic-scale material\nproperties and predicting macro-scale mechanical strength, as demonstrated by\nseveral computational experiments. This approach accelerates the discovery of\nadvanced alloys and holds promise for broader applications in other complex\nsystems, marking a significant step forward in automated materials design.",
        "updated": "2024-10-17 17:06:26 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.13768v1"
    },
    {
        "title": "MobA: A Two-Level Agent System for Efficient Mobile Task Automation",
        "authors": "Zichen ZhuHao TangYansi LiKunyao LanYixuan JiangHao ZhouYixiao WangSituo ZhangLiangtai SunLu ChenKai Yu",
        "links": "http://arxiv.org/abs/2410.13757v1",
        "entry_id": "http://arxiv.org/abs/2410.13757v1",
        "pdf_url": "http://arxiv.org/pdf/2410.13757v1",
        "summary": "Current mobile assistants are limited by dependence on system APIs or\nstruggle with complex user instructions and diverse interfaces due to\nrestricted comprehension and decision-making abilities. To address these\nchallenges, we propose MobA, a novel Mobile phone Agent powered by multimodal\nlarge language models that enhances comprehension and planning capabilities\nthrough a sophisticated two-level agent architecture. The high-level Global\nAgent (GA) is responsible for understanding user commands, tracking history\nmemories, and planning tasks. The low-level Local Agent (LA) predicts detailed\nactions in the form of function calls, guided by sub-tasks and memory from the\nGA. Integrating a Reflection Module allows for efficient task completion and\nenables the system to handle previously unseen complex tasks. MobA demonstrates\nsignificant improvements in task execution efficiency and completion rate in\nreal-life evaluations, underscoring the potential of MLLM-empowered mobile\nassistants.",
        "updated": "2024-10-17 16:53:50 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.13757v1"
    },
    {
        "title": "EFX Exists for Three Types of Agents",
        "authors": "Vishwa Prakash H. V.Pratik GhosalPrajakta NimbhorkarNithin Varma",
        "links": "http://arxiv.org/abs/2410.13580v1",
        "entry_id": "http://arxiv.org/abs/2410.13580v1",
        "pdf_url": "http://arxiv.org/pdf/2410.13580v1",
        "summary": "In this paper, we study the problem of finding an envy-free allocation of\nindivisible goods among multiple agents. EFX, which stands for envy-freeness up\nto any good, is a well-studied relaxation of the envy-free allocation problem\nand has been shown to exist for specific scenarios. For instance, EFX is known\nto exist when there are only three agents [Chaudhury et al, EC 2020], and for\nany number of agents when there are only two types of valuations [Mahara,\nDiscret. Appl. Math 2023].\n  We show that EFX allocations exist for any number of agents when there are at\nmost three types of additive valuations.",
        "updated": "2024-10-17 14:15:08 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.13580v1"
    },
    {
        "title": "Byzantine-Resilient Output Optimization of Multiagent via Self-Triggered Hybrid Detection Approach",
        "authors": "Chenhang YanLiping YanYuezu LvBolei DongYuanqing Xia",
        "links": "http://arxiv.org/abs/2410.13454v1",
        "entry_id": "http://arxiv.org/abs/2410.13454v1",
        "pdf_url": "http://arxiv.org/pdf/2410.13454v1",
        "summary": "How to achieve precise distributed optimization despite unknown attacks,\nespecially the Byzantine attacks, is one of the critical challenges for\nmultiagent systems. This paper addresses a distributed resilient optimization\nfor linear heterogeneous multi-agent systems faced with adversarial threats. We\nestablish a framework aimed at realizing resilient optimization for\ncontinuous-time systems by incorporating a novel self-triggered hybrid\ndetection approach. The proposed hybrid detection approach is able to identify\nattacks on neighbors using both error thresholds and triggering intervals,\nthereby optimizing the balance between effective attack detection and the\nreduction of excessive communication triggers. Through using an edge-based\nadaptive self-triggered approach, each agent can receive its neighbors'\ninformation and determine whether these information is valid. If any neighbor\nprove invalid, each normal agent will isolate that neighbor by disconnecting\ncommunication along that specific edge. Importantly, our adaptive algorithm\nguarantees the accuracy of the optimization solution even when an agent is\nisolated by its neighbors.",
        "updated": "2024-10-17 11:31:22 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.13454v1"
    }
]