[
    {
        "title": "Magic Insert: Style-Aware Drag-and-Drop",
        "authors": "Nataniel RuizYuanzhen LiNeal WadhwaYael PritchMichael RubinsteinDavid E. JacobsShlomi Fruchter",
        "links": "http://arxiv.org/abs/2407.02489v1",
        "entry_id": "http://arxiv.org/abs/2407.02489v1",
        "pdf_url": "http://arxiv.org/pdf/2407.02489v1",
        "summary": "We present Magic Insert, a method for dragging-and-dropping subjects from a\nuser-provided image into a target image of a different style in a physically\nplausible manner while matching the style of the target image. This work\nformalizes the problem of style-aware drag-and-drop and presents a method for\ntackling it by addressing two sub-problems: style-aware personalization and\nrealistic object insertion in stylized images. For style-aware personalization,\nour method first fine-tunes a pretrained text-to-image diffusion model using\nLoRA and learned text tokens on the subject image, and then infuses it with a\nCLIP representation of the target style. For object insertion, we use\nBootstrapped Domain Adaption to adapt a domain-specific photorealistic object\ninsertion model to the domain of diverse artistic styles. Overall, the method\nsignificantly outperforms traditional approaches such as inpainting. Finally,\nwe present a dataset, SubjectPlop, to facilitate evaluation and future progress\nin this area. Project page: https://magicinsert.github.io/",
        "updated": "2024-07-02 17:59:50 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.02489v1"
    },
    {
        "title": "What Should Be Considered to Support well-being with AI: Considerations Based on Responsible Research and Innovation",
        "authors": "Yuri Nakao",
        "links": "http://arxiv.org/abs/2407.02381v2",
        "entry_id": "http://arxiv.org/abs/2407.02381v2",
        "pdf_url": "http://arxiv.org/pdf/2407.02381v2",
        "summary": "Achieving people's well-being with AI systems requires that each user is\nguided to a healthier lifestyle in a way that is appropriate for her or him.\nAlthough well-being has diverse definitions~\\cite{calvo2014positive}, leading a\nhealthy lifestyle is one of the most representative aspects of well-being. A\nhealthy lifestyle often varies from individual to individual and cannot be\ndefined in a top-down manner. For example, while moderate exercise is important\nfor almost everyone, how much exercise is needed and at what time of day varies\nfrom person to person. A habit that is easy for one person may be very\ndifficult for another. Habits that are too difficult do not lead to a mentally\nhealthy lifestyle.",
        "updated": "2024-07-03 13:59:38 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.02381v2"
    },
    {
        "title": "Talking to Machines: do you read me?",
        "authors": "Lina M. Rojas-Barahona",
        "links": "http://arxiv.org/abs/2407.02354v1",
        "entry_id": "http://arxiv.org/abs/2407.02354v1",
        "pdf_url": "http://arxiv.org/pdf/2407.02354v1",
        "summary": "In this dissertation I would like to guide the reader to the research on\ndialogue but more precisely the research I have conducted during my career\nsince my PhD thesis. Starting from modular architectures with machine\nlearning/deep learning and reinforcement learning to end-to-end deep neural\nnetworks. Besides my work as research associate, I also present the work I have\nsupervised in the last years.\n  I review briefly the state of the art and highlight the open research\nproblems on conversational agents. Afterwards, I present my contribution to\nTask-Oriented Dialogues (TOD), both as research associate and as the industrial\nsupervisor of CIFRE theses. I discuss conversational QA. Particularly, I\npresent the work of two PhD candidates Thibault Cordier and Sebastien Montella;\nas well as the work of the young researcher Quentin Brabant. Finally, I present\nthe scientific project, where I discuss about Large Language Models (LLMs) for\nTask-Oriented Dialogue and Multimodal Task-Oriented Dialogue.",
        "updated": "2024-07-02 15:19:46 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.02354v1"
    },
    {
        "title": "The Equality Maturity Model: an actionable tool to advance gender balance in leadership and participation roles",
        "authors": "Paloma DíazPaula Alexandra SilvaKatja Tuma",
        "links": "http://arxiv.org/abs/2407.02305v1",
        "entry_id": "http://arxiv.org/abs/2407.02305v1",
        "pdf_url": "http://arxiv.org/pdf/2407.02305v1",
        "summary": "The underrepresentation of women in Computer Science and Engineering is a\npervasive issue, impacting the enrolment and graduation rates of female\nstudents as well as the presence of women in leadership positions in academia\nand industry. The European Network For Gender Balance in Informatics (EUGAIN)\nCOST action seeks to share data, experiences, best practices, and lessons from\nfailures, and to provide actionable tools that may contribute to the\nadvancement of gender balance in the field. This paper summarises results from\nthe Ph.D./Postdoc to Professor workgroup that were gathered in two booklets of\nbest practices. Specifically, we introduce the Equality Maturity Model (EMM), a\nconceptual tool aimed at supporting organisations in measuring how they are\ndoing concerning equality and identifying potential areas of improvement and\nthat was inspired by both booklets.",
        "updated": "2024-07-02 14:41:07 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.02305v1"
    },
    {
        "title": "IFTT-PIN: A Self-Calibrating PIN-Entry Method",
        "authors": "Kathryn McConkeyTalha Enes AyranciMohamed KhamisJonathan Grizou",
        "links": "http://arxiv.org/abs/2407.02269v1",
        "entry_id": "http://arxiv.org/abs/2407.02269v1",
        "pdf_url": "http://arxiv.org/pdf/2407.02269v1",
        "summary": "Personalising an interface to the needs and preferences of a user often\nincurs additional interaction steps. In this paper, we demonstrate a novel\nmethod that enables the personalising of an interface without the need for\nexplicit calibration procedures, via a process we call self-calibration. A\nsecond-order effect of self-calibration is that an outside observer cannot\neasily infer what a user is trying to achieve because they cannot interpret the\nuser's actions. To explore this security angle, we developed IFTT-PIN (If This\nThen PIN) as the first self-calibrating PIN-entry method. When using IFTT-PIN,\nusers are free to choose any button for any meaning without ever explicitly\ncommunicating their choice to the machine. IFTT-PIN infers both the user's PIN\nand their preferred button mapping at the same time. This paper presents the\nconcept, implementation, and interactive demonstrations of IFTT-PIN, as well as\nan evaluation against shoulder surfing attacks. Our study (N=24) shows that by\nadding self-calibration to an existing PIN entry method, IFTT-PIN statistically\nsignificantly decreased PIN attack decoding rate by ca. 8.5 times (p=1.1e-9),\nwhile only decreasing the PIN entry encoding rate by ca. 1.4 times (p=0.02),\nleading to a positive security-usability trade-off. IFTT-PIN's entry rate\nsignificantly improved 21 days after first exposure (p=3.6e-6) to the method,\nsuggesting self-calibrating interfaces are memorable despite using an initially\nundefined user interface. Self-calibration methods might lead to novel\nopportunities for interaction that are more inclusive and versatile, a\npotentially interesting challenge for the community. A short introductory video\nis available at https://youtu.be/pP5sfniNRns.",
        "updated": "2024-07-02 13:58:28 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.02269v1"
    }
]