[
    {
        "title": "Impact of the Network Size and Frequency of Information Receipt on Polarization in Social Networks",
        "authors": "Sudhakar KrisharaoShaja Arul Selvamani",
        "links": "http://dx.doi.org/10.1155/2024/4742401",
        "entry_id": "http://arxiv.org/abs/2407.01788v1",
        "pdf_url": "http://arxiv.org/pdf/2407.01788v1",
        "summary": "Opinion Dynamics is an interdisciplinary area of research. Psychology and\nSociology have proposed models of how individuals form opinions and how social\ninteractions influence this process. Socio-Physicists have interpreted patterns\nin opinion formation as arising from non-linearity in the underlying process,\nshaping the models. Agent-based modeling has offered a platform to study the\nOpinion Dynamics of large groups. This paper recasts recent models in opinion\nformation into a proper dynamical system, injecting the idea of clock time into\nevolving opinions. The time interval between successive receipts of new\ninformation (frequency of information receipts) becomes a factor to study.\nSocial media has shrunk time intervals between information receipts, increasing\ntheir frequency. The recast models show that shorter intervals and larger\nnetworks increase an individual's propensity for polarization, defined as an\ninability to hold a neutral opinion. A Polarization number based on\nsociological parameters is proposed, with critical values beyond which\nindividuals are prone to polarization, depending on psychological parameters.\nReduced time intervals and larger interacting groups can push the Polarization\nnumber to critical values, contributing to polarization. The Extent of\nPolarization is defined as the width of the region around neutral within which\nan individual cannot hold an opinion. Results are reported for model parameters\nfound in the literature. The findings offer an opportunity to adjust model\nparameters to align with empirical evidence, aiding the study of Opinion\nDynamics in large social networks using Agent-Based Modeling.",
        "updated": "2024-07-01 20:30:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.01788v1"
    },
    {
        "title": "Distributed Instruments for Planetary Surface Science: Scientific Opportunities and Technology Feasibility",
        "authors": "Federico RossiRobert C. AndersonSaptarshi BandyopadhyayErik BrandonAshish GoelJoshua Vander HookMichael MischnaMichaela VillarrealMark Wronkiewicz",
        "links": "http://arxiv.org/abs/2407.01757v1",
        "entry_id": "http://arxiv.org/abs/2407.01757v1",
        "pdf_url": "http://arxiv.org/pdf/2407.01757v1",
        "summary": "In this paper, we assess the scientific promise and technology feasibility of\ndistributed instruments for planetary science. A distributed instrument is an\ninstrument designed to collect spatially and temporally correlated data from\nmultiple networked, geographically distributed point sensors. Distributed\ninstruments are ubiquitous in Earth science, where they are routinely employed\nfor weather and climate science, seismic studies and resource prospecting, and\ndetection of industrial emissions. However, to date, their adoption in\nplanetary surface science has been minimal. It is natural to ask whether this\nlack of adoption is driven by low potential to address high-priority questions\nin planetary science; immature technology; or both. To address this question,\nwe survey high-priority planetary science questions that are uniquely\nwell-suited to distributed instruments. We identify four areas of research\nwhere distributed instruments hold promise to unlock answers that are largely\ninaccessible to monolithic sensors, namely, weather and climate studies of\nMars; localization of seismic events on rocky and icy bodies; localization of\ntrace gas emissions, primarily on Mars; and magnetometry studies of internal\ncomposition. Next, we survey enabling technologies for distributed sensors and\nassess their maturity. We identify sensor placement (including descent and\nlanding on planetary surfaces), power, and instrument autonomy as three key\nareas requiring further investment to enable future distributed instruments.\nOverall, this work shows that distributed instruments hold great promise for\nplanetary science, and paves the way for follow-on studies of future\ndistributed instruments for Solar System in-situ science.",
        "updated": "2024-07-01 19:41:41 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.01757v1"
    },
    {
        "title": "Online Learning of Temporal Dependencies for Sustainable Foraging Problem",
        "authors": "John PayneAishwaryaprajnaPeter R. Lewis",
        "links": "http://arxiv.org/abs/2407.01501v1",
        "entry_id": "http://arxiv.org/abs/2407.01501v1",
        "pdf_url": "http://arxiv.org/pdf/2407.01501v1",
        "summary": "The sustainable foraging problem is a dynamic environment testbed for\nexploring the forms of agent cognition in dealing with social dilemmas in a\nmulti-agent setting. The agents need to resist the temptation of individual\nrewards through foraging and choose the collective long-term goal of\nsustainability. We investigate methods of online learning in Neuro-Evolution\nand Deep Recurrent Q-Networks to enable agents to attempt the problem one-shot\nas is often required by wicked social problems. We further explore if learning\ntemporal dependencies with Long Short-Term Memory may be able to aid the agents\nin developing sustainable foraging strategies in the long term. It was found\nthat the integration of Long Short-Term Memory assisted agents in developing\nsustainable strategies for a single agent, however failed to assist agents in\nmanaging the social dilemma that arises in the multi-agent scenario.",
        "updated": "2024-07-01 17:47:31 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.01501v1"
    },
    {
        "title": "Optimizing Age of Information in Vehicular Edge Computing with Federated Graph Neural Network Multi-Agent Reinforcement Learning",
        "authors": "Wenhua WangQiong WuPingyi FanNan ChengWen ChenJiangzhou WangKhaled B. Letaief",
        "links": "http://arxiv.org/abs/2407.02342v1",
        "entry_id": "http://arxiv.org/abs/2407.02342v1",
        "pdf_url": "http://arxiv.org/pdf/2407.02342v1",
        "summary": "With the rapid development of intelligent vehicles and Intelligent Transport\nSystems (ITS), the sensors such as cameras and LiDAR installed on intelligent\nvehicles provides higher capacity of executing computation-intensive and\ndelay-sensitive tasks, thereby raising deployment costs. To address this issue,\nVehicular Edge Computing (VEC) has been proposed to process data through Road\nSide Units (RSUs) to support real-time applications. This paper focuses on the\nAge of Information (AoI) as a key metric for data freshness and explores task\noffloading issues for vehicles under RSU communication resource constraints. We\nadopt a Multi-agent Deep Reinforcement Learning (MADRL) approach, allowing\nvehicles to autonomously make optimal data offloading decisions. However, MADRL\nposes risks of vehicle information leakage during communication learning and\ncentralized training. To mitigate this, we employ a Federated Learning (FL)\nframework that shares model parameters instead of raw data to protect the\nprivacy of vehicle users. Building on this, we propose an innovative\ndistributed federated learning framework combining Graph Neural Networks (GNN),\nnamed Federated Graph Neural Network Multi-Agent Reinforcement Learning\n(FGNN-MADRL), to optimize AoI across the system. For the first time, road\nscenarios are constructed as graph data structures, and a GNN-based federated\nlearning framework is proposed, effectively combining distributed and\ncentralized federated aggregation. Furthermore, we propose a new MADRL\nalgorithm that simplifies decision making and enhances offloading efficiency,\nfurther reducing the decision complexity. Simulation results demonstrate the\nsuperiority of our proposed approach to other methods through simulations.",
        "updated": "2024-07-01 15:37:38 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.02342v1"
    },
    {
        "title": "Coordination Failure in Cooperative Offline MARL",
        "authors": "Callum Rhys TilburyClaude FormanekLouise BeyersJonathan P. ShockArnu Pretorius",
        "links": "http://arxiv.org/abs/2407.01343v1",
        "entry_id": "http://arxiv.org/abs/2407.01343v1",
        "pdf_url": "http://arxiv.org/pdf/2407.01343v1",
        "summary": "Offline multi-agent reinforcement learning (MARL) leverages static datasets\nof experience to learn optimal multi-agent control. However, learning from\nstatic data presents several unique challenges to overcome. In this paper, we\nfocus on coordination failure and investigate the role of joint actions in\nmulti-agent policy gradients with offline data, focusing on a common setting we\nrefer to as the 'Best Response Under Data' (BRUD) approach. By using two-player\npolynomial games as an analytical tool, we demonstrate a simple yet overlooked\nfailure mode of BRUD-based algorithms, which can lead to catastrophic\ncoordination failure in the offline setting. Building on these insights, we\npropose an approach to mitigate such failure, by prioritising samples from the\ndataset based on joint-action similarity during policy learning and demonstrate\nits effectiveness in detailed experiments. More generally, however, we argue\nthat prioritised dataset sampling is a promising area for innovation in offline\nMARL that can be combined with other effective approaches such as critic and\npolicy regularisation. Importantly, our work shows how insights drawn from\nsimplified, tractable games can lead to useful, theoretically grounded insights\nthat transfer to more complex contexts. A core dimension of offering is an\ninteractive notebook, from which almost all of our results can be reproduced,\nin a browser.",
        "updated": "2024-07-01 14:51:29 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.01343v1"
    }
]