[
    {
        "title": "Engineering consensus in static networks with unknown disruptors",
        "authors": "Agathe BouisChristopher LoweRuaridh A. ClarkMalcolm Macdonald",
        "links": "http://arxiv.org/abs/2403.05272v1",
        "entry_id": "http://arxiv.org/abs/2403.05272v1",
        "pdf_url": "http://arxiv.org/pdf/2403.05272v1",
        "summary": "Distributed control increases system scalability, flexibility, and\nredundancy. Foundational to such decentralisation is consensus formation, by\nwhich decision-making and coordination are achieved. However, decentralised\nmulti-agent systems are inherently vulnerable to disruption. To develop a\nresilient consensus approach, inspiration is taken from the study of social\nsystems and their dynamics; specifically, the Deffuant Model. A dynamic\nalgorithm is presented enabling efficient consensus to be reached with an\nunknown number of disruptors present within a multi-agent system. By inverting\ntypical social tolerance, agents filter out extremist non-standard opinions\nthat would drive them away from consensus. This approach allows distributed\nsystems to deal with unknown disruptions, without knowledge of the network\ntopology or the numbers and behaviours of the disruptors. A disruptor-agnostic\nalgorithm is particularly suitable to real-world applications where this\ninformation is typically unknown. Faster and tighter convergence can be\nachieved across a range of scenarios with the social dynamics inspired\nalgorithm, compared with standard Mean-Subsequence-Reduced-type methods.",
        "updated": "2024-03-08 12:51:10 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.05272v1"
    },
    {
        "title": "Control-based Graph Embeddings with Data Augmentation for Contrastive Learning",
        "authors": "Obaid Ullah AhmadAnwar SaidMudassir ShabbirWaseem AbbasXenofon Koutsoukos",
        "links": "http://arxiv.org/abs/2403.04923v1",
        "entry_id": "http://arxiv.org/abs/2403.04923v1",
        "pdf_url": "http://arxiv.org/pdf/2403.04923v1",
        "summary": "In this paper, we study the problem of unsupervised graph representation\nlearning by harnessing the control properties of dynamical networks defined on\ngraphs. Our approach introduces a novel framework for contrastive learning, a\nwidely prevalent technique for unsupervised representation learning. A crucial\nstep in contrastive learning is the creation of 'augmented' graphs from the\ninput graphs. Though different from the original graphs, these augmented graphs\nretain the original graph's structural characteristics. Here, we propose a\nunique method for generating these augmented graphs by leveraging the control\nproperties of networks. The core concept revolves around perturbing the\noriginal graph to create a new one while preserving the controllability\nproperties specific to networks and graphs. Compared to the existing methods,\nwe demonstrate that this innovative approach enhances the effectiveness of\ncontrastive learning frameworks, leading to superior results regarding the\naccuracy of the classification tasks. The key innovation lies in our ability to\ndecode the network structure using these control properties, opening new\navenues for unsupervised graph representation learning.",
        "updated": "2024-03-07 22:14:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.04923v1"
    },
    {
        "title": "Stochastic Games for Interactive Manipulation Domains",
        "authors": "Karan MuvvalaAndrew M. WellsMorteza LahijanianLydia E. KavrakiMoshe Y. Vardi",
        "links": "http://arxiv.org/abs/2403.04910v1",
        "entry_id": "http://arxiv.org/abs/2403.04910v1",
        "pdf_url": "http://arxiv.org/pdf/2403.04910v1",
        "summary": "As robots become more prevalent, the complexity of robot-robot, robot-human,\nand robot-environment interactions increases. In these interactions, a robot\nneeds to consider not only the effects of its own actions, but also the effects\nof other agents' actions and the possible interactions between agents. Previous\nworks have considered reactive synthesis, where the human/environment is\nmodeled as a deterministic, adversarial agent; as well as probabilistic\nsynthesis, where the human/environment is modeled via a Markov chain. While\nthey provide strong theoretical frameworks, there are still many aspects of\nhuman-robot interaction that cannot be fully expressed and many assumptions\nthat must be made in each model. In this work, we propose stochastic games as a\ngeneral model for human-robot interaction, which subsumes the expressivity of\nall previous representations. In addition, it allows us to make fewer modeling\nassumptions and leads to more natural and powerful models of interaction. We\nintroduce the semantics of this abstraction and show how existing tools can be\nutilized to synthesize strategies to achieve complex tasks with guarantees.\nFurther, we discuss the current computational limitations and improve the\nscalability by two orders of magnitude by a new way of constructing models for\nPRISM-games.",
        "updated": "2024-03-07 21:46:18 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.04910v1"
    },
    {
        "title": "Distributed Multi-objective Optimization in Cyber-Physical Energy Systems",
        "authors": "Sanja StarkEmilie FrostMarvin Nebel-Wenner",
        "links": "http://arxiv.org/abs/2403.04627v1",
        "entry_id": "http://arxiv.org/abs/2403.04627v1",
        "pdf_url": "http://arxiv.org/pdf/2403.04627v1",
        "summary": "Managing complex Cyber-Physical Energy Systems (CPES) requires solving\nvarious optimization problems with multiple objectives and constraints. As\ndistributed control architectures are becoming more popular in CPES for certain\ntasks due to their flexibility, robustness, and privacy protection,\nmulti-objective optimization must also be distributed. For this purpose, we\npresent MO-COHDA, a fully distributed, agent-based algorithm, for solving\nmulti-objective optimization problems of CPES. MO-COHDA allows an easy and\nflexible adaptation to different use cases and integration of custom\nfunctionality. To evaluate the effectiveness of MO-COHDA, we compare it to a\ncentral NSGA-2 algorithm using multi-objective benchmark functions from the ZDT\nproblem suite. The results show that MO-COHDA can approximate the reference\nfront of the benchmark problems well and is suitable for solving\nmulti-objective optimization problems. In addition, an example use case of\nscheduling a group of generation units while optimizing three different\nobjectives was evaluated to show how MO-COHDA can be easily applied to\nreal-world optimization problems in CPES.",
        "updated": "2024-03-07 16:12:54 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.04627v1"
    },
    {
        "title": "Cooperative Bayesian Optimization for Imperfect Agents",
        "authors": "Ali KhoshvishkaiePetrus MikkolaPierre-Alexandre MurenaSamuel Kaski",
        "links": "http://dx.doi.org/10.1007/978-3-031-43412-9_28",
        "entry_id": "http://arxiv.org/abs/2403.04442v1",
        "pdf_url": "http://arxiv.org/pdf/2403.04442v1",
        "summary": "We introduce a cooperative Bayesian optimization problem for optimizing\nblack-box functions of two variables where two agents choose together at which\npoints to query the function but have only control over one variable each. This\nsetting is inspired by human-AI teamwork, where an AI-assistant helps its human\nuser solve a problem, in this simplest case, collaborative optimization. We\nformulate the solution as sequential decision-making, where the agent we\ncontrol models the user as a computationally rational agent with prior\nknowledge about the function. We show that strategic planning of the queries\nenables better identification of the global maximum of the function as long as\nthe user avoids excessive exploration. This planning is made possible by using\nBayes Adaptive Monte Carlo planning and by endowing the agent with a user model\nthat accounts for conservative belief updates and exploratory sampling of the\npoints to query.",
        "updated": "2024-03-07 12:16:51 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.04442v1"
    }
]