[
    {
        "title": "TrustAgent: Towards Safe and Trustworthy LLM-based Agents through Agent Constitution",
        "authors": "Wenyue HuaXianjun YangZelong LiCheng WeiYongfeng Zhang",
        "links": "http://arxiv.org/abs/2402.01586v1",
        "entry_id": "http://arxiv.org/abs/2402.01586v1",
        "pdf_url": "http://arxiv.org/pdf/2402.01586v1",
        "summary": "The emergence of LLM-based agents has garnered considerable attention, yet\ntheir trustworthiness remains an under-explored area. As agents can directly\ninteract with the physical environment, their reliability and safety is\ncritical. This paper presents an Agent-Constitution-based agent framework,\nTrustAgent, an initial investigation into improving the safety dimension of\ntrustworthiness in LLM-based agents. This framework consists of threefold\nstrategies: pre-planning strategy which injects safety knowledge to the model\nprior to plan generation, in-planning strategy which bolsters safety during\nplan generation, and post-planning strategy which ensures safety by\npost-planning inspection. Through experimental analysis, we demonstrate how\nthese approaches can effectively elevate an LLM agent's safety by identifying\nand preventing potential dangers. Furthermore, we explore the intricate\nrelationships between safety and helpfulness, and between the model's reasoning\nability and its efficacy as a safe agent. This paper underscores the imperative\nof integrating safety awareness and trustworthiness into the design and\ndeployment of LLM-based agents, not only to enhance their performance but also\nto ensure their responsible integration into human-centric environments. Data\nand code are available at https://github.com/agiresearch/TrustAgent.",
        "updated": "2024-02-02 17:26:23 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.01586v1"
    },
    {
        "title": "Privacy-Preserving Distributed Learning for Residential Short-Term Load Forecasting",
        "authors": "Yi DongYingjie WangMariana GamaMustafa A. MustafaGeert DeconinckXiaowei Huang",
        "links": "http://arxiv.org/abs/2402.01546v1",
        "entry_id": "http://arxiv.org/abs/2402.01546v1",
        "pdf_url": "http://arxiv.org/pdf/2402.01546v1",
        "summary": "In the realm of power systems, the increasing involvement of residential\nusers in load forecasting applications has heightened concerns about data\nprivacy. Specifically, the load data can inadvertently reveal the daily\nroutines of residential users, thereby posing a risk to their property\nsecurity. While federated learning (FL) has been employed to safeguard user\nprivacy by enabling model training without the exchange of raw data, these FL\nmodels have shown vulnerabilities to emerging attack techniques, such as Deep\nLeakage from Gradients and poisoning attacks. To counteract these, we initially\nemploy a Secure-Aggregation (SecAgg) algorithm that leverages multiparty\ncomputation cryptographic techniques to mitigate the risk of gradient leakage.\nHowever, the introduction of SecAgg necessitates the deployment of additional\nsub-center servers for executing the multiparty computation protocol, thereby\nescalating computational complexity and reducing system robustness, especially\nin scenarios where one or more sub-centers are unavailable. To address these\nchallenges, we introduce a Markovian Switching-based distributed training\nframework, the convergence of which is substantiated through rigorous\ntheoretical analysis. The Distributed Markovian Switching (DMS) topology shows\nstrong robustness towards the poisoning attacks as well. Case studies employing\nreal-world power system load data validate the efficacy of our proposed\nalgorithm. It not only significantly minimizes communication complexity but\nalso maintains accuracy levels comparable to traditional FL methods, thereby\nenhancing the scalability of our load forecasting algorithm.",
        "updated": "2024-02-02 16:39:08 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.01546v1"
    },
    {
        "title": "Guidance Graph Optimization for Lifelong Multi-Agent Path Finding",
        "authors": "Yulun ZhangHe JiangVarun BhattStefanos NikolaidisJiaoyang Li",
        "links": "http://arxiv.org/abs/2402.01446v1",
        "entry_id": "http://arxiv.org/abs/2402.01446v1",
        "pdf_url": "http://arxiv.org/pdf/2402.01446v1",
        "summary": "We study how to use guidance to improve the throughput of lifelong\nMulti-Agent Path Finding (MAPF). Previous studies have demonstrated that while\nincorporating guidance, such as highways, can accelerate MAPF algorithms, this\noften results in a trade-off with solution quality. In addition, how to\ngenerate good guidance automatically remains largely unexplored, with current\nmethods falling short of surpassing manually designed ones. In this work, we\nintroduce the directed guidance graph as a versatile representation of guidance\nfor lifelong MAPF, framing Guidance Graph Optimization (GGO) as the task of\noptimizing its edge weights. We present two GGO algorithms to automatically\ngenerate guidance for arbitrary lifelong MAPF algorithms and maps. The first\nmethod directly solves GGO by employing CMA-ES, a black-box optimization\nalgorithm. The second method, PIU, optimizes an update model capable of\ngenerating guidance, demonstrating the ability to transfer optimized guidance\ngraphs to larger maps with similar layouts. Empirically, we show that (1) our\nguidance graphs improve the throughput of three representative lifelong MAPF\nalgorithms in four benchmark maps, and (2) our update model can generate\nguidance graphs for as large as $93 \\times 91$ maps and as many as 3000 agents.",
        "updated": "2024-02-02 14:38:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.01446v1"
    },
    {
        "title": "A Unified Framework for Gradient-based Clustering of Distributed Data",
        "authors": "Aleksandar ArmackiDragana BajovićDušan JakovetićSoummya Kar",
        "links": "http://arxiv.org/abs/2402.01302v1",
        "entry_id": "http://arxiv.org/abs/2402.01302v1",
        "pdf_url": "http://arxiv.org/pdf/2402.01302v1",
        "summary": "We develop a family of distributed clustering algorithms that work over\nnetworks of users. In the proposed scenario, users contain a local dataset and\ncommunicate only with their immediate neighbours, with the aim of finding a\nclustering of the full, joint data. The proposed family, termed Distributed\nGradient Clustering (DGC-$\\mathcal{F}_\\rho$), is parametrized by $\\rho \\geq 1$,\ncontroling the proximity of users' center estimates, with $\\mathcal{F}$\ndetermining the clustering loss. Specialized to popular clustering losses like\n$K$-means and Huber loss, DGC-$\\mathcal{F}_\\rho$ gives rise to novel\ndistributed clustering algorithms DGC-KM$_\\rho$ and DGC-HL$_\\rho$, while a\nnovel clustering loss based on the logistic function leads to DGC-LL$_\\rho$. We\nprovide a unified analysis and establish several strong results, under mild\nassumptions. First, the sequence of centers generated by the methods converges\nto a well-defined notion of fixed point, under any center initialization and\nvalue of $\\rho$. Second, as $\\rho$ increases, the family of fixed points\nproduced by DGC-$\\mathcal{F}_\\rho$ converges to a notion of consensus fixed\npoints. We show that consensus fixed points of DGC-$\\mathcal{F}_{\\rho}$ are\nequivalent to fixed points of gradient clustering over the full data,\nguaranteeing a clustering of the full data is produced. For the special case of\nBregman losses, we show that our fixed points converge to the set of Lloyd\npoints. Numerical experiments on real data confirm our theoretical findings and\ndemonstrate strong performance of the methods.",
        "updated": "2024-02-02 10:44:42 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.01302v1"
    },
    {
        "title": "Minimizing Regret in Billboard Advertisement under Zonal Influence Constraint",
        "authors": "Dildar AliSuman BanerjeeYamuna Prasad",
        "links": "http://arxiv.org/abs/2402.01294v1",
        "entry_id": "http://arxiv.org/abs/2402.01294v1",
        "pdf_url": "http://arxiv.org/pdf/2402.01294v1",
        "summary": "In a typical billboard advertisement technique, a number of digital\nbillboards are owned by an influence provider, and many advertisers approach\nthe influence provider for a specific number of views of their advertisement\ncontent on a payment basis. If the influence provider provides the demanded or\nmore influence, then he will receive the full payment or else a partial\npayment. In the context of an influence provider, if he provides more or less\nthan an advertiser's demanded influence, it is a loss for him. This is\nformalized as 'Regret', and naturally, in the context of the influence\nprovider, the goal will be to allocate the billboard slots among the\nadvertisers such that the total regret is minimized. In this paper, we study\nthis problem as a discrete optimization problem and propose four solution\napproaches. The first one selects the billboard slots from the available ones\nin an incremental greedy manner, and we call this method the Budget Effective\nGreedy approach. In the second one, we introduce randomness with the first one,\nwhere we perform the marginal gain computation for a sample of randomly chosen\nbillboard slots. The remaining two approaches are further improvements over the\nsecond one. We analyze all the algorithms to understand their time and space\ncomplexity. We implement them with real-life trajectory and billboard datasets\nand conduct a number of experiments. It has been observed that the randomized\nbudget effective greedy approach takes reasonable computational time while\nminimizing the regret.",
        "updated": "2024-02-02 10:31:28 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.01294v1"
    }
]