[
    {
        "title": "Role-Play Zero-Shot Prompting with Large Language Models for Open-Domain Human-Machine Conversation",
        "authors": "Ahmed NjifenjouVirgile SucalBassam JabaianFabrice Lefèvre",
        "links": "http://arxiv.org/abs/2406.18460v1",
        "entry_id": "http://arxiv.org/abs/2406.18460v1",
        "pdf_url": "http://arxiv.org/pdf/2406.18460v1",
        "summary": "Recently, various methods have been proposed to create open-domain\nconversational agents with Large Language Models (LLMs). These models are able\nto answer user queries, but in a one-way Q&A format rather than a true\nconversation. Fine-tuning on particular datasets is the usual way to modify\ntheir style to increase conversational ability, but this is expensive and\nusually only available in a few languages. In this study, we explore role-play\nzero-shot prompting as an efficient and cost-effective solution for open-domain\nconversation, using capable multilingual LLMs (Beeching et al., 2023) trained\nto obey instructions. We design a prompting system that, when combined with an\ninstruction-following model - here Vicuna (Chiang et al., 2023) - produces\nconversational agents that match and even surpass fine-tuned models in human\nevaluation in French in two different tasks.",
        "updated": "2024-06-26 16:10:53 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.18460v1"
    },
    {
        "title": "An interactive framework for the evaluation and detection of stereoacuity threshold under ambient lighting",
        "authors": "Kritika LohiaRijul Saurabh SoansRohit SaxenaTapan Kumar Gandhi",
        "links": "http://arxiv.org/abs/2406.18336v1",
        "entry_id": "http://arxiv.org/abs/2406.18336v1",
        "pdf_url": "http://arxiv.org/pdf/2406.18336v1",
        "summary": "Objective: Our study aims to provide a novel framework for the continuous\nevaluation of stereoacuity under ambient lighting conditions using Bayesian\ninference.\n  Methods: We applied a combination of psychophysical and expected entropy\nminimization procedures for the computation of a continuous stereoacuity\nthreshold. Subsequently, we evaluated the effect of ambient lighting during\nstereoacuity testing (ST) by adopting a bisection-matching based adaptive gamma\ncalibration (AGC). Participants ($N=187$) including visually healthy controls\n($N=51$), patients with Intermittent Divergent Squint (IDS; $N=45$), and\ncontrols with induced anisometropia (IA; $N=91$) performed ST with and without\nAGC under two lighting conditions: completely dark (20 cd/m$^2$) and normally\nlit (130 cd/m$^2$) rooms.\n  Results: Our framework demonstrated \"excellent\" reliability ($> 0.9$) and a\npositive correlation with TNO (a clinical stereo test), regardless of whether\nAGC was conducted. However, when AGC is not performed, significant differences\n(Friedman $X_{r}^{2} = 28.015$; $p<0.00001$; Bland-Altman bias: 30 arc-sec)\nwere found in stereoacuity thresholds between dark and light conditions for\nparticipants with IDS and IA. Controls are unaffected by AGC and yield a\nsimilar stereoacuity threshold under both lighting conditions.\n  Conclusion: Our study proves that stereoacuity threshold is significantly\ndeviated particularly in participants with IDS or IA stereo-deficits if ambient\nlighting is not taken into consideration. Moreover, our framework provides a\nquick (approximately 5-10 minutes) assessment of stereoacuity threshold and can\nbe performed within 30 ST and 15 AGC trials.\n  Significance: Our test is useful in planning treatments and monitoring\nprognosis for patients with stereo-deficits by accurately assessing\nstereovision.",
        "updated": "2024-06-26 13:24:08 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.18336v1"
    },
    {
        "title": "Multimodal Reaching-Position Prediction for ADL Support Using Neural Networks",
        "authors": "Yutaka TakaseKimitoshi Yamazaki",
        "links": "http://arxiv.org/abs/2406.18162v1",
        "entry_id": "http://arxiv.org/abs/2406.18162v1",
        "pdf_url": "http://arxiv.org/pdf/2406.18162v1",
        "summary": "This study aimed to develop daily living support robots for patients with\nhemiplegia and the elderly. To support the daily living activities using robots\nin ordinary households without imposing physical and mental burdens on users,\nthe system must detect the actions of the user and move appropriately according\nto their motions.\n  We propose a reaching-position prediction scheme that targets the motion of\nlifting the upper arm, which is burdensome for patients with hemiplegia and the\nelderly in daily living activities.\n  For this motion, it is difficult to obtain effective features to create a\nprediction model in environments where large-scale sensor system installation\nis not feasible and the motion time is short.\n  We performed motion-collection experiments, revealed the features of the\ntarget motion and built a prediction model using the multimodal motion features\nand deep learning.\n  The proposed model achieved an accuracy of 93 \\% macro average and F1-score\nof 0.69 for a 9-class classification prediction at 35\\% of the motion\ncompletion.",
        "updated": "2024-06-26 08:23:13 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.18162v1"
    },
    {
        "title": "BADGE: BADminton report Generation and Evaluation with LLM",
        "authors": "Shang-Hsuan ChiangLin-Wei ChaoKuang-Da WangChih-Chuan WangWen-Chih Peng",
        "links": "http://arxiv.org/abs/2406.18116v1",
        "entry_id": "http://arxiv.org/abs/2406.18116v1",
        "pdf_url": "http://arxiv.org/pdf/2406.18116v1",
        "summary": "Badminton enjoys widespread popularity, and reports on matches generally\ninclude details such as player names, game scores, and ball types, providing\naudiences with a comprehensive view of the games. However, writing these\nreports can be a time-consuming task. This challenge led us to explore whether\na Large Language Model (LLM) could automate the generation and evaluation of\nbadminton reports. We introduce a novel framework named BADGE, designed for\nthis purpose using LLM. Our method consists of two main phases: Report\nGeneration and Report Evaluation. Initially, badminton-related data is\nprocessed by the LLM, which then generates a detailed report of the match. We\ntested different Input Data Types, In-Context Learning (ICL), and LLM, finding\nthat GPT-4 performs best when using CSV data type and the Chain of Thought\nprompting. Following report generation, the LLM evaluates and scores the\nreports to assess their quality. Our comparisons between the scores evaluated\nby GPT-4 and human judges show a tendency to prefer GPT-4 generated reports.\nSince the application of LLM in badminton reporting remains largely unexplored,\nour research serves as a foundational step for future advancements in this\narea. Moreover, our method can be extended to other sports games, thereby\nenhancing sports promotion. For more details, please refer to\nhttps://github.com/AndyChiangSH/BADGE.",
        "updated": "2024-06-26 07:07:52 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.18116v1"
    },
    {
        "title": "Natural Language but Omitted? On the Ineffectiveness of Large Language Models' privacy policy from End-users' Perspective",
        "authors": "Shuning ZhangHaobin XingXin YiHewu Li",
        "links": "http://arxiv.org/abs/2406.18100v1",
        "entry_id": "http://arxiv.org/abs/2406.18100v1",
        "pdf_url": "http://arxiv.org/pdf/2406.18100v1",
        "summary": "LLMs driven products were increasingly prevalent in our daily lives, With a\nnatural language based interaction style, people may potentially leak their\npersonal private information. Thus, privacy policy and user agreement played an\nimportant role in regulating and alerting people. However, there lacked the\nwork examining the reading of LLM's privacy policy. Thus, we conducted the\nfirst user study to let participants read the privacy policy and user agreement\nwith two different styles (a cursory and detailed style). We found users lack\nimportant information upon cursory reading and even detailed reading. Besides,\ntheir privacy concerns was not solved even upon detailed reading. We provided\nfour design implications based on the findings.",
        "updated": "2024-06-26 06:31:43 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.18100v1"
    }
]