[
    {
        "title": "The Patchkeeper: An Integrated Wearable Electronic Stethoscope with Multiple Sensors",
        "authors": "Hongwei LiZoran RadivojevicMichael S. Eggleston",
        "links": "http://arxiv.org/abs/2407.11837v1",
        "entry_id": "http://arxiv.org/abs/2407.11837v1",
        "pdf_url": "http://arxiv.org/pdf/2407.11837v1",
        "summary": "Many parts of human body generate internal sound during biological processes,\nwhich are rich sources of information for understanding health and wellbeing.\nDespite a long history of development and usage of stethoscopes, there is still\na lack of proper tools for recording internal body sound together with\ncomplementary sensors for long term monitoring. In this paper, we show our\ndevelopment of a wearable electronic stethoscope, coined Patchkeeper (PK), that\ncan be used for internal body sound recording over long periods of time.\nPatchkeeper also integrates several state-of-the-art biological sensors,\nincluding electrocardiogram (ECG), photoplethysmography (PPG), and inertial\nmeasurement unit (IMU) sensors. As a wearable device, Patchkeeper can be placed\non various parts of the body to collect sound from particular organs, including\nheart, lung, stomach, and joints etc. We show in this paper that several vital\nsignals can be recorded simultaneously with high quality. As Patchkeeper can be\noperated directly by the user, e.g. without involving health care\nprofessionals, we believe it could be a useful tool for telemedicine and remote\ndiagnostics.",
        "updated": "2024-07-16 15:22:10 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.11837v1"
    },
    {
        "title": "Harmonizing Safety and Speed: A Human-Algorithm Approach to Enhance the FDA's Medical Device Clearance Policy",
        "authors": "Mohammad ZhalechianSoroush SaghafianOmar Robles",
        "links": "http://arxiv.org/abs/2407.11823v1",
        "entry_id": "http://arxiv.org/abs/2407.11823v1",
        "pdf_url": "http://arxiv.org/pdf/2407.11823v1",
        "summary": "The United States Food and Drug Administration's (FDA's) Premarket\nNotification 510(K) pathway allows manufacturers to gain approval for a medical\ndevice by demonstrating its substantial equivalence to another legally marketed\ndevice. However, the inherent ambiguity of this regulatory procedure has led to\nhigh recall rates for many devices cleared through this pathway. This trend has\nraised significant concerns regarding the efficacy of the FDA's current\napproach, prompting a reassessment of the 510(K) regulatory framework. In this\npaper, we develop a combined human-algorithm approach to assist the FDA in\nimproving its 510(k) medical device clearance process by reducing the risk of\npotential recalls and the workload imposed on the FDA. We first develop machine\nlearning methods to estimate the risk of recall of 510(k) medical devices based\non the information available at the time of submission. We then propose a\ndata-driven clearance policy that recommends acceptance, rejection, or deferral\nto FDA's committees for in-depth evaluation. We conduct an empirical study\nusing a unique large-scale dataset of over 31,000 medical devices and 12,000\nnational and international manufacturers from over 65 countries that we\nassembled based on data sources from the FDA and Centers for Medicare and\nMedicaid Service (CMS). A conservative evaluation of our proposed policy based\non this data shows a 38.9% improvement in the recall rate and a 43.0% reduction\nin the FDA's workload. Our analyses also indicate that implementing our policy\ncould result in significant annual cost-savings ranging between \\$2.4 billion\nand \\$2.7 billion, which highlights the value of using a holistic and\ndata-driven approach to improve the FDA's current 510(K) medical device\nevaluation pathway.",
        "updated": "2024-07-16 15:11:29 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.11823v1"
    },
    {
        "title": "Ubiquitous Metadata: Design and Fabrication of Embedded Markers for Real-World Object Identification and Interaction",
        "authors": "Mustafa Doga Dogan",
        "links": "http://arxiv.org/abs/2407.11748v1",
        "entry_id": "http://arxiv.org/abs/2407.11748v1",
        "pdf_url": "http://arxiv.org/pdf/2407.11748v1",
        "summary": "The convergence of the physical and digital realms has ushered in a new era\nof immersive experiences and seamless interactions. As the boundaries between\nthe real world and virtual environments blur and result in a \"mixed reality,\"\nthere arises a need for robust and efficient methods to connect physical\nobjects with their virtual counterparts. In this thesis, we present a novel\napproach to bridging this gap through the design, fabrication, and detection of\nembedded machine-readable markers.\n  We categorize the proposed marking approaches into three distinct categories:\nnatural markers, structural markers, and internal markers. Natural markers,\nsuch as those used in SensiCut, are inherent fingerprints of objects repurposed\nas machine-readable identifiers, while structural markers, such as StructCode\nand G-ID, leverage the structural artifacts in objects that emerge during the\nfabrication process itself. Internal markers, such as InfraredTag and\nBrightMarker, are embedded inside fabricated objects using specialized\nmaterials. Leveraging a combination of methods from computer vision, machine\nlearning, computational imaging, and material science, the presented approaches\noffer robust and versatile solutions for object identification, tracking, and\ninteraction.\n  These markers, seamlessly integrated into real-world objects, effectively\ncommunicate an object's identity, origin, function, and interaction,\nfunctioning as gateways to \"ubiquitous metadata\" - a concept where metadata is\nembedded into physical objects, similar to metadata in digital files. Across\nthe different chapters, we demonstrate the applications of the presented\nmethods in diverse domains, including product design, manufacturing, retail,\nlogistics, education, entertainment, security, and sustainability.",
        "updated": "2024-07-16 14:14:52 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.11748v1"
    },
    {
        "title": "A Comparative Analysis of Interactive Reinforcement Learning Algorithms in Warehouse Robot Grid Based Environment",
        "authors": "Arunabh Bora",
        "links": "http://arxiv.org/abs/2407.11671v1",
        "entry_id": "http://arxiv.org/abs/2407.11671v1",
        "pdf_url": "http://arxiv.org/pdf/2407.11671v1",
        "summary": "The field of warehouse robotics is currently in high demand, with major\ntechnology and logistics companies making significant investments in these\nadvanced systems. Training robots to operate in such complex environments is\nchallenging, often requiring human supervision for adaptation and learning.\nInteractive reinforcement learning (IRL) is a key training methodology in\nhuman-computer interaction. This paper presents a comparative study of two IRL\nalgorithms: Q-learning and SARSA, both trained in a virtual\ngrid-simulation-based warehouse environment. To maintain consistent feedback\nrewards and avoid bias, feedback was provided by the same individual throughout\nthe study.",
        "updated": "2024-07-16 12:41:49 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.11671v1"
    },
    {
        "title": "Beware of Validation by Eye: Visual Validation of Linear Trends in Scatterplots",
        "authors": "Daniel BraunRemco ChangMichael GleicherTatiana von Landesberger",
        "links": "http://arxiv.org/abs/2407.11625v1",
        "entry_id": "http://arxiv.org/abs/2407.11625v1",
        "pdf_url": "http://arxiv.org/pdf/2407.11625v1",
        "summary": "Visual validation of regression models in scatterplots is a common practice\nfor assessing model quality, yet its efficacy remains unquantified. We\nconducted two empirical experiments to investigate individuals' ability to\nvisually validate linear regression models (linear trends) and to examine the\nimpact of common visualization designs on validation quality. The first\nexperiment showed that the level of accuracy for visual estimation of slope\n(i.e., fitting a line to data) is higher than for visual validation of slope\n(i.e., accepting a shown line). Notably, we found bias toward slopes that are\n\"too steep\" in both cases. This lead to novel insights that participants\nnaturally assessed regression with orthogonal distances between the points and\nthe line (i.e., ODR regression) rather than the common vertical distances (OLS\nregression). In the second experiment, we investigated whether incorporating\ncommon designs for regression visualization (error lines, bounding boxes, and\nconfidence intervals) would improve visual validation. Even though error lines\nreduced validation bias, results failed to show the desired improvements in\naccuracy for any design. Overall, our findings suggest caution in using visual\nmodel validation for linear trends in scatterplots.",
        "updated": "2024-07-16 11:41:24 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.11625v1"
    }
]