[
    {
        "title": "On the Convergence of Tâtonnement for Linear Fisher Markets",
        "authors": "Tianlong NanYuan GaoChristian Kroer",
        "links": "http://arxiv.org/abs/2406.12526v1",
        "entry_id": "http://arxiv.org/abs/2406.12526v1",
        "pdf_url": "http://arxiv.org/pdf/2406.12526v1",
        "summary": "T\\^atonnement is a simple, intuitive market process where prices are\niteratively adjusted based on the difference between demand and supply. Many\nvariants under different market assumptions have been studied and shown to\nconverge to a market equilibrium, in some cases at a fast rate. However, the\nclassical case of linear Fisher markets have long eluded the analyses, and it\nremains unclear whether t\\^atonnement converges in this case. We show that, for\na sufficiently small step size, the prices given by the t\\^atonnement process\nare guaranteed to converge to equilibrium prices, up to a small approximation\nradius that depends on the stepsize. To achieve this, we consider the dual\nEisenberg-Gale convex program in the price space, view t\\^atonnement as\nsubgradient descent on this convex program, and utilize novel last-iterate\nconvergence results for subgradient descent under error bound conditions. In\ndoing so, we show that the convex program satisfies a particular error bound\ncondition, the quadratic growth condition, and that the price sequence\ngenerated by t\\^atonnement is bounded above and away from zero. We also show\nthat a similar convergence result holds for t\\^atonnement in quasi-linear\nFisher markets. Numerical experiments are conducted to demonstrate that the\ntheoretical linear convergence aligns with empirical observations.",
        "updated": "2024-06-18 11:54:01 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.12526v1"
    },
    {
        "title": "A Step Towards a Universal Method for Modeling and Implementing Cross-Organizational Business Processes",
        "authors": "Gerhard ZeislerTim Tobias BraunauerAlbert FleischmannRobert Singer",
        "links": "http://arxiv.org/abs/2406.12302v1",
        "entry_id": "http://arxiv.org/abs/2406.12302v1",
        "pdf_url": "http://arxiv.org/pdf/2406.12302v1",
        "summary": "The widely adopted Business Process Model and Notation (BPMN) is a\ncornerstone of industry standards for business process modeling. However, its\nambiguous execution semantics often result in inconsistent interpretations,\ndepending on the software used for implementation. In response, the Process\nSpecification Language (PASS) provides formally defined semantics to overcome\nthese interpretational challenges. Despite its clear advantages, PASS has not\nreached the same level of industry penetration as BPMN.\n  This feasibility study proposes using PASS as an intermediary framework to\ntranslate and execute BPMN models. It describes the development of a prototype\ntranslator that converts specific BPMN elements into a format compatible with\nPASS. These models are then transformed into source code and executed in a\nbespoke workflow environment, marking a departure from traditional BPMN\nimplementations.\n  Our findings suggest that integrating PASS enhances compatibility across\ndifferent modeling and execution tools and offers a more robust methodology for\nimplementing business processes across organizations. This study lays the\ngroundwork for more accurate and unified business process model executions,\npotentially transforming industry standards for process modeling and execution.",
        "updated": "2024-06-18 06:19:44 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.12302v1"
    },
    {
        "title": "Tracking the perspectives of interacting language models",
        "authors": "Hayden HelmBrandon DuderstadtYoungser ParkCarey E. Priebe",
        "links": "http://arxiv.org/abs/2406.11938v1",
        "entry_id": "http://arxiv.org/abs/2406.11938v1",
        "pdf_url": "http://arxiv.org/pdf/2406.11938v1",
        "summary": "Large language models (LLMs) are capable of producing high quality\ninformation at unprecedented rates. As these models continue to entrench\nthemselves in society, the content they produce will become increasingly\npervasive in databases that are, in turn, incorporated into the pre-training\ndata, fine-tuning data, retrieval data, etc. of other language models. In this\npaper we formalize the idea of a communication network of LLMs and introduce a\nmethod for representing the perspective of individual models within a\ncollection of LLMs. Given these tools we systematically study information\ndiffusion in the communication network of LLMs in various simulated settings.",
        "updated": "2024-06-17 17:20:16 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.11938v1"
    },
    {
        "title": "Instruct, Not Assist: LLM-based Multi-Turn Planning and Hierarchical Questioning for Socratic Code Debugging",
        "authors": "Priyanka KarguptaIshika AgarwalDilek Hakkani-TurJiawei Han",
        "links": "http://arxiv.org/abs/2406.11709v1",
        "entry_id": "http://arxiv.org/abs/2406.11709v1",
        "pdf_url": "http://arxiv.org/pdf/2406.11709v1",
        "summary": "Socratic questioning is an effective teaching strategy, encouraging critical\nthinking and problem-solving. The conversational capabilities of large language\nmodels (LLMs) show great potential for providing scalable, real-time student\nguidance. However, current LLMs often give away solutions directly, making them\nineffective instructors. We tackle this issue in the code debugging domain with\nTreeInstruct, an Instructor agent guided by a novel state space-based planning\nalgorithm. TreeInstruct asks probing questions to help students independently\nidentify and resolve errors. It estimates a student's conceptual and\nsyntactical knowledge to dynamically construct a question tree based on their\nresponses and current knowledge state, effectively addressing both independent\nand dependent mistakes concurrently in a multi-turn interaction setting. In\naddition to using an existing single-bug debugging benchmark, we construct a\nmore challenging multi-bug dataset of 150 coding problems, incorrect solutions,\nand bug fixes -- all carefully constructed and annotated by experts. Extensive\nevaluation shows TreeInstruct's state-of-the-art performance on both datasets,\nproving it to be a more effective instructor than baselines. Furthermore, a\nreal-world case study with five students of varying skill levels further\ndemonstrates TreeInstruct's ability to guide students to debug their code\nefficiently with minimal turns and highly Socratic questioning.",
        "updated": "2024-06-17 16:28:21 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.11709v1"
    },
    {
        "title": "Decentralized Collaborative Pricing and Shunting for Multiple EV Charging Stations Based on Multi-Agent Reinforcement Learning",
        "authors": "Tianhao BuHang LiGuojie Li",
        "links": "http://arxiv.org/abs/2406.11496v1",
        "entry_id": "http://arxiv.org/abs/2406.11496v1",
        "pdf_url": "http://arxiv.org/pdf/2406.11496v1",
        "summary": "The extraordinary electric vehicle (EV) popularization in the recent years\nhas facilitated research studies in alleviating EV energy charging demand.\nPrevious studies primarily focused on the optimizations over charging stations\n(CS) profit and EV users cost savings through charge/discharge scheduling\nevents. In this work, the random behaviors of EVs are considered, with EV users\npreferences over multi-CS characteristics modelled to imitate the potential CS\nselection disequilibrium. A price scheduling strategy under decentralized\ncollaborative framework is proposed to achieve EV shunting in a multi-CS\nenvironment, while minimizing the charging cost through multi agent\nreinforcement learning. The proposed problem is formulated as a Markov Decision\nProcess (MDP) with uncertain transition probability.",
        "updated": "2024-06-17 12:59:30 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.11496v1"
    }
]