[
    {
        "title": "A Backbone for Long-Horizon Robot Task Understanding",
        "authors": "Xiaoshuai ChenWei ChenDongmyoung LeeYukun GeNicolas RojasPetar Kormushev",
        "links": "http://arxiv.org/abs/2408.01334v1",
        "entry_id": "http://arxiv.org/abs/2408.01334v1",
        "pdf_url": "http://arxiv.org/pdf/2408.01334v1",
        "summary": "End-to-end robot learning, particularly for long-horizon tasks, often results\nin unpredictable outcomes and poor generalization. To address these challenges,\nwe propose a novel Therblig-based Backbone Framework (TBBF) to enhance robot\ntask understanding and transferability. This framework uses therbligs (basic\naction elements) as the backbone to decompose high-level robot tasks into\nelemental robot configurations, which are then integrated with current\nfoundation models to improve task understanding. The approach consists of two\nstages: offline training and online testing. During the offline training stage,\nwe developed the Meta-RGate SynerFusion (MGSF) network for accurate therblig\nsegmentation across various tasks. In the online testing stage, after a\none-shot demonstration of a new task is collected, our MGSF network extracts\nhigh-level knowledge, which is then encoded into the image using Action\nRegistration (ActionREG). Additionally, the Large Language Model\n(LLM)-Alignment Policy for Visual Correction (LAP-VC) is employed to ensure\nprecise action execution, facilitating trajectory transfer in novel robot\nscenarios. Experimental results validate these methods, achieving 94.37% recall\nin therblig segmentation and success rates of 94.4% and 80% in real-world\nonline robot testing for simple and complex scenarios, respectively.\nSupplementary material is available at:\nhttps://sites.google.com/view/therbligsbasedbackbone/home",
        "updated": "2024-08-02 15:32:42 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.01334v1"
    },
    {
        "title": "Does This Have a Particular Meaning? Interactive Pattern Explanation for Network Visualizations",
        "authors": "Xinhuan ShuAlexis PisterJunxiu TangFanny ChevalierBenjamin Bach",
        "links": "http://arxiv.org/abs/2408.01272v1",
        "entry_id": "http://arxiv.org/abs/2408.01272v1",
        "pdf_url": "http://arxiv.org/pdf/2408.01272v1",
        "summary": "This paper presents an interactive technique to explain visual patterns in\nnetwork visualizations to analysts who do not understand these visualizations\nand who are learning to read them. Learning a visualization requires mastering\nits visual grammar and decoding information presented through visual marks,\ngraphical encodings, and spatial configurations. To help people learn network\nvisualization designs and extract meaningful information, we introduce the\nconcept of interactive pattern explanation that allows viewers to select an\narbitrary area in a visualization, then automatically mines the underlying data\npatterns, and explains both visual and data patterns present in the viewer's\nselection. In a qualitative and a quantitative user study with a total of 32\nparticipants, we compare interactive pattern explanations to textual-only and\nvisual-only (cheatsheets) explanations. Our results show that interactive\nexplanations increase learning of i) unfamiliar visualizations, ii) patterns in\nnetwork science, and iii) the respective network terminology.",
        "updated": "2024-08-02 13:50:15 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.01272v1"
    },
    {
        "title": "The virtual CAT: A tool for algorithmic thinking assessment in Swiss compulsory education",
        "authors": "Giorgia AdorniAlberto Piatti",
        "links": "http://arxiv.org/abs/2408.01263v1",
        "entry_id": "http://arxiv.org/abs/2408.01263v1",
        "pdf_url": "http://arxiv.org/pdf/2408.01263v1",
        "summary": "In today's digital era, holding algorithmic thinking (AT) skills is crucial,\nnot only in computer science-related fields. These abilities enable individuals\nto break down complex problems into more manageable steps and create a sequence\nof actions to solve them. To address the increasing demand for AT assessments\nin educational settings and the limitations of current methods, this paper\nintroduces the virtual Cross Array Task (CAT), a digital adaptation of an\nunplugged assessment activity designed to evaluate algorithmic skills in Swiss\ncompulsory education. This tool offers scalable and automated assessment,\nreducing human involvement and mitigating potential data collection errors. The\nplatform features gesture-based and visual block-based programming interfaces,\nensuring its usability for diverse learners, further supported by multilingual\ncapabilities. To evaluate the virtual CAT platform, we conducted a pilot\nevaluation in Switzerland involving a heterogeneous group of students. The\nfindings show the platform's usability, proficiency and suitability for\nassessing AT skills among students of diverse ages, development stages, and\neducational backgrounds, as well as the feasibility of large-scale data\ncollection.",
        "updated": "2024-08-02 13:36:17 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.01263v1"
    },
    {
        "title": "Detection and Characterization of Coordinated Online Behavior: A Survey",
        "authors": "Lorenzo MannocciMichele MazzaAnna MonrealeMaurizio TesconiStefano Cresci",
        "links": "http://arxiv.org/abs/2408.01257v1",
        "entry_id": "http://arxiv.org/abs/2408.01257v1",
        "pdf_url": "http://arxiv.org/pdf/2408.01257v1",
        "summary": "Coordination is a fundamental aspect of life. The advent of social media has\nmade it integral also to online human interactions, such as those that\ncharacterize thriving online communities and social movements. At the same\ntime, coordination is also core to effective disinformation, manipulation, and\nhate campaigns. This survey collects, categorizes, and critically discusses the\nbody of work produced as a result of the growing interest on coordinated online\nbehavior. We reconcile industry and academic definitions, propose a\ncomprehensive framework to study coordinated online behavior, and review and\ncritically discuss the existing detection and characterization methods. Our\nanalysis identifies open challenges and promising directions of research,\nserving as a guide for scholars, practitioners, and policymakers in\nunderstanding and addressing the complexities inherent to online coordination.",
        "updated": "2024-08-02 13:27:56 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.01257v1"
    },
    {
        "title": "Zoomable Level-of-Detail ChartTables for Interpreting Probabilistic Model Outputs for Reactionary Train Delays",
        "authors": "Aidan SlingsbyJonathan Hyde",
        "links": "http://arxiv.org/abs/2408.01203v1",
        "entry_id": "http://arxiv.org/abs/2408.01203v1",
        "pdf_url": "http://arxiv.org/pdf/2408.01203v1",
        "summary": "\"Reactionary delay\" is a result of the accumulated cascading effects of\nknock-on train delays which is increasing on UK railways due to increasing\nutilisation of the railway infrastructure. The chaotic nature of its effects on\ntrain lateness is notoriously hard to predict. We use a stochastic\nMonte-Carto-style simulation of reactionary delay that produces whole\ndistributions of likely reactionary delay and delays this causes. We\ndemonstrate how Zoomable Level-of-Detail ChartTables - case-by-variable tables\nwhere cases are rows, variables are columns, variables are complex composite\nmetrics that incorporate distributions, and cells contain mini-charts that\ndepict these as different levels of detail through zoom interaction - help\ninterpret whole distributions of model outputs to help understand the causes\nand effects of reactionary delay, how they inform timetable robustness testing,\nand how they could be used in other contexts.",
        "updated": "2024-08-02 11:34:49 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.01203v1"
    }
]