[
    {
        "title": "Agentic LLM Workflows for Generating Patient-Friendly Medical Reports",
        "authors": "Malavikha SudarshanSophie ShihEstella YeeAlina YangJohn ZouCathy ChenQuan ZhouLeon ChenChinmay SinghalGeorge Shih",
        "links": "http://arxiv.org/abs/2408.01112v1",
        "entry_id": "http://arxiv.org/abs/2408.01112v1",
        "pdf_url": "http://arxiv.org/pdf/2408.01112v1",
        "summary": "The application of Large Language Models (LLMs) in healthcare is expanding\nrapidly, with one potential use case being the translation of formal medical\nreports into patient-legible equivalents. Currently, LLM outputs often need to\nbe edited and evaluated by a human to ensure both factual accuracy and\ncomprehensibility, and this is true for the above use case. We aim to minimize\nthis step by proposing an agentic workflow with the Reflexion framework, which\nuses iterative self-reflection to correct outputs from an LLM. This pipeline\nwas tested and compared to zero-shot prompting on 16 randomized radiology\nreports. In our multi-agent approach, reports had an accuracy rate of 94.94%\nwhen looking at verification of ICD-10 codes, compared to zero-shot prompted\nreports, which had an accuracy rate of 68.23%. Additionally, 81.25% of the\nfinal reflected reports required no corrections for accuracy or readability,\nwhile only 25% of zero-shot prompted reports met these criteria without needing\nmodifications. These results indicate that our approach presents a feasible\nmethod for communicating clinical findings to patients in a quick, efficient\nand coherent manner whilst also retaining medical accuracy. All code is\navailable for viewing at\nhttp://github.com/malavikhasudarshan/Multi-Agent-Patient-Letter-Generation.",
        "updated": "2024-08-02 08:40:33 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.01112v1"
    },
    {
        "title": "CommonUppRoad: A Framework of Formal Modelling, Verifying, Learning, and Visualisation of Autonomous Vehicles",
        "authors": "Rong GuKaige TanAndreas Holck Høeg-PetersenLei FengKim Guldstrand Larsen",
        "links": "http://arxiv.org/abs/2408.01093v1",
        "entry_id": "http://arxiv.org/abs/2408.01093v1",
        "pdf_url": "http://arxiv.org/pdf/2408.01093v1",
        "summary": "Combining machine learning and formal methods (FMs) provides a possible\nsolution to overcome the safety issue of autonomous driving (AD) vehicles.\nHowever, there are gaps to be bridged before this combination becomes\npractically applicable and useful. In an attempt to facilitate researchers in\nboth FMs and AD areas, this paper proposes a framework that combines two\nwell-known tools, namely CommonRoad and UPPAAL. On the one hand, CommonRoad can\nbe enhanced by the rigorous semantics of models in UPPAAL, which enables a\nsystematic and comprehensive understanding of the AD system's behaviour and\nthus strengthens the safety of the system. On the other hand, controllers\nsynthesised by UPPAAL can be visualised by CommonRoad in real-world road\nnetworks, which facilitates AD vehicle designers greatly adopting formal models\nin system design. In this framework, we provide automatic model conversions\nbetween CommonRoad and UPPAAL. Therefore, users only need to program in Python\nand the framework takes care of the formal models, learning, and verification\nin the backend. We perform experiments to demonstrate the applicability of our\nframework in various AD scenarios, discuss the advantages of solving motion\nplanning in our framework, and show the scalability limit and possible\nsolutions.",
        "updated": "2024-08-02 08:12:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.01093v1"
    },
    {
        "title": "Learning in Multi-Objective Public Goods Games with Non-Linear Utilities",
        "authors": "Nicole OrzanErman AcarDavide GrossiPatrick MannionRoxana Rădulescu",
        "links": "http://arxiv.org/abs/2408.00682v1",
        "entry_id": "http://arxiv.org/abs/2408.00682v1",
        "pdf_url": "http://arxiv.org/pdf/2408.00682v1",
        "summary": "Addressing the question of how to achieve optimal decision-making under risk\nand uncertainty is crucial for enhancing the capabilities of artificial agents\nthat collaborate with or support humans. In this work, we address this question\nin the context of Public Goods Games. We study learning in a novel\nmulti-objective version of the Public Goods Game where agents have different\nrisk preferences, by means of multi-objective reinforcement learning. We\nintroduce a parametric non-linear utility function to model risk preferences at\nthe level of individual agents, over the collective and individual reward\ncomponents of the game. We study the interplay between such preference\nmodelling and environmental uncertainty on the incentive alignment level in the\ngame. We demonstrate how different combinations of individual preferences and\nenvironmental uncertainties sustain the emergence of cooperative patterns in\nnon-cooperative environments (i.e., where competitive strategies are dominant),\nwhile others sustain competitive patterns in cooperative environments (i.e.,\nwhere cooperative strategies are dominant).",
        "updated": "2024-08-01 16:24:37 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.00682v1"
    },
    {
        "title": "Condorcet's Jury Theorem with Abstention",
        "authors": "Ganesh GhalmeReshef Meir",
        "links": "http://arxiv.org/abs/2408.00317v1",
        "entry_id": "http://arxiv.org/abs/2408.00317v1",
        "pdf_url": "http://arxiv.org/pdf/2408.00317v1",
        "summary": "The well-known Condorcet's Jury theorem posits that the majority rule selects\nthe best alternative among two available options with probability one, as the\npopulation size increases to infinity. We study this result under an asymmetric\ntwo-candidate setup, where supporters of both candidates may have different\nparticipation costs.\n  When the decision to abstain is fully rational i.e., when the vote pivotality\nis the probability of a tie, the only equilibrium outcome is a trivial\nequilibrium where all voters except those with zero voting cost, abstain. We\npropose and analyze a more practical, boundedly rational model where voters\noverestimate their pivotality, and show that under this model, non-trivial\nequilibria emerge where the winning probability of both candidates is bounded\naway from one.\n  We show that when the pivotality estimate strongly depends on the margin of\nvictory, victory is not assured to any candidate in any non-trivial\nequilibrium, regardless of population size and in contrast to Condorcet's\nassertion. Whereas, under a weak dependence on margin, Condorcet's Jury theorem\nis restored.",
        "updated": "2024-08-01 06:28:32 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.00317v1"
    },
    {
        "title": "Modeling Urban Transport Choices: Incorporating Sociocultural Aspects",
        "authors": "Kathleen Salazar-SernaLorena CadavidCarlos J. Franco",
        "links": "http://arxiv.org/abs/2407.21307v1",
        "entry_id": "http://arxiv.org/abs/2407.21307v1",
        "pdf_url": "http://arxiv.org/pdf/2407.21307v1",
        "summary": "This paper introduces an agent-based simulation model aimed at understanding\nurban commuters mode choices and evaluating the impacts of transport policies\nto promote sustainable mobility. Crafted for developing countries, where\nutilitarian travel heavily relies on motorcycles, the model integrates\nsociocultural factors that influence transport behavior. Multinomial models and\ninferential statistics applied to survey data from Cali, Colombia, inform the\nmodel, revealing significant influences of sociodemographic factors and travel\nattributes on mode choice. Findings highlight the importance of cost, time,\nsafety, comfort, and personal security, with disparities across socioeconomic\ngroups. Policy simulations demonstrate positive responses to interventions like\nfree public transportation, increased bus frequency, and enhanced security, yet\nwith modest shifts in mode choice. Multifaceted policy approaches are deemed\nmore effective, addressing diverse user preferences. Outputs can be extended to\ncities with similar sociocultural characteristics and transport dynamics. The\nmethodology applied in this work can be replicated for other territories.",
        "updated": "2024-07-31 03:19:56 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.21307v1"
    }
]