[
    {
        "title": "Decentralized Personalized Federated Learning",
        "authors": "Salma KharratMarco CaniniSamuel Horvath",
        "links": "http://arxiv.org/abs/2406.06520v1",
        "entry_id": "http://arxiv.org/abs/2406.06520v1",
        "pdf_url": "http://arxiv.org/pdf/2406.06520v1",
        "summary": "This work tackles the challenges of data heterogeneity and communication\nlimitations in decentralized federated learning. We focus on creating a\ncollaboration graph that guides each client in selecting suitable collaborators\nfor training personalized models that leverage their local data effectively.\nOur approach addresses these issues through a novel, communication-efficient\nstrategy that enhances resource efficiency. Unlike traditional methods, our\nformulation identifies collaborators at a granular level by considering\ncombinatorial relations of clients, enhancing personalization while minimizing\ncommunication overhead. We achieve this through a bi-level optimization\nframework that employs a constrained greedy algorithm, resulting in a\nresource-efficient collaboration graph for personalized learning. Extensive\nevaluation against various baselines across diverse datasets demonstrates the\nsuperiority of our method, named DPFL. DPFL consistently outperforms other\napproaches, showcasing its effectiveness in handling real-world data\nheterogeneity, minimizing communication overhead, enhancing resource\nefficiency, and building personalized models in decentralized federated\nlearning scenarios.",
        "updated": "2024-06-10 17:58:48 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.06520v1"
    },
    {
        "title": "Early Acceptance Matching Game for User-Centric Clustering in Scalable Cell-free MIMO Networks",
        "authors": "Ala Eddine NoualiMohamed SanaJean-Paul Jamont",
        "links": "http://arxiv.org/abs/2406.06402v1",
        "entry_id": "http://arxiv.org/abs/2406.06402v1",
        "pdf_url": "http://arxiv.org/pdf/2406.06402v1",
        "summary": "The canonical setup is the primary approach adopted in cell-free\nmultiple-input multiple-output (MIMO) networks, in which all access points\n(APs) jointly serve every user equipment (UE). This approach is not scalable in\nterms of computational complexity and fronthaul signaling becoming impractical\nin large networks. This work adopts a user-centric approach, a scalable\nalternative in which only a set of preferred APs jointly serve a UE. Forming\nthe optimal cluster of APs for each UE is a challenging task, especially, when\nit needs to be dynamically adjusted to meet the quality of service (QoS)\nrequirements of the UE. This complexity is even exacerbated when considering\nthe constrained fronthaul capacity of the UE and the AP. We solve this problem\nwith a novel many-to-many matching game. More specifically, we devise an early\nacceptance matching algorithm, which immediately admits or rejects UEs based on\ntheir requests and available radio resources. The proposed solution\nsignificantly reduces the fronthaul signaling while satisfying the maximum of\nUEs in terms of requested QoS compared to state-of-the-art approaches.",
        "updated": "2024-06-10 15:56:14 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.06402v1"
    },
    {
        "title": "Risk Sensitivity in Markov Games and Multi-Agent Reinforcement Learning: A Systematic Review",
        "authors": "Hafez GhaemiShirin JamshidiMohammad MashreghiMajid Nili AhmadabadiHamed Kebriaei",
        "links": "http://arxiv.org/abs/2406.06041v1",
        "entry_id": "http://arxiv.org/abs/2406.06041v1",
        "pdf_url": "http://arxiv.org/pdf/2406.06041v1",
        "summary": "Markov games (MGs) and multi-agent reinforcement learning (MARL) are studied\nto model decision making in multi-agent systems. Traditionally, the objective\nin MG and MARL has been risk-neutral, i.e., agents are assumed to optimize a\nperformance metric such as expected return, without taking into account\nsubjective or cognitive preferences of themselves or of other agents. However,\nignoring such preferences leads to inaccurate models of decision making in many\nreal-world scenarios in finance, operations research, and behavioral economics.\nTherefore, when these preferences are present, it is necessary to incorporate a\nsuitable measure of risk into the optimization objective of agents, which opens\nthe door to risk-sensitive MG and MARL. In this paper, we systemically review\nthe literature on risk sensitivity in MG and MARL that has been growing in\nrecent years alongside other areas of reinforcement learning and game theory.\nWe define and mathematically describe different risk measures used in MG and\nMARL and individually for each measure, discuss articles that incorporate it.\nFinally, we identify recent trends in theoretical and applied works in the\nfield and discuss possible directions of future research.",
        "updated": "2024-06-10 06:19:33 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.06041v1"
    },
    {
        "title": "Deception Analysis with Artificial Intelligence: An Interdisciplinary Perspective",
        "authors": "Stefan Sarkadi",
        "links": "http://arxiv.org/abs/2406.05724v1",
        "entry_id": "http://arxiv.org/abs/2406.05724v1",
        "pdf_url": "http://arxiv.org/pdf/2406.05724v1",
        "summary": "Humans and machines interact more frequently than ever and our societies are\nbecoming increasingly hybrid. A consequence of this hybridisation is the\ndegradation of societal trust due to the prevalence of AI-enabled deception.\nYet, despite our understanding of the role of trust in AI in the recent years,\nwe still do not have a computational theory to be able to fully understand and\nexplain the role deception plays in this context. This is a problem because\nwhile our ability to explain deception in hybrid societies is delayed, the\ndesign of AI agents may keep advancing towards fully autonomous deceptive\nmachines, which would pose new challenges to dealing with deception. In this\npaper we build a timely and meaningful interdisciplinary perspective on\ndeceptive AI and reinforce a 20 year old socio-cognitive perspective on trust\nand deception, by proposing the development of DAMAS -- a holistic Multi-Agent\nSystems (MAS) framework for the socio-cognitive modelling and analysis of\ndeception. In a nutshell this paper covers the topic of modelling and\nexplaining deception using AI approaches from the perspectives of Computer\nScience, Philosophy, Psychology, Ethics, and Intelligence Analysis.",
        "updated": "2024-06-09 10:31:26 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.05724v1"
    },
    {
        "title": "VillagerAgent: A Graph-Based Multi-Agent Framework for Coordinating Complex Task Dependencies in Minecraft",
        "authors": "Yubo DongXukun ZhuZhengzhe PanLinchao ZhuYi Yang",
        "links": "http://arxiv.org/abs/2406.05720v1",
        "entry_id": "http://arxiv.org/abs/2406.05720v1",
        "pdf_url": "http://arxiv.org/pdf/2406.05720v1",
        "summary": "In this paper, we aim to evaluate multi-agent systems against complex\ndependencies, including spatial, causal, and temporal constraints. First, we\nconstruct a new benchmark, named VillagerBench, within the Minecraft\nenvironment.VillagerBench comprises diverse tasks crafted to test various\naspects of multi-agent collaboration, from workload distribution to dynamic\nadaptation and synchronized task execution. Second, we introduce a Directed\nAcyclic Graph Multi-Agent Framework VillagerAgent to resolve complex\ninter-agent dependencies and enhance collaborative efficiency. This solution\nincorporates a task decomposer that creates a directed acyclic graph (DAG) for\nstructured task management, an agent controller for task distribution, and a\nstate manager for tracking environmental and agent data. Our empirical\nevaluation on VillagerBench demonstrates that VillagerAgent outperforms the\nexisting AgentVerse model, reducing hallucinations and improving task\ndecomposition efficacy. The results underscore VillagerAgent's potential in\nadvancing multi-agent collaboration, offering a scalable and generalizable\nsolution in dynamic environments. The source code is open-source on GitHub\n(https://github.com/cnsdqd-dyb/VillagerAgent).",
        "updated": "2024-06-09 10:21:47 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.05720v1"
    }
]