[
    {
        "title": "LLMs with Personalities in Multi-issue Negotiation Games",
        "authors": "Sean NohHo-Chun Herbert Chang",
        "links": "http://arxiv.org/abs/2405.05248v1",
        "entry_id": "http://arxiv.org/abs/2405.05248v1",
        "pdf_url": "http://arxiv.org/pdf/2405.05248v1",
        "summary": "Powered by large language models (LLMs), AI agents have become capable of\nmany human tasks. Using the most canonical definitions of the Big Five\npersonality, we measure the ability of LLMs to negotiate within a\ngame-theoretical framework, as well as methodological challenges to measuring\nnotions of fairness and risk. Simulations (n=1,500) for both single-issue and\nmulti-issue negotiation reveal increase in domain complexity with asymmetric\nissue valuations improve agreement rates but decrease surplus from aggressive\nnegotiation. Through gradient-boosted regression and Shapley explainers, we\nfind high openness, conscientiousness, and neuroticism are associated with fair\ntendencies; low agreeableness and low openness are associated with rational\ntendencies. Low conscientiousness is associated with high toxicity. These\nresults indicate that LLMs may have built-in guardrails that default to fair\nbehavior, but can be \"jail broken\" to exploit agreeable opponents. We also\noffer pragmatic insight in how negotiation bots can be designed, and a\nframework of assessing negotiation behavior based on game theory and\ncomputational social science.",
        "updated": "2024-05-08 17:51:53 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.05248v1"
    },
    {
        "title": "Fair Voting Outcomes with Impact and Novelty Compromises? Unraveling Biases of Equal Shares in Participatory Budgeting",
        "authors": "Sajan MaharjanSrijoni MajumdarEvangelos Pournaras",
        "links": "http://arxiv.org/abs/2405.05085v1",
        "entry_id": "http://arxiv.org/abs/2405.05085v1",
        "pdf_url": "http://arxiv.org/pdf/2405.05085v1",
        "summary": "Participatory budgeting, as a paradigm for democratic innovations, engages\ncitizens in the distribution of a public budget to projects, which they propose\nand vote for implementation. So far, voting algorithms have been devised and\nstudied in social choice literature to elect projects that are popular, while\nothers prioritize on a proportional representation of voters' preferences, for\ninstance, equal shares. However, the anticipated impact and novelty in the\nbroader society by the winning projects, as selected by different algorithms,\nremains totally under-explored, lacking both a universal theory of impact for\nvoting and a rigorous framework for impact and novelty assessments. This papers\ntackles this grand challenge towards new axiomatic foundations for designing\neffective and fair voting methods. This is via new and striking insights\nderived from a large-scale analysis of biases over 345 real-world voting\noutcomes, characterized for the first time by a novel portfolio of impact and\nnovelty metrics. We find strong causal evidence that equal shares comes with\nimpact loss in several infrastructural projects of different cost levels that\nhave been so far over-represented. However, it also comes with a novel, yet\nover-represented, impact gain in welfare, education and culture. We discuss\nbroader implications of these results and how impact loss can be mitigated at\nthe stage of campaign design and project ideation.",
        "updated": "2024-05-08 14:32:09 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.05085v1"
    },
    {
        "title": "Communication-Efficient Collaborative Perception via Information Filling with Codebook",
        "authors": "Yue HuJuntong PengSifei LiuJunhao GeSi LiuSiheng Chen",
        "links": "http://arxiv.org/abs/2405.04966v1",
        "entry_id": "http://arxiv.org/abs/2405.04966v1",
        "pdf_url": "http://arxiv.org/pdf/2405.04966v1",
        "summary": "Collaborative perception empowers each agent to improve its perceptual\nability through the exchange of perceptual messages with other agents. It\ninherently results in a fundamental trade-off between perception ability and\ncommunication cost. To address this bottleneck issue, our core idea is to\noptimize the collaborative messages from two key aspects: representation and\nselection. The proposed codebook-based message representation enables the\ntransmission of integer codes, rather than high-dimensional feature maps. The\nproposed information-filling-driven message selection optimizes local messages\nto collectively fill each agent's information demand, preventing information\noverflow among multiple agents. By integrating these two designs, we propose\nCodeFilling, a novel communication-efficient collaborative perception system,\nwhich significantly advances the perception-communication trade-off and is\ninclusive to both homogeneous and heterogeneous collaboration settings. We\nevaluate CodeFilling in both a real-world dataset, DAIR-V2X, and a new\nsimulation dataset, OPV2VH+. Results show that CodeFilling outperforms previous\nSOTA Where2comm on DAIR-V2X/OPV2VH+ with 1,333/1,206 times lower communication\nvolume. Our code is available at https://github.com/PhyllisH/CodeFilling.",
        "updated": "2024-05-08 11:12:37 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.04966v1"
    },
    {
        "title": "Mitigating Negative Side Effects in Multi-Agent Systems Using Blame Assignment",
        "authors": "Pulkit RustagiSandhya Saisubramanian",
        "links": "http://arxiv.org/abs/2405.04702v1",
        "entry_id": "http://arxiv.org/abs/2405.04702v1",
        "pdf_url": "http://arxiv.org/pdf/2405.04702v1",
        "summary": "When agents that are independently trained (or designed) to complete their\nindividual tasks are deployed in a shared environment, their joint actions may\nproduce negative side effects (NSEs). As their training does not account for\nthe behavior of other agents or their joint action effects on the environment,\nthe agents have no prior knowledge of the NSEs of their actions. We model the\nproblem of mitigating NSEs in a cooperative multi-agent system as a\nLexicographic Decentralized Markov Decision Process with two objectives. The\nagents must optimize the completion of their assigned tasks while mitigating\nNSEs. We assume independence of transitions and rewards with respect to the\nagents' tasks but the joint NSE penalty creates a form of dependence in this\nsetting. To improve scalability, the joint NSE penalty is decomposed into\nindividual penalties for each agent using credit assignment, which facilitates\ndecentralized policy computation. Our results in simulation on three domains\ndemonstrate the effectiveness and scalability of our approach in mitigating\nNSEs by updating the policies of a subset of agents in the system.",
        "updated": "2024-05-07 22:42:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.04702v1"
    },
    {
        "title": "Pipe Routing with Topology Control for UAV Networks",
        "authors": "Shreyas DevarajuShivam GargAlexander IhlerSunil Kumar",
        "links": "http://arxiv.org/abs/2405.04678v1",
        "entry_id": "http://arxiv.org/abs/2405.04678v1",
        "pdf_url": "http://arxiv.org/pdf/2405.04678v1",
        "summary": "Routing protocols help in transmitting the sensed data from UAVs monitoring\nthe targets (called target UAVs) to the BS. However, the highly dynamic nature\nof an autonomous, decentralized UAV network leads to frequent route breaks or\ntraffic disruptions. Traditional routing schemes cannot quickly adapt to\ndynamic UAV networks and/or incur large control overhead and delays. To\nestablish stable, high-quality routes from target UAVs to the BS, we design a\nhybrid reactive routing scheme called pipe routing that is mobility,\ncongestion, and energy-aware. The pipe routing scheme discovers routes\non-demand and proactively switches to alternate high-quality routes within a\nlimited region around the active routes (called the pipe) when needed, reducing\nthe number of route breaks and increasing data throughput. We then design a\nnovel topology control-based pipe routing scheme to maintain robust\nconnectivity in the pipe region around the active routes, leading to improved\nroute stability and increased throughput with minimal impact on the coverage\nperformance of the UAV network.",
        "updated": "2024-05-07 21:38:13 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.04678v1"
    }
]