[
    {
        "title": "\"It Might be Technically Impressive, But It's Practically Useless to Us\": Practices, Challenges, and Opportunities for Cross-Functional Collaboration around AI within the News Industry",
        "authors": "Qing XiaoXianzhe FanFelix M. SimonBingbing ZhangMotahhare Eslami",
        "links": "http://arxiv.org/abs/2409.12000v1",
        "entry_id": "http://arxiv.org/abs/2409.12000v1",
        "pdf_url": "http://arxiv.org/pdf/2409.12000v1",
        "summary": "Recently, an increasing number of news organizations have integrated\nartificial intelligence (AI) into their workflows, leading to a further influx\nof AI technologists and data workers into the news industry. This has initiated\ncross-functional collaborations between these professionals and journalists.\nWhile prior research has explored the impact of AI-related roles entering the\nnews industry, there is a lack of studies on how cross-functional collaboration\nunfolds between AI professionals and journalists. Through interviews with 17\njournalists, 6 AI technologists, and 3 AI workers with cross-functional\nexperience from leading news organizations, we investigate the current\npractices, challenges, and opportunities for cross-functional collaboration\naround AI in today's news industry. We first study how journalists and AI\nprofessionals perceive existing cross-collaboration strategies. We further\nexplore the challenges of cross-functional collaboration and provide\nrecommendations for enhancing future cross-functional collaboration around AI\nin the news industry.",
        "updated": "2024-09-18 14:12:01 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.12000v1"
    },
    {
        "title": "Equimetrics -- Applying HAR principles to equestrian activities",
        "authors": "Jonas PöhlerKristof Van Laerhoven",
        "links": "http://arxiv.org/abs/2409.11989v1",
        "entry_id": "http://arxiv.org/abs/2409.11989v1",
        "pdf_url": "http://arxiv.org/pdf/2409.11989v1",
        "summary": "This paper presents the Equimetrics data capture system. The primary\nobjective is to apply HAR principles to enhance the understanding and\noptimization of equestrian performance. By integrating data from strategically\nplaced sensors on the rider's body and the horse's limbs, the system provides a\ncomprehensive view of their interactions. Preliminary data collection has\ndemonstrated the system's ability to accurately classify various equestrian\nactivities, such as walking, trotting, cantering, and jumping, while also\ndetecting subtle changes in rider posture and horse movement. The system\nleverages open-source hardware and software to offer a cost-effective\nalternative to traditional motion capture technologies, making it accessible\nfor researchers and trainers. The Equimetrics system represents a significant\nadvancement in equestrian performance analysis, providing objective,\ndata-driven insights that can be used to enhance training and competition\noutcomes.",
        "updated": "2024-09-18 13:55:54 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.11989v1"
    },
    {
        "title": "AI paintings vs. Human Paintings? Deciphering Public Interactions and Perceptions towards AI-Generated Paintings on TikTok",
        "authors": "Jiajun WangXiangzhe YuanSiying HuZhicong Lu",
        "links": "http://arxiv.org/abs/2409.11911v1",
        "entry_id": "http://arxiv.org/abs/2409.11911v1",
        "pdf_url": "http://arxiv.org/pdf/2409.11911v1",
        "summary": "With the development of generative AI technology, a vast array of\nAI-generated paintings (AIGP) have gone viral on social media like TikTok.\nHowever, some negative news about AIGP has also emerged. For example, in 2022,\nnumerous painters worldwide organized a large-scale anti-AI movement because of\nthe infringement in generative AI model training. This event reflected a social\nissue that, with the development and application of generative AI, public\nfeedback and feelings towards it may have been overlooked. Therefore, to\ninvestigate public interactions and perceptions towards AIGP on social media,\nwe analyzed user engagement level and comment sentiment scores of AIGP using\nhuman painting videos as a baseline. In analyzing user engagement, we also\nconsidered the possible moderating effect of the aesthetic quality of\nPaintings. Utilizing topic modeling, we identified seven reasons, including\nlooks too real, looks too scary, ambivalence, etc., leading to negative public\nperceptions of AIGP. Our work may provide instructive suggestions for future\ngenerative AI technology development and avoid potential crises in human-AI\ncollaboration.",
        "updated": "2024-09-18 12:13:09 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.11911v1"
    },
    {
        "title": "Retrieve, Annotate, Evaluate, Repeat: Leveraging Multimodal LLMs for Large-Scale Product Retrieval Evaluation",
        "authors": "Kasra HosseiniThomas KoberJosip KrapacRoland VollgrafWeiwei ChengAna Peleteiro Ramallo",
        "links": "http://arxiv.org/abs/2409.11860v1",
        "entry_id": "http://arxiv.org/abs/2409.11860v1",
        "pdf_url": "http://arxiv.org/pdf/2409.11860v1",
        "summary": "Evaluating production-level retrieval systems at scale is a crucial yet\nchallenging task due to the limited availability of a large pool of\nwell-trained human annotators. Large Language Models (LLMs) have the potential\nto address this scaling issue and offer a viable alternative to humans for the\nbulk of annotation tasks. In this paper, we propose a framework for assessing\nthe product search engines in a large-scale e-commerce setting, leveraging\nMultimodal LLMs for (i) generating tailored annotation guidelines for\nindividual queries, and (ii) conducting the subsequent annotation task. Our\nmethod, validated through deployment on a large e-commerce platform,\ndemonstrates comparable quality to human annotations, significantly reduces\ntime and cost, facilitates rapid problem discovery, and provides an effective\nsolution for production-level quality control at scale.",
        "updated": "2024-09-18 10:30:50 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.11860v1"
    },
    {
        "title": "My Views Do Not Reflect Those of My Employer: Differences in Behavior of Organizations' Official and Personal Social Media Accounts",
        "authors": "Esa PalosaariTed Hsuan Yun ChenArttu MalkamäkiMikko Kivelä",
        "links": "http://arxiv.org/abs/2409.11759v1",
        "entry_id": "http://arxiv.org/abs/2409.11759v1",
        "pdf_url": "http://arxiv.org/pdf/2409.11759v1",
        "summary": "On social media, the boundaries between people's private and public lives\noften blur. The need to navigate both roles, which are governed by distinct\nnorms, impacts how individuals conduct themselves online, and presents\nmethodological challenges for researchers. We conduct a systematic exploration\non how an organization's official Twitter accounts and its members' personal\naccounts differ. Using a climate change Twitter data set as our case, we find\nsubstantial differences in activity and connectivity across the organizational\nlevels we examined. The levels differed considerably in their overall retweet\nnetwork structures, and accounts within each level were more likely to have\nsimilar connections than accounts at different levels. We illustrate the\nimplications of these differences for applied research by showing that the\nlevels closer to the core of the organization display more sectoral homophily\nbut less triadic closure, and how each level consists of very different group\nstructures. Our results show that the common practice of solely analyzing\naccounts from a single organizational level, grouping together all levels, or\nexcluding certain levels can lead to a skewed understanding of how\norganizations are represented on social media.",
        "updated": "2024-09-18 07:31:47 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.11759v1"
    }
]