[
    {
        "title": "Evaluating the Semantic Profiling Abilities of LLMs for Natural Language Utterances in Data Visualization",
        "authors": "Hannah K. BakoArshnoor ButhaniXinyi LiuKwesi A. CobbinaZhicheng Liu",
        "links": "http://arxiv.org/abs/2407.06129v1",
        "entry_id": "http://arxiv.org/abs/2407.06129v1",
        "pdf_url": "http://arxiv.org/pdf/2407.06129v1",
        "summary": "Automatically generating data visualizations in response to human utterances\non datasets necessitates a deep semantic understanding of the data utterance,\nincluding implicit and explicit references to data attributes, visualization\ntasks, and necessary data preparation steps. Natural Language Interfaces (NLIs)\nfor data visualization have explored ways to infer such information, yet\nchallenges persist due to inherent uncertainty in human speech. Recent advances\nin Large Language Models (LLMs) provide an avenue to address these challenges,\nbut their ability to extract the relevant semantic information remains\nunexplored. In this study, we evaluate four publicly available LLMs (GPT-4,\nGemini-Pro, Llama3, and Mixtral), investigating their ability to comprehend\nutterances even in the presence of uncertainty and identify the relevant data\ncontext and visual tasks. Our findings reveal that LLMs are sensitive to\nuncertainties in utterances. Despite this sensitivity, they are able to extract\nthe relevant data context. However, LLMs struggle with inferring visualization\ntasks. Based on these results, we highlight future research directions on using\nLLMs for visualization generation.",
        "updated": "2024-07-08 17:04:31 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.06129v1"
    },
    {
        "title": "Depression Detection and Analysis using Large Language Models on Textual and Audio-Visual Modalities",
        "authors": "Avinash AnandChayan TankSarthak PolVinayak KatochShaina MehtaRajiv Ratn Shah",
        "links": "http://arxiv.org/abs/2407.06125v1",
        "entry_id": "http://arxiv.org/abs/2407.06125v1",
        "pdf_url": "http://arxiv.org/pdf/2407.06125v1",
        "summary": "Depression has proven to be a significant public health issue, profoundly\naffecting the psychological well-being of individuals. If it remains\nundiagnosed, depression can lead to severe health issues, which can manifest\nphysically and even lead to suicide. Generally, Diagnosing depression or any\nother mental disorder involves conducting semi-structured interviews alongside\nsupplementary questionnaires, including variants of the Patient Health\nQuestionnaire (PHQ) by Clinicians and mental health professionals. This\napproach places significant reliance on the experience and judgment of trained\nphysicians, making the diagnosis susceptible to personal biases. Given that the\nunderlying mechanisms causing depression are still being actively researched,\nphysicians often face challenges in diagnosing and treating the condition,\nparticularly in its early stages of clinical presentation. Recently,\nsignificant strides have been made in Artificial neural computing to solve\nproblems involving text, image, and speech in various domains. Our analysis has\naimed to leverage these state-of-the-art (SOTA) models in our experiments to\nachieve optimal outcomes leveraging multiple modalities. The experiments were\nperformed on the Extended Distress Analysis Interview Corpus Wizard of Oz\ndataset (E-DAIC) corpus presented in the Audio/Visual Emotion Challenge (AVEC)\n2019 Challenge. The proposed solutions demonstrate better results achieved by\nProprietary and Open-source Large Language Models (LLMs), which achieved a Root\nMean Square Error (RMSE) score of 3.98 on Textual Modality, beating the AVEC\n2019 challenge baseline results and current SOTA regression analysis\narchitectures. Additionally, the proposed solution achieved an accuracy of\n71.43% in the classification task. The paper also includes a novel audio-visual\nmulti-modal network that predicts PHQ-8 scores with an RMSE of 6.51.",
        "updated": "2024-07-08 17:00:51 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.06125v1"
    },
    {
        "title": "Investigating User Perceptions of Collaborative Agenda Setting in Virtual Health Counseling Session",
        "authors": "Mina FallahFarnaz NouraeiHye Sun YunTimothy Bickmore",
        "links": "http://arxiv.org/abs/2407.06123v1",
        "entry_id": "http://arxiv.org/abs/2407.06123v1",
        "pdf_url": "http://arxiv.org/pdf/2407.06123v1",
        "summary": "Virtual health counselors offer the potential to provide users with\ninformation and counseling in complex areas such as disease management and\nhealth education. However, ensuring user engagement is challenging,\nparticularly when the volume of information and length of counseling sessions\nincrease. Agenda setting a clinical counseling technique where a patient and\nclinician collaboratively decide on session topics is an effective approach to\ntailoring discussions for individual patient needs and sustaining engagement.\nWe explore the effectiveness of agenda setting in a virtual counselor system\ndesigned to counsel women for breast cancer genetic testing. In a between\nsubjects study, we assessed three versions of the system with varying levels of\nuser control in the system's agenda setting approach. We found that\nparticipants' knowledge improved across all conditions. Although our results\nshowed that any type of agenda setting was perceived as useful, regardless of\nuser control, interviews revealed a preference for more collaboration and user\ninvolvement in the agenda setting process. Our study highlights the importance\nof using patient-centered approaches, such as tailored discussions, when using\nvirtual counselors in healthcare.",
        "updated": "2024-07-08 16:59:50 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.06123v1"
    },
    {
        "title": "Exploring Human-LLM Conversations: Mental Models and the Originator of Toxicity",
        "authors": "Johannes SchneiderArianna Casanova FloresAnne-Catherine Kranz",
        "links": "http://arxiv.org/abs/2407.05977v1",
        "entry_id": "http://arxiv.org/abs/2407.05977v1",
        "pdf_url": "http://arxiv.org/pdf/2407.05977v1",
        "summary": "This study explores real-world human interactions with large language models\n(LLMs) in diverse, unconstrained settings in contrast to most prior research\nfocusing on ethically trimmed models like ChatGPT for specific tasks. We aim to\nunderstand the originator of toxicity. Our findings show that although LLMs are\nrightfully accused of providing toxic content, it is mostly demanded or at\nleast provoked by humans who actively seek such content. Our manual analysis of\nhundreds of conversations judged as toxic by APIs commercial vendors, also\nraises questions with respect to current practices of what user requests are\nrefused to answer. Furthermore, we conjecture based on multiple empirical\nindicators that humans exhibit a change of their mental model, switching from\nthe mindset of interacting with a machine more towards interacting with a\nhuman.",
        "updated": "2024-07-08 14:20:05 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.05977v1"
    },
    {
        "title": "Investigating Trading Mechanisms as a Driver for User Experience in Racing Games",
        "authors": "Georg Arbesser-RastburgThomas OlipJohanna Pirker",
        "links": "http://arxiv.org/abs/2407.05874v1",
        "entry_id": "http://arxiv.org/abs/2407.05874v1",
        "pdf_url": "http://arxiv.org/pdf/2407.05874v1",
        "summary": "The exchange of digital goods has become a significant aspect of the global\neconomy, with digital products offering inexpensive reproduction and\ndistribution. In-game objects, a type of digital currency, have emerged as\ntradable commodities within gaming ecosystems. Despite extensive research on\nvarious aspects of digital goods, little attention has been given to the impact\nof in-game trading mechanisms on user experience. This paper presents a study\naimed at evaluating the influence of trading systems on user experience in a\nracing game context. We developed a simple racing game featuring an in-game\nmarket for buying and selling car variants and conducted an A/B study comparing\nuser experiences between groups utilizing the trading system and those\nunlocking cars through race completion. Our findings suggest that while the\ntrading system did not significantly alter the overall user experience, further\nexploration of diverse trading approaches may offer insights into their impact\non user engagement.",
        "updated": "2024-07-08 12:33:51 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.05874v1"
    }
]