[
    {
        "title": "Eliminating Majority Illusion is Easy",
        "authors": "Jack DippelMax Dupré la TourApril NiuSanjukta RoyAdrian Vetta",
        "links": "http://arxiv.org/abs/2407.20187v1",
        "entry_id": "http://arxiv.org/abs/2407.20187v1",
        "pdf_url": "http://arxiv.org/pdf/2407.20187v1",
        "summary": "Majority Illusion is a phenomenon in social networks wherein the decision by\nthe majority of the network is not the same as one's personal social circle's\nmajority, leading to an incorrect perception of the majority in a large\nnetwork. In this paper, we present polynomial-time algorithms which can\neliminate majority illusion in a network by altering as few connections as\npossible. Additionally, we prove that the more general problem of ensuring all\nneighbourhoods in the network are at least a $p$-fraction of the majority is\nNP-hard for most values of $p$.",
        "updated": "2024-07-29 17:13:41 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.20187v1"
    },
    {
        "title": "Navigation services amplify concentration of traffic and emissions in our cities",
        "authors": "Giuliano CornacchiaMirco NanniDino PedreschiLuca Pappalardo",
        "links": "http://arxiv.org/abs/2407.20004v1",
        "entry_id": "http://arxiv.org/abs/2407.20004v1",
        "pdf_url": "http://arxiv.org/pdf/2407.20004v1",
        "summary": "The proliferation of human-AI ecosystems involving human interaction with\nalgorithms, such as assistants and recommenders, raises concerns about\nlarge-scale social behaviour. Despite evidence of such phenomena across several\ncontexts, the collective impact of GPS navigation services remains unclear:\nwhile beneficial to the user, they can also cause chaos if too many vehicles\nare driven through the same few roads. Our study employs a simulation framework\nto assess navigation services' influence on road network usage and CO2\nemissions. The results demonstrate a universal pattern of amplified conformity:\nincreasing adoption rates of navigation services cause a reduction of route\ndiversity of mobile travellers and increased concentration of traffic and\nemissions on fewer roads, thus exacerbating an unequal distribution of negative\nexternalities on selected neighbourhoods. Although navigation services\nrecommendations can help reduce CO2 emissions when their adoption rate is low,\nthese benefits diminish or even disappear when the adoption rate is high and\nexceeds a certain city- and service-dependent threshold. We summarize these\ndiscoveries in a non-linear function that connects the marginal increase of\nconformity with the marginal reduction in CO2 emissions. Our simulation\napproach addresses the challenges posed by the complexity of transportation\nsystems and the lack of data and algorithmic transparency.",
        "updated": "2024-07-29 13:35:52 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.20004v1"
    },
    {
        "title": "A Resource-Efficient Decentralized Sequential Planner for Spatiotemporal Wildfire Mitigation",
        "authors": "Josy JohnShridhar VelhalSuresh Sundaram",
        "links": "http://arxiv.org/abs/2407.19163v1",
        "entry_id": "http://arxiv.org/abs/2407.19163v1",
        "pdf_url": "http://arxiv.org/pdf/2407.19163v1",
        "summary": "This paper proposes a Conflict-aware Resource-Efficient Decentralized\nSequential planner (CREDS) for early wildfire mitigation using multiple\nheterogeneous Unmanned Aerial Vehicles (UAVs). Multi-UAV wildfire management\nscenarios are non-stationary, with spatially clustered dynamically spreading\nfires, potential pop-up fires, and partial observability due to limited UAV\nnumbers and sensing range. The objective of CREDS is to detect and sequentially\nmitigate all growing fires as Single-UAV Tasks (SUT), minimizing biodiversity\nloss through rapid UAV intervention and promoting efficient resource\nutilization by avoiding complex multi-UAV coordination. CREDS employs a\nthree-phased approach, beginning with fire detection using a search algorithm,\nfollowed by local trajectory generation using the auction-based\nResource-Efficient Decentralized Sequential planner (REDS), incorporating the\nnovel non-stationary cost function, the Deadline-Prioritized Mitigation Cost\n(DPMC). Finally, a conflict-aware consensus algorithm resolves conflicts to\ndetermine a global trajectory for spatiotemporal mitigation. The performance\nevaluation of the CREDS for partial and full observability conditions with both\nheterogeneous and homogeneous UAV teams for different fires-to-UAV ratios\ndemonstrates a $100\\%$ success rate for ratios up to $4$ and a high success\nrate for the critical ratio of $5$, outperforming baselines. Heterogeneous UAV\nteams outperform homogeneous teams in handling heterogeneous deadlines of SUT\nmitigation. CREDS exhibits scalability and $100\\%$ convergence, demonstrating\nrobustness against potential deadlock assignments, enhancing its success rate\ncompared to the baseline approaches.",
        "updated": "2024-07-27 04:12:08 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.19163v1"
    },
    {
        "title": "Genetic Algorithm-based Routing and Scheduling for Wildfire Suppression using a Team of UAVs",
        "authors": "Josy JohnSuresh Sundaram",
        "links": "http://arxiv.org/abs/2407.19162v1",
        "entry_id": "http://arxiv.org/abs/2407.19162v1",
        "pdf_url": "http://arxiv.org/pdf/2407.19162v1",
        "summary": "This paper addresses early wildfire management using a team of UAVs for the\nmitigation of fires. The early detection and mitigation systems help in\nalleviating the destruction with reduced resource utilization. A Genetic\nAlgorithm-based Routing and Scheduling with Time constraints (GARST) is\nproposed to find the shortest schedule route to mitigate the fires as Single\nUAV Tasks (SUT). The objective of GARST is to compute the route and schedule of\nthe UAVs so that the UAVS reach the assigned fire locations before the fire\nbecomes a Multi UAV Task (MUT) and completely quench the fire using the\nextinguisher. The fitness function used for the genetic algorithm is the total\nquench time for mitigation of total fires. The selection, crossover, mutation\noperators, and elitist strategies collectively ensure the exploration and\nexploitation of the solution space, maintaining genetic diversity, preventing\npremature convergence, and preserving high-performing individuals for the\neffective optimization of solutions. The GARST effectively addresses the\nchallenges posed by the NP-complete problem of routing and scheduling for\ngrowing tasks with time constraints. The GARST is able to handle infeasible\nscenarios effectively, contributing to the overall optimization of the wildfire\nmanagement system.",
        "updated": "2024-07-27 04:10:34 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.19162v1"
    },
    {
        "title": "Collaborative Adaptation for Recovery from Unforeseen Malfunctions in Discrete and Continuous MARL Domains",
        "authors": "Yasin FindikHunter HasenfusReza Azadeh",
        "links": "http://arxiv.org/abs/2407.19144v1",
        "entry_id": "http://arxiv.org/abs/2407.19144v1",
        "pdf_url": "http://arxiv.org/pdf/2407.19144v1",
        "summary": "Cooperative multi-agent learning plays a crucial role for developing\neffective strategies to achieve individual or shared objectives in multi-agent\nteams. In real-world settings, agents may face unexpected failures, such as a\nrobot's leg malfunctioning or a teammate's battery running out. These\nmalfunctions decrease the team's ability to accomplish assigned task(s),\nespecially if they occur after the learning algorithms have already converged\nonto a collaborative strategy. Current leading approaches in Multi-Agent\nReinforcement Learning (MARL) often recover slowly -- if at all -- from such\nmalfunctions. To overcome this limitation, we present the Collaborative\nAdaptation (CA) framework, highlighting its unique capability to operate in\nboth continuous and discrete domains. Our framework enhances the adaptability\nof agents to unexpected failures by integrating inter-agent relationships into\ntheir learning processes, thereby accelerating the recovery from malfunctions.\nWe evaluated our framework's performance through experiments in both discrete\nand continuous environments. Empirical results reveal that in scenarios\ninvolving unforeseen malfunction, although state-of-the-art algorithms often\nconverge on sub-optimal solutions, the proposed CA framework mitigates and\nrecovers more effectively.",
        "updated": "2024-07-27 02:04:58 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.19144v1"
    }
]