[
    {
        "title": "Knowledge Acquisition and Integration with Expert-in-the-loop",
        "authors": "Sajjadur RahmanFrederick ChoiHannah KimDan ZhangEstevam Hruschka",
        "links": "http://arxiv.org/abs/2402.03291v1",
        "entry_id": "http://arxiv.org/abs/2402.03291v1",
        "pdf_url": "http://arxiv.org/pdf/2402.03291v1",
        "summary": "Constructing and serving knowledge graphs (KGs) is an iterative and\nhuman-centered process involving on-demand programming and analysis. In this\npaper, we present Kyurem, a programmable and interactive widget library that\nfacilitates human-in-the-loop knowledge acquisition and integration to enable\ncontinuous curation a knowledge graph (KG). Kyurem provides a seamless\nenvironment within computational notebooks where data scientists explore a KG\nto identify opportunities for acquiring new knowledge and verify\nrecommendations provided by AI agents for integrating the acquired knowledge in\nthe KG. We refined Kyurem through participatory design and conducted case\nstudies in a real-world setting for evaluation. The case-studies show that\nintroduction of Kyurem within an existing HR knowledge graph construction and\nserving platform improved the user experience of the experts and helped\neradicate inefficiencies related to knowledge acquisition and integration tasks",
        "updated": "2024-02-05 18:49:55 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.03291v1"
    },
    {
        "title": "Stepping into the Right Shoes: The Effects of User-Matched Avatar Ethnicity and Gender on Sense of Embodiment in Virtual Reality",
        "authors": "Tiffany D. DoCamille IsabellaRyan P. McMahan",
        "links": "http://arxiv.org/abs/2402.03279v1",
        "entry_id": "http://arxiv.org/abs/2402.03279v1",
        "pdf_url": "http://arxiv.org/pdf/2402.03279v1",
        "summary": "In many consumer virtual reality (VR) applications, users embody predefined\ncharacters that offer minimal customization options, frequently emphasizing\nstorytelling over user choice. We explore whether matching a user's physical\ncharacteristics, specifically ethnicity and gender, with their virtual\nself-avatar affects their sense of embodiment in VR. We conducted a 2 x 2\nwithin-subjects experiment (n=32) with a diverse user population to explore the\nimpact of matching or not matching a user's self-avatar to their ethnicity and\ngender on their sense of embodiment. Our results indicate that matching the\nethnicity of the user and their self-avatar significantly enhances sense of\nembodiment regardless of gender, extending across various aspects, including\nappearance, response, and ownership. We also found that matching gender\nsignificantly enhanced ownership, suggesting that this aspect is influenced by\nmatching both ethnicity and gender. Interestingly, we found that matching\nethnicity specifically affects self-location while matching gender specifically\naffects one's body ownership.",
        "updated": "2024-02-05 18:36:11 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.03279v1"
    },
    {
        "title": "Meeting Bridges: Designing Information Artifacts that Bridge from Synchronous Meetings to Asynchronous Collaboration",
        "authors": "Ruotong WangLin QiuJustin CranshawAmy X. Zhang",
        "links": "http://arxiv.org/abs/2402.03259v1",
        "entry_id": "http://arxiv.org/abs/2402.03259v1",
        "pdf_url": "http://arxiv.org/pdf/2402.03259v1",
        "summary": "A recent surge in remote meetings has led to complaints of ``Zoom fatigue''\nand ``collaboration overload,'' negatively impacting worker productivity and\nwell-being. One way to alleviate the burden of meetings is to de-emphasize\ntheir synchronous participation by shifting work to and enabling sensemaking\nduring post-meeting asynchronous activities. Towards this goal, we propose the\ndesign concept of meeting bridges, or information artifacts that can\nencapsulate meeting information towards bridging to and facilitating\npost-meeting activities. Through 13 interviews and a survey of 198 information\nworkers, we learn how people use online meeting information after meetings are\nover, finding five main uses: as an archive, as task reminders, to onboard or\nsupport inclusion, for group sensemaking, and as a launching point for\nfollow-on collaboration. However, we also find that current common meeting\nartifacts, such as notes and recordings, present challenges in serving as\nmeeting bridges. After conducting co-design sessions with 16 participants, we\ndistill key principles for the design of meeting bridges to optimally support\nasynchronous collaboration goals. Overall, our findings point to the\nopportunity of designing information artifacts that not only support users to\naccess but also continue to transform and engage in meeting information\npost-meeting.",
        "updated": "2024-02-05 18:17:15 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.03259v1"
    },
    {
        "title": "Security Advice for Parents and Children About Content Filtering and Circumvention as Found on YouTube and TikTok",
        "authors": "Ran ElgedawyJohn SadikAnuj GautamTrinity BissahoyoChristopher ChildressJacob LeonardClay ShubertScott Ruoti",
        "links": "http://arxiv.org/abs/2402.03255v1",
        "entry_id": "http://arxiv.org/abs/2402.03255v1",
        "pdf_url": "http://arxiv.org/pdf/2402.03255v1",
        "summary": "In today's digital age, concerns about online security and privacy have\nbecome paramount. However, addressing these issues can be difficult, especially\nwithin the context of family relationships, wherein parents and children may\nhave conflicting interests. In this environment, parents and children may turn\nto online security advice to determine how to proceed. In this paper, we\nexamine the advice available to parents and children regarding content\nfiltering and circumvention as found on YouTube and TikTok. In an analysis of\n839 videos returned from queries on these topics, we found that half (n=399)\nprovide relevant advice. Our results show that of these videos, roughly\nthree-quarters are accurate, with the remaining one-fourth containing factually\nincorrect advice. We find that videos targeting children are both more likely\nto be incorrect and actionable than videos targeting parents, leaving children\nat increased risk of taking harmful action. Moreover, we find that while advice\nvideos targeting parents will occasionally discuss the ethics of content\nfiltering and device monitoring (including recommendations to respect\nchildren's autonomy) no such discussion of the ethics or risks of circumventing\ncontent filtering is given to children, leaving them unaware of any risks that\nmay be involved with doing so. Ultimately, our research indicates that\nvideo-based social media sites are already effective sources of security advice\npropagation and that the public would benefit from security researchers and\npractitioners engaging more with these platforms, both for the creation of\ncontent and of tools designed to help with more effective filtering.",
        "updated": "2024-02-05 18:12:33 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.03255v1"
    },
    {
        "title": "Feature-Action Design Patterns for Storytelling Visualizations with Time Series Data",
        "authors": "Saiful KhanScott JonesBenjamin BachJaehoon ChaMin ChenJulie MeikleJonathan C RobertsJeyan ThiyagalingamJo WoodPanagiotis D. Ritsos",
        "links": "http://arxiv.org/abs/2402.03116v1",
        "entry_id": "http://arxiv.org/abs/2402.03116v1",
        "pdf_url": "http://arxiv.org/pdf/2402.03116v1",
        "summary": "We present a method to create storytelling visualization with time series\ndata. Many personal decisions nowadays rely on access to dynamic data\nregularly, as we have seen during the COVID-19 pandemic. It is thus desirable\nto construct storytelling visualization for dynamic data that is selected by an\nindividual for a specific context. Because of the need to tell data-dependent\nstories, predefined storyboards based on known data cannot accommodate dynamic\ndata easily nor scale up to many different individuals and contexts. Motivated\ninitially by the need to communicate time series data during the COVID-19\npandemic, we developed a novel computer-assisted method for meta-authoring of\nstories, which enables the design of storyboards that include feature-action\npatterns in anticipation of potential features that may appear in dynamically\narrived or selected data. In addition to meta-storyboards involving COVID-19\ndata, we also present storyboards for telling stories about progress in a\nmachine learning workflow. Our approach is complementary to traditional methods\nfor authoring storytelling visualization, and provides an efficient means to\nconstruct data-dependent storyboards for different data-streams of similar\ncontexts.",
        "updated": "2024-02-05 15:45:59 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.03116v1"
    }
]