[
    {
        "title": "PhysioLLM: Supporting Personalized Health Insights with Wearables and Large Language Models",
        "authors": "Cathy Mengying FangValdemar DanryNathan WhitmoreAndria BaoAndrew HutchisonCayden PiercePattie Maes",
        "links": "http://arxiv.org/abs/2406.19283v1",
        "entry_id": "http://arxiv.org/abs/2406.19283v1",
        "pdf_url": "http://arxiv.org/pdf/2406.19283v1",
        "summary": "We present PhysioLLM, an interactive system that leverages large language\nmodels (LLMs) to provide personalized health understanding and exploration by\nintegrating physiological data from wearables with contextual information.\nUnlike commercial health apps for wearables, our system offers a comprehensive\nstatistical analysis component that discovers correlations and trends in user\ndata, allowing users to ask questions in natural language and receive generated\npersonalized insights, and guides them to develop actionable goals. As a case\nstudy, we focus on improving sleep quality, given its measurability through\nphysiological data and its importance to general well-being. Through a user\nstudy with 24 Fitbit watch users, we demonstrate that PhysioLLM outperforms\nboth the Fitbit App alone and a generic LLM chatbot in facilitating a deeper,\npersonalized understanding of health data and supporting actionable steps\ntoward personal health goals.",
        "updated": "2024-06-27 15:55:53 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.19283v1"
    },
    {
        "title": "Simulating Classroom Education with LLM-Empowered Agents",
        "authors": "Zheyuan ZhangDaniel Zhang-LiJifan YuLinlu GongJinchang ZhouZhiyuan LiuLei HouJuanzi Li",
        "links": "http://arxiv.org/abs/2406.19226v1",
        "entry_id": "http://arxiv.org/abs/2406.19226v1",
        "pdf_url": "http://arxiv.org/pdf/2406.19226v1",
        "summary": "Large language models (LLMs) have been employed in various intelligent\neducational tasks to assist teaching. While preliminary explorations have\nfocused on independent LLM-empowered agents for specific educational tasks, the\npotential for LLMs within a multi-agent collaborative framework to simulate a\nclassroom with real user participation remains unexplored. In this work, we\npropose SimClass, a multi-agent classroom simulation framework involving user\nparticipation. We recognize representative class roles and introduce a novel\nclass control mechanism for automatic classroom teaching, and conduct user\nexperiments in two real-world courses. Utilizing the Flanders Interactive\nAnalysis System and Community of Inquiry theoretical frame works from\neducational analysis, we demonstrate that LLMs can simulate traditional\nclassroom interaction patterns effectively while enhancing user's experience.\nWe also observe emergent group behaviors among agents in SimClass, where agents\ncollaborate to create enlivening interactions in classrooms to improve user\nlearning process. We hope this work pioneers the application of LLM-empowered\nmulti-agent systems in virtual classroom teaching.",
        "updated": "2024-06-27 14:51:07 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.19226v1"
    },
    {
        "title": "A look under the hood of the Interactive Deep Learning Enterprise (No-IDLE)",
        "authors": "Daniel SonntagMichael BarzThiago Gouvêa",
        "links": "http://arxiv.org/abs/2406.19054v1",
        "entry_id": "http://arxiv.org/abs/2406.19054v1",
        "pdf_url": "http://arxiv.org/pdf/2406.19054v1",
        "summary": "This DFKI technical report presents the anatomy of the No-IDLE prototype\nsystem (funded by the German Federal Ministry of Education and Research) that\nprovides not only basic and fundamental research in interactive machine\nlearning, but also reveals deeper insights into users' behaviours, needs, and\ngoals. Machine learning and deep learning should become accessible to millions\nof end users. No-IDLE's goals and scienfific challenges centre around the\ndesire to increase the reach of interactive deep learning solutions for\nnon-experts in machine learning. One of the key innovations described in this\ntechnical report is a methodology for interactive machine learning combined\nwith multimodal interaction which will become central when we start interacting\nwith semi-intelligent machines in the upcoming area of neural networks and\nlarge language models.",
        "updated": "2024-06-27 10:01:56 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.19054v1"
    },
    {
        "title": "State-Based Automation for Time-Restricted Eating Adherence",
        "authors": "Samuel E. ArmstrongAaron D. MullenJ. Matthew ThomasDorothy D. SearsJulie S. PendergastJeffrey TalbertCody Bumgardner",
        "links": "http://arxiv.org/abs/2406.18718v1",
        "entry_id": "http://arxiv.org/abs/2406.18718v1",
        "pdf_url": "http://arxiv.org/pdf/2406.18718v1",
        "summary": "Developing and enforcing study protocols is a foundational component of\nmedical research. As study complexity for participant interactions increases,\ntranslating study protocols to supporting application code becomes challenging.\nA collaboration exists between the University of Kentucky and Arizona State\nUniversity to determine the efficacy of time-restricted eating in improving\nmetabolic risk among postmenopausal women. This study utilizes a graph-based\napproach to monitor and support adherence to a designated schedule, enabling\nthe validation and step-wise audit of participants' statuses to derive\ndependable conclusions. A texting service, driven by a participant graph,\nautomatically manages interactions and collects data. Participant data is then\naccessible to the research study team via a website, which enables viewing,\nmanagement, and exportation. This paper presents a system for automatically\nmanaging participants in a time-restricted eating study that eliminates\ntime-consuming interactions with participants.",
        "updated": "2024-06-26 19:37:36 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.18718v1"
    },
    {
        "title": "Simulating The U.S. Senate: An LLM-Driven Agent Approach to Modeling Legislative Behavior and Bipartisanship",
        "authors": "Zachary R. BakerZarif L. Azher",
        "links": "http://arxiv.org/abs/2406.18702v1",
        "entry_id": "http://arxiv.org/abs/2406.18702v1",
        "pdf_url": "http://arxiv.org/pdf/2406.18702v1",
        "summary": "This study introduces a novel approach to simulating legislative processes\nusing LLM-driven virtual agents, focusing on the U.S. Senate Intelligence\nCommittee. We developed agents representing individual senators and placed them\nin simulated committee discussions. The agents demonstrated the ability to\nengage in realistic debate, provide thoughtful reflections, and find bipartisan\nsolutions under certain conditions. Notably, the simulation also showed promise\nin modeling shifts towards bipartisanship in response to external\nperturbations. Our results indicate that this LLM-driven approach could become\na valuable tool for understanding and potentially improving legislative\nprocesses, supporting a broader pattern of findings highlighting how LLM-based\nagents can usefully model real-world phenomena. Future works will focus on\nenhancing agent complexity, expanding the simulation scope, and exploring\napplications in policy testing and negotiation.",
        "updated": "2024-06-26 19:10:51 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.18702v1"
    }
]