[
    {
        "title": "Towards a Formalisation of Value-based Actions and Consequentialist Ethics",
        "authors": "Adam WynerTomasz ZurekDOrota Stachura-Zurek",
        "links": "http://arxiv.org/abs/2403.16719v1",
        "entry_id": "http://arxiv.org/abs/2403.16719v1",
        "pdf_url": "http://arxiv.org/pdf/2403.16719v1",
        "summary": "Agents act to bring about a state of the world that is more compatible with\ntheir personal or institutional values. To formalise this intuition, the paper\nproposes an action framework based on the STRIPS formalisation. Technically,\nthe contribution expresses actions in terms of Value-based Formal Reasoning\n(VFR), which provides a set of propositions derived from an Agent's value\nprofile and the Agent's assessment of propositions with respect to the profile.\nConceptually, the contribution provides a computational framework for a form of\nconsequentialist ethics which is satisficing, luralistic, act-based, and\npreferential.",
        "updated": "2024-03-25 12:56:48 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.16719v1"
    },
    {
        "title": "Norm Violation Detection in Multi-Agent Systems using Large Language Models: A Pilot Study",
        "authors": "Shawn HeSurangika RanathungaStephen CranefieldBastin Tony Roy Savarimuthu",
        "links": "http://arxiv.org/abs/2403.16517v1",
        "entry_id": "http://arxiv.org/abs/2403.16517v1",
        "pdf_url": "http://arxiv.org/pdf/2403.16517v1",
        "summary": "Norms are an important component of the social fabric of society by\nprescribing expected behaviour. In Multi-Agent Systems (MAS), agents\ninteracting within a society are equipped to possess social capabilities such\nas reasoning about norms and trust. Norms have long been of interest within the\nNormative Multi-Agent Systems community with researchers studying topics such\nas norm emergence, norm violation detection and sanctioning. However, these\nstudies have some limitations: they are often limited to simple domains, norms\nhave been represented using a variety of representations with no standard\napproach emerging, and the symbolic reasoning mechanisms generally used may\nsuffer from a lack of extensibility and robustness. In contrast, Large Language\nModels (LLMs) offer opportunities to discover and reason about norms across a\nlarge range of social situations. This paper evaluates the capability of LLMs\nto detecting norm violations. Based on simulated data from 80 stories in a\nhousehold context, with varying complexities, we investigated whether 10 norms\nare violated. For our evaluations we first obtained the ground truth from three\nhuman evaluators for each story. Then, the majority result was compared against\nthe results from three well-known LLM models (Llama 2 7B, Mixtral 7B and\nChatGPT-4). Our results show the promise of ChatGPT-4 for detecting norm\nviolations, with Mixtral some distance behind. Also, we identify areas where\nthese models perform poorly and discuss implications for future work.",
        "updated": "2024-03-25 08:01:33 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.16517v1"
    },
    {
        "title": "Social Deliberation vs. Social Contracts in Self-Governing Voluntary Organisations",
        "authors": "Matthew ScottAsimina MertzaniCiske SmitStefan SarkadiJeremy Pitt",
        "links": "http://arxiv.org/abs/2403.16329v1",
        "entry_id": "http://arxiv.org/abs/2403.16329v1",
        "pdf_url": "http://arxiv.org/pdf/2403.16329v1",
        "summary": "Self-organising multi-agent systems regulate their components' behaviour\nvoluntarily, according to a set of socially-constructed, mutually-agreed, and\nmutable social arrangements. In some systems, these arrangements may be applied\nwith a frequency, at a scale and within implicit cost constraints such that\nperformance becomes a pressing issue. This paper introduces the\n\\textit{Megabike Scenario}, which consists of a negotiated agreement on a\nrelatively 'large' set of conventional rules, 'frequent' 'democratic'\ndecision-making according to those rules, and a resource-bounded imperative to\nreach 'correct' decisions. A formalism is defined for effective rule\nrepresentation and processing in the scenario, and is evaluated against five\ninterleaved socio-functional requirements. System performance is also evaluated\nempirically through simulation. We conclude that to self-organise their social\narrangements, agents need some awareness of their own limitations and the value\nof compromise.",
        "updated": "2024-03-24 23:34:40 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.16329v1"
    },
    {
        "title": "Ultra Low-Cost Two-Stage Multimodal System for Non-Normative Behavior Detection",
        "authors": "Albert LuStephen Cranefield",
        "links": "http://arxiv.org/abs/2403.16151v1",
        "entry_id": "http://arxiv.org/abs/2403.16151v1",
        "pdf_url": "http://arxiv.org/pdf/2403.16151v1",
        "summary": "The online community has increasingly been inundated by a toxic wave of\nharmful comments. In response to this growing challenge, we introduce a\ntwo-stage ultra-low-cost multimodal harmful behavior detection method designed\nto identify harmful comments and images with high precision and recall rates.\nWe first utilize the CLIP-ViT model to transform tweets and images into\nembeddings, effectively capturing the intricate interplay of semantic meaning\nand subtle contextual clues within texts and images. Then in the second stage,\nthe system feeds these embeddings into a conventional machine learning\nclassifier like SVM or logistic regression, enabling the system to be trained\nrapidly and to perform inference at an ultra-low cost. By converting tweets\ninto rich multimodal embeddings through the CLIP-ViT model and utilizing them\nto train conventional machine learning classifiers, our system is not only\ncapable of detecting harmful textual information with near-perfect performance,\nachieving precision and recall rates above 99\\% but also demonstrates the\nability to zero-shot harmful images without additional training, thanks to its\nmultimodal embedding input. This capability empowers our system to identify\nunseen harmful images without requiring extensive and costly image datasets.\nAdditionally, our system quickly adapts to new harmful content; if a new\nharmful content pattern is identified, we can fine-tune the classifier with the\ncorresponding tweets' embeddings to promptly update the system. This makes it\nwell suited to addressing the ever-evolving nature of online harmfulness,\nproviding online communities with a robust, generalizable, and cost-effective\ntool to safeguard their communities.",
        "updated": "2024-03-24 13:44:32 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.16151v1"
    },
    {
        "title": "Team Coordination on Graphs: Problem, Analysis, and Algorithms",
        "authors": "Manshi LimbuYanlin ZhouGregory SteinXuan WangDaigo ShishikaXuesu Xiao",
        "links": "http://arxiv.org/abs/2403.15946v1",
        "entry_id": "http://arxiv.org/abs/2403.15946v1",
        "pdf_url": "http://arxiv.org/pdf/2403.15946v1",
        "summary": "Team Coordination on Graphs with Risky Edges (TCGRE) is a recently emerged\nproblem, in which a robot team collectively reduces graph traversal cost\nthrough support from one robot to another when the latter traverses a risky\nedge. Resembling the traditional Multi-Agent Path Finding (MAPF) problem, both\nclassical and learning-based methods have been proposed to solve TCGRE,\nhowever, they lacked either computation efficiency or optimality assurance. In\nthis paper, we reformulate TCGRE as a constrained optimization and perform\nrigorous mathematical analysis. Our theoretical analysis shows the NP-hardness\nof TCGRE by reduction from the Maximum 3D Matching problem and that efficient\ndecomposition is a key to tackle this combinatorial optimization problem.\nFurther more, we design three classes of algorithms to solve TCGRE, i.e., Joint\nState Graph (JSG) based, coordination based, and receding-horizon sub-team\nbased solutions. Each of these proposed algorithms enjoy different provable\noptimality and efficiency characteristics that are demonstrated in our\nextensive experiments.",
        "updated": "2024-03-23 22:31:17 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.15946v1"
    }
]