[
    {
        "title": "Value-based Resource Matching with Fairness Criteria: Application to Agricultural Water Trading",
        "authors": "Abhijin AdigaYohai TrabelsiTanvir FerdousiMadhav MaratheS. S. RaviSamarth SwarupAnil Kumar VullikantiMandy L. WilsonSarit KrausReetwika BasuSupriya SavalkarMatthew YourekMichael BradyKirti RajagopalanJonathan Yoder",
        "links": "http://arxiv.org/abs/2402.06576v2",
        "entry_id": "http://arxiv.org/abs/2402.06576v2",
        "pdf_url": "http://arxiv.org/pdf/2402.06576v2",
        "summary": "Optimal allocation of agricultural water in the event of droughts is an\nimportant global problem. In addressing this problem, many aspects, including\nthe welfare of farmers, the economy, and the environment, must be considered.\nUnder this backdrop, our work focuses on several resource-matching problems\naccounting for agents with multi-crop portfolios, geographic constraints, and\nfairness. First, we address a matching problem where the goal is to maximize a\nwelfare function in two-sided markets where buyers' requirements and sellers'\nsupplies are represented by value functions that assign prices (or costs) to\nspecified volumes of water. For the setting where the value functions satisfy\ncertain monotonicity properties, we present an efficient algorithm that\nmaximizes a social welfare function. When there are minimum water requirement\nconstraints, we present a randomized algorithm which ensures that the\nconstraints are satisfied in expectation. For a single seller--multiple buyers\nsetting with fairness constraints, we design an efficient algorithm that\nmaximizes the minimum level of satisfaction of any buyer. We also present\ncomputational complexity results that highlight the limits on the\ngeneralizability of our results. We evaluate the algorithms developed in our\nwork with experiments on both real-world and synthetic data sets with respect\nto drought severity, value functions, and seniority of agents.",
        "updated": "2024-02-12 02:17:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.06576v2"
    },
    {
        "title": "Modelling Human Values for AI Reasoning",
        "authors": "Nardine OsmanMark d'Inverno",
        "links": "http://arxiv.org/abs/2402.06359v1",
        "entry_id": "http://arxiv.org/abs/2402.06359v1",
        "pdf_url": "http://arxiv.org/pdf/2402.06359v1",
        "summary": "One of today's most significant societal challenges is building AI systems\nwhose behaviour, or the behaviour it enables within communities of interacting\nagents (human and artificial), aligns with human values. To address this\nchallenge, we detail a formal model of human values for their explicit\ncomputational representation. To our knowledge, this has not been attempted as\nyet, which is surprising given the growing volume of research integrating\nvalues within AI. Taking as our starting point the wealth of research\ninvestigating the nature of human values from social psychology over the last\nfew decades, we set out to provide such a formal model. We show how this model\ncan provide the foundational apparatus for AI-based reasoning over values, and\ndemonstrate its applicability in real-world use cases. We illustrate how our\nmodel captures the key ideas from social psychology research and propose a\nroadmap for future integrated, and interdisciplinary, research into human\nvalues in AI. The ability to automatically reason over values not only helps\naddress the value alignment problem but also facilitates the design of AI\nsystems that can support individuals and communities in making more informed,\nvalue-aligned decisions. More and more, individuals and organisations are\nmotivated to understand their values more explicitly and explore whether their\nbehaviours and attitudes properly reflect them. Our work on modelling human\nvalues will enable AI systems to be designed and deployed to meet this growing\nneed.",
        "updated": "2024-02-09 12:08:49 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.06359v1"
    },
    {
        "title": "Towards participatory multi-modeling for policy support across domains and scales: a systematic procedure for integral multi-model design",
        "authors": "Vittorio NespecaRick QuaxMarcel G. M. Olde RikkertHubert P. L. M. KorziliusVincent A. W. J. MarchauSophie HadijsotiriouTom OreelJannie CoenenHeiman WertheimAlexey VoinovEtiënne A. J. A. RouwetteVítor V. Vasconcelos",
        "links": "http://arxiv.org/abs/2402.06228v1",
        "entry_id": "http://arxiv.org/abs/2402.06228v1",
        "pdf_url": "http://arxiv.org/pdf/2402.06228v1",
        "summary": "Policymaking for complex challenges such as pandemics necessitates the\nconsideration of intricate implications across multiple domains and scales.\nComputational models can support policymaking, but a single model is often\ninsufficient for such multidomain and scale challenges. Multi-models comprising\nseveral interacting computational models at different scales or relying on\ndifferent modeling paradigms offer a potential solution. Such multi-models can\nbe assembled from existing computational models (i.e., integrated modeling) or\nbe designed conceptually as a whole before their computational implementation\n(i.e., integral modeling). Integral modeling is particularly valuable for novel\npolicy problems, such as those faced in the early stages of a pandemic, where\nrelevant models may be unavailable or lack standard documentation. Designing\nsuch multi-models through an integral approach is, however, a complex task\nrequiring the collaboration of modelers and experts from various domains. In\nthis collaborative effort, modelers must precisely define the domain knowledge\nneeded from experts and establish a systematic procedure for translating such\nknowledge into a multi-model. Yet, these requirements and systematic procedures\nare currently lacking for multi-models that are both multiscale and\nmulti-paradigm. We address this challenge by introducing a procedure for\ndeveloping multi-models with an integral approach based on clearly defined\ndomain knowledge requirements derived from literature. We illustrate this\nprocedure using the case of school closure policies in the Netherlands during\nthe COVID-19 pandemic, revealing their potential implications in the short and\nlong term and across the healthcare and educational domains. The requirements\nand procedure provided in this article advance the application of integral\nmulti-modeling for policy support in multiscale and multidomain contexts.",
        "updated": "2024-02-09 07:35:40 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.06228v1"
    },
    {
        "title": "Cooperative Nonlinear Guidance Strategies for Guaranteed Pursuit-Evasion",
        "authors": "Saurabh KumarShashi Ranjan KumarAbhinav Sinha",
        "links": "http://arxiv.org/abs/2402.06176v1",
        "entry_id": "http://arxiv.org/abs/2402.06176v1",
        "pdf_url": "http://arxiv.org/pdf/2402.06176v1",
        "summary": "This paper addresses the pursuit-evasion problem involving three agents -- a\npurser, an evader, and a defender. We develop cooperative guidance laws for the\nevader-defender team that guarantee that the defender intercepts the pursuer\nbefore it reaches the vicinity of the evader. Unlike heuristic methods, optimal\ncontrol, differential game formulation, and recently proposed time-constrained\nguidance techniques, we propose a geometric solution to safeguard the evader\nfrom the pursuer's incoming threat. The proposed strategy is computationally\nefficient and expected to be scalable as the number of agents increases.\nAnother alluring feature of the proposed strategy is that the evader-defender\nteam does not require the knowledge of the pursuer's strategy and that the\npursuer's interception is guaranteed from arbitrary initial engagement\ngeometries. We further show that the necessary error variables for the\nevader-defender team vanish within a time that can be exactly prescribed prior\nto the three-body engagement. Finally, we demonstrate the efficacy of the\nproposed cooperative defense strategy via simulation in diverse engagement\nscenarios.",
        "updated": "2024-02-09 04:24:23 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.06176v1"
    },
    {
        "title": "CityFlowER: An Efficient and Realistic Traffic Simulator with Embedded Machine Learning Models",
        "authors": "Longchao DaChen ChuWeinan ZhangHua Wei",
        "links": "http://arxiv.org/abs/2402.06127v1",
        "entry_id": "http://arxiv.org/abs/2402.06127v1",
        "pdf_url": "http://arxiv.org/pdf/2402.06127v1",
        "summary": "Traffic simulation is an essential tool for transportation infrastructure\nplanning, intelligent traffic control policy learning, and traffic flow\nanalysis. Its effectiveness relies heavily on the realism of the simulators\nused. Traditional traffic simulators, such as SUMO and CityFlow, are often\nlimited by their reliance on rule-based models with hyperparameters that\noversimplify driving behaviors, resulting in unrealistic simulations. To\nenhance realism, some simulators have provided Application Programming\nInterfaces (APIs) to interact with Machine Learning (ML) models, which learn\nfrom observed data and offer more sophisticated driving behavior models.\nHowever, this approach faces challenges in scalability and time efficiency as\nvehicle numbers increase. Addressing these limitations, we introduce\nCityFlowER, an advancement over the existing CityFlow simulator, designed for\nefficient and realistic city-wide traffic simulation. CityFlowER innovatively\npre-embeds ML models within the simulator, eliminating the need for external\nAPI interactions and enabling faster data computation. This approach allows for\na blend of rule-based and ML behavior models for individual vehicles, offering\nunparalleled flexibility and efficiency, particularly in large-scale\nsimulations. We provide detailed comparisons with existing simulators,\nimplementation insights, and comprehensive experiments to demonstrate\nCityFlowER's superiority in terms of realism, efficiency, and adaptability.",
        "updated": "2024-02-09 01:19:41 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.06127v1"
    }
]