[
    {
        "title": "Learning and Calibrating Heterogeneous Bounded Rational Market Behaviour with Multi-Agent Reinforcement Learning",
        "authors": "Benjamin Patrick EvansSumitra Ganesh",
        "links": "http://arxiv.org/abs/2402.00787v1",
        "entry_id": "http://arxiv.org/abs/2402.00787v1",
        "pdf_url": "http://arxiv.org/pdf/2402.00787v1",
        "summary": "Agent-based models (ABMs) have shown promise for modelling various real world\nphenomena incompatible with traditional equilibrium analysis. However, a\ncritical concern is the manual definition of behavioural rules in ABMs. Recent\ndevelopments in multi-agent reinforcement learning (MARL) offer a way to\naddress this issue from an optimisation perspective, where agents strive to\nmaximise their utility, eliminating the need for manual rule specification.\nThis learning-focused approach aligns with established economic and financial\nmodels through the use of rational utility-maximising agents. However, this\nrepresentation departs from the fundamental motivation for ABMs: that realistic\ndynamics emerging from bounded rationality and agent heterogeneity can be\nmodelled. To resolve this apparent disparity between the two approaches, we\npropose a novel technique for representing heterogeneous processing-constrained\nagents within a MARL framework. The proposed approach treats agents as\nconstrained optimisers with varying degrees of strategic skills, permitting\ndeparture from strict utility maximisation. Behaviour is learnt through\nrepeated simulations with policy gradients to adjust action likelihoods. To\nallow efficient computation, we use parameterised shared policy learning with\ndistributions of agent skill levels. Shared policy learning avoids the need for\nagents to learn individual policies yet still enables a spectrum of bounded\nrational behaviours. We validate our model's effectiveness using real-world\ndata on a range of canonical $n$-agent settings, demonstrating significantly\nimproved predictive capability.",
        "updated": "2024-02-01 17:21:45 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.00787v1"
    },
    {
        "title": "A Promise Theory Perspective on the Role of Intent in Group Dynamics",
        "authors": "M. BurgessR. I. M. Dunbar",
        "links": "http://arxiv.org/abs/2402.00598v1",
        "entry_id": "http://arxiv.org/abs/2402.00598v1",
        "pdf_url": "http://arxiv.org/pdf/2402.00598v1",
        "summary": "We present a simple argument using Promise Theory and dimensional analysis\nfor the Dunbar scaling hierarchy, supported by recent data from group formation\nin Wikipedia editing. We show how the assumption of a common priority seeds\ngroup alignment until the costs associated with attending to the group outweigh\nthe benefits in a detailed balance scenario. Subject to partial efficiency of\nimplementing promised intentions, we can reproduce a series of compatible rates\nthat balance growth with entropy.",
        "updated": "2024-02-01 13:51:35 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.00598v1"
    },
    {
        "title": "Group Related Phenomena in Wikipedia Edits",
        "authors": "M. BurgessR. I. M. Dunbar",
        "links": "http://arxiv.org/abs/2402.00595v1",
        "entry_id": "http://arxiv.org/abs/2402.00595v1",
        "pdf_url": "http://arxiv.org/pdf/2402.00595v1",
        "summary": "Human communities have self-organizing properties that give rise to very\nspecific natural grouping patterns, reflected in the Dunbar Number and its\nlayered structure (a Dunbar Graph). Since work-groups are necessarily also\nsocial groups, we might expect the same principles to apply here as well. One\nfactor likely to be important in limiting the size of groups is that conflicts\ntypically escalate with the number of people involved. Here we analyse\nWikipedia editing histories across a wide range of topics to show that there is\nan emergent coherence in the size of groups formed transiently to edit the\ncontent of subject texts, with two peaks averaging at around $N=8$ for the size\ncorresponding to maximal contention, and at around $N=4$ as a regular team.\nThese values are consistent with the observed sizes of conversational groups,\nas well as the hierarchical structuring of Dunbar graphs. We use the Promise\nTheory of trust to suggest a scaling law that may apply to all group\ndistributions based on seeded attraction. In addition to providing further\nevidence that even natural communities of strangers are self-organising, the\nresults have important implications for the governance of the Wikipedia commons\nand for the security of all online social platforms and associations.",
        "updated": "2024-02-01 13:45:12 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.00595v1"
    },
    {
        "title": "BrainSLAM: SLAM on Neural Population Activity Data",
        "authors": "Kipp FreudNathan LeporaMatt W. JonesCian O'Donnell",
        "links": "http://arxiv.org/abs/2402.00588v1",
        "entry_id": "http://arxiv.org/abs/2402.00588v1",
        "pdf_url": "http://arxiv.org/pdf/2402.00588v1",
        "summary": "Simultaneous localisation and mapping (SLAM) algorithms are commonly used in\nrobotic systems for learning maps of novel environments. Brains also appear to\nlearn maps, but the mechanisms are not known and it is unclear how to infer\nthese maps from neural activity data. We present BrainSLAM; a method for\nperforming SLAM using only population activity (local field potential, LFP)\ndata simultaneously recorded from three brain regions in rats: hippocampus,\nprefrontal cortex, and parietal cortex. This system uses a convolutional neural\nnetwork (CNN) to decode velocity and familiarity information from wavelet\nscalograms of neural local field potential data recorded from rats as they\nnavigate a 2D maze. The CNN's output drives a RatSLAM-inspired architecture,\npowering an attractor network which performs path integration plus a separate\nsystem which performs `loop closure' (detecting previously visited locations\nand correcting map aliasing errors). Together, these three components can\nconstruct faithful representations of the environment while simultaneously\ntracking the animal's location. This is the first demonstration of inference of\na spatial map from brain recordings. Our findings expand SLAM to a new\nmodality, enabling a new method of mapping environments and facilitating a\nbetter understanding of the role of cognitive maps in navigation and decision\nmaking.",
        "updated": "2024-02-01 13:34:59 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.00588v1"
    },
    {
        "title": "Multi-agent Path Finding for Cooperative Autonomous Driving",
        "authors": "Zhongxia YanHan ZhengCathy Wu",
        "links": "http://arxiv.org/abs/2402.00334v1",
        "entry_id": "http://arxiv.org/abs/2402.00334v1",
        "pdf_url": "http://arxiv.org/pdf/2402.00334v1",
        "summary": "Anticipating possible future deployment of connected and automated vehicles\n(CAVs), cooperative autonomous driving at intersections has been studied by\nmany works in control theory and intelligent transportation across decades.\nSimultaneously, recent parallel works in robotics have devised efficient\nalgorithms for multi-agent path finding (MAPF), though often in environments\nwith simplified kinematics. In this work, we hybridize insights and algorithms\nfrom MAPF with the structure and heuristics of optimizing the crossing order of\nCAVs at signal-free intersections. We devise an optimal and complete algorithm,\nOrder-based Search with Kinematics Arrival Time Scheduling (OBS-KATS), which\nsignificantly outperforms existing algorithms, fixed heuristics, and\nprioritized planning with KATS. The performance is maintained under different\nvehicle arrival rates, lane lengths, crossing speeds, and control horizon.\nThrough ablations and dissections, we offer insight on the contributing factors\nto OBS-KATS's performance. Our work is directly applicable to many similarly\nscaled traffic and multi-robot scenarios with directed lanes.",
        "updated": "2024-02-01 04:39:15 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.00334v1"
    }
]