[
    {
        "title": "Mutation-Bias Learning in Games",
        "authors": "Johann BauerSheldon WestEduardo AlonsoMark Broom",
        "links": "http://arxiv.org/abs/2405.18190v1",
        "entry_id": "http://arxiv.org/abs/2405.18190v1",
        "pdf_url": "http://arxiv.org/pdf/2405.18190v1",
        "summary": "We present two variants of a multi-agent reinforcement learning algorithm\nbased on evolutionary game theoretic considerations. The intentional simplicity\nof one variant enables us to prove results on its relationship to a system of\nordinary differential equations of replicator-mutator dynamics type, allowing\nus to present proofs on the algorithm's convergence conditions in various\nsettings via its ODE counterpart. The more complicated variant enables\ncomparisons to Q-learning based algorithms. We compare both variants\nexperimentally to WoLF-PHC and frequency-adjusted Q-learning on a range of\nsettings, illustrating cases of increasing dimensionality where our variants\npreserve convergence in contrast to more complicated algorithms. The\navailability of analytic results provides a degree of transferability of\nresults as compared to purely empirical case studies, illustrating the general\nutility of a dynamical systems perspective on multi-agent reinforcement\nlearning when addressing questions of convergence and reliable generalisation.",
        "updated": "2024-05-28 14:02:44 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.18190v1"
    },
    {
        "title": "Individual Contributions as Intrinsic Exploration Scaffolds for Multi-agent Reinforcement Learning",
        "authors": "Xinran LiZifan LiuShibo ChenJun Zhang",
        "links": "http://arxiv.org/abs/2405.18110v1",
        "entry_id": "http://arxiv.org/abs/2405.18110v1",
        "pdf_url": "http://arxiv.org/pdf/2405.18110v1",
        "summary": "In multi-agent reinforcement learning (MARL), effective exploration is\ncritical, especially in sparse reward environments. Although introducing global\nintrinsic rewards can foster exploration in such settings, it often complicates\ncredit assignment among agents. To address this difficulty, we propose\nIndividual Contributions as intrinsic Exploration Scaffolds (ICES), a novel\napproach to motivate exploration by assessing each agent's contribution from a\nglobal view. In particular, ICES constructs exploration scaffolds with Bayesian\nsurprise, leveraging global transition information during centralized training.\nThese scaffolds, used only in training, help to guide individual agents towards\nactions that significantly impact the global latent state transitions.\nAdditionally, ICES separates exploration policies from exploitation policies,\nenabling the former to utilize privileged global information during training.\nExtensive experiments on cooperative benchmark tasks with sparse rewards,\nincluding Google Research Football (GRF) and StarCraft Multi-agent Challenge\n(SMAC), demonstrate that ICES exhibits superior exploration capabilities\ncompared with baselines. The code is publicly available at\nhttps://github.com/LXXXXR/ICES.",
        "updated": "2024-05-28 12:18:19 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.18110v1"
    },
    {
        "title": "LLM experiments with simulation: Large Language Model Multi-Agent System for Process Simulation Parametrization in Digital Twins",
        "authors": "Yuchen XiaDaniel DittlerNasser JazdiHaonan ChenMichael Weyrich",
        "links": "http://arxiv.org/abs/2405.18092v1",
        "entry_id": "http://arxiv.org/abs/2405.18092v1",
        "pdf_url": "http://arxiv.org/pdf/2405.18092v1",
        "summary": "This paper presents a novel design of a multi-agent system framework that\napplies a large language model (LLM) to automate the parametrization of process\nsimulations in digital twins. We propose a multi-agent framework that includes\nfour types of agents: observation, reasoning, decision and summarization. By\nenabling dynamic interaction between LLM agents and simulation model, the\ndeveloped system can automatically explore the parametrization of the\nsimulation and use heuristic reasoning to determine a set of parameters to\ncontrol the simulation to achieve an objective. The proposed approach enhances\nthe simulation model by infusing it with heuristics from LLM and enables\nautonomous search for feasible parametrization to solve a user task.\nFurthermore, the system has the potential to increase user-friendliness and\nreduce the cognitive load on human users by assisting in complex\ndecision-making processes. The effectiveness and functionality of the system\nare demonstrated through a case study, and the visualized demos are available\nat a GitHub Repository: https://github.com/YuchenXia/LLMDrivenSimulation",
        "updated": "2024-05-28 11:59:40 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.18092v1"
    },
    {
        "title": "Network Diffusion -- Framework to Simulate Spreading Processes in Complex Networks",
        "authors": "Michał CzubaMateusz NurekDamian SerwataYu-Xuan QiuMingshan JiaKatarzyna MusialRadosław MichalskiPiotr Bródka",
        "links": "http://dx.doi.org/10.26599/BDMA.2024.9020010",
        "entry_id": "http://arxiv.org/abs/2405.18085v1",
        "pdf_url": "http://arxiv.org/pdf/2405.18085v1",
        "summary": "With the advancement of computational network science, its research scope has\nsignificantly expanded beyond static graphs to encompass more complex\nstructures. The introduction of streaming, temporal, multilayer, and\nhypernetwork approaches has brought new possibilities and imposed additional\nrequirements. For instance, by utilising these advancements, one can model\nstructures such as social networks in a much more refined manner, which is\nparticularly relevant in simulations of the spreading processes. Unfortunately,\nthe pace of advancement is often too rapid for existing computational packages\nto keep up with the functionality updates. This results in a significant\nproliferation of tools used by researchers and, consequently, a lack of a\nuniversally accepted technological stack that would standardise experimental\nmethods (as seen, e.g. in machine learning). This article addresses that issue\nby presenting an extended version of the Network Diffusion library. First, a\nsurvey of the existing approaches and toolkits for simulating spreading\nphenomena is shown and then, an overview of the framework functionalities.\nFinally, we report four case studies conducted with the package to demonstrate\nits usefulness: the impact of sanitary measures on the spread of COVID-19, the\ncomparison of information diffusion on two temporal network models, and the\neffectiveness of seed selection methods in the task of influence maximisation\nin multilayer networks. We conclude the paper with a critical assessment of the\nlibrary and the outline of still awaiting challenges to standardise research\nenvironments in computational network science.",
        "updated": "2024-05-28 11:46:18 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.18085v1"
    },
    {
        "title": "Cognitive Insights and Stable Coalition Matching for Fostering Multi-Agent Cooperation",
        "authors": "Jiaqi ShaoTianjun YuanTao LinXuanyu CaoBing Luo",
        "links": "http://arxiv.org/abs/2405.18044v1",
        "entry_id": "http://arxiv.org/abs/2405.18044v1",
        "pdf_url": "http://arxiv.org/pdf/2405.18044v1",
        "summary": "Cognitive abilities, such as Theory of Mind (ToM), play a vital role in\nfacilitating cooperation in human social interactions. However, our study\nreveals that agents with higher ToM abilities may not necessarily exhibit\nbetter cooperative behavior compared to those with lower ToM abilities. To\naddress this challenge, we propose a novel matching coalition mechanism that\nleverages the strengths of agents with different ToM levels by explicitly\nconsidering belief alignment and specialized abilities when forming coalitions.\nOur proposed matching algorithm seeks to find stable coalitions that maximize\nthe potential for cooperative behavior and ensure long-term viability. By\nincorporating cognitive insights into the design of multi-agent systems, our\nwork demonstrates the potential of leveraging ToM to create more sophisticated\nand human-like coordination strategies that foster cooperation and improve\noverall system performance.",
        "updated": "2024-05-28 10:59:33 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.18044v1"
    }
]