[
    {
        "title": "Choreographing the Rhythms of Observation: Dynamics for Ranged Observer Bipartite-Unipartite SpatioTemporal (ROBUST) Networks",
        "authors": "Ted Edward Holmberg",
        "links": "http://arxiv.org/abs/2406.07473v1",
        "entry_id": "http://arxiv.org/abs/2406.07473v1",
        "pdf_url": "http://arxiv.org/pdf/2406.07473v1",
        "summary": "Existing network analysis methods struggle to optimize observer placements in\ndynamic environments with limited visibility. This dissertation introduces the\nnovel ROBUST (Ranged Observer Bipartite-Unipartite SpatioTemporal) framework,\noffering a significant advancement in modeling, analyzing, and optimizing\nobserver networks within complex spatiotemporal domains. ROBUST leverages a\nunique bipartite-unipartite approach, distinguishing between observer and\nobservable entities while incorporating spatial constraints and temporal\ndynamics.\n  This research extends spatiotemporal network theory by introducing novel\ngraph-based measures, including myopic degree, spatial closeness centrality,\nand edge length proportion. These measures, coupled with advanced clustering\ntechniques like Proximal Recurrence, provide insights into network structure,\nresilience, and the effectiveness of observer placements. The ROBUST framework\ndemonstrates superior resource allocation and strategic responsiveness compared\nto conventional models. Case studies in oceanographic monitoring, urban safety\nnetworks, and multi-agent path planning showcases its practical applicability\nand adaptability. Results demonstrate significant improvements in coverage,\nresponse times, and overall network efficiency.\n  This work paves the way for future research in incorporating imperfect\nknowledge, refining temporal pathing methodologies, and expanding the scope of\napplications. By bridging theoretical advancements with practical solutions,\nROBUST stands as a significant contribution to the field, promising to inform\nand inspire ongoing and future endeavors in network optimization and\nmulti-agent system planning.",
        "updated": "2024-06-11 17:20:01 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.07473v1"
    },
    {
        "title": "Active Scout: Multi-Target Tracking Using Neural Radiance Fields in Dense Urban Environments",
        "authors": "Christopher D. HsuPratik Chaudhari",
        "links": "http://arxiv.org/abs/2406.07431v1",
        "entry_id": "http://arxiv.org/abs/2406.07431v1",
        "pdf_url": "http://arxiv.org/pdf/2406.07431v1",
        "summary": "We study pursuit-evasion games in highly occluded urban environments, e.g.\ntall buildings in a city, where a scout (quadrotor) tracks multiple dynamic\ntargets on the ground. We show that we can build a neural radiance field (NeRF)\nrepresentation of the city -- online -- using RGB and depth images from\ndifferent vantage points. This representation is used to calculate the\ninformation gain to both explore unknown parts of the city and track the\ntargets -- thereby giving a completely first-principles approach to actively\ntracking dynamic targets. We demonstrate, using a custom-built simulator using\nOpen Street Maps data of Philadelphia and New York City, that we can explore\nand locate 20 stationary targets within 300 steps. This is slower than a greedy\nbaseline which which does not use active perception. But for dynamic targets\nthat actively hide behind occlusions, we show that our approach maintains, at\nworst, a tracking error of 200m; the greedy baseline can have a tracking error\nas large as 600m. We observe a number of interesting properties in the scout's\npolicies, e.g., it switches its attention to track a different target\nperiodically, as the quality of the NeRF representation improves over time, the\nscout also becomes better in terms of target tracking.",
        "updated": "2024-06-11 16:34:16 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.07431v1"
    },
    {
        "title": "Speaking Your Language: Spatial Relationships in Interpretable Emergent Communication",
        "authors": "Olaf LipinskiAdam J. SobeyFederico CeruttiTimothy J. Norman",
        "links": "http://arxiv.org/abs/2406.07277v1",
        "entry_id": "http://arxiv.org/abs/2406.07277v1",
        "pdf_url": "http://arxiv.org/pdf/2406.07277v1",
        "summary": "Effective communication requires the ability to refer to specific parts of an\nobservation in relation to others. While emergent communication literature\nshows success in developing various language properties, no research has shown\nthe emergence of such positional references. This paper demonstrates how agents\ncan communicate about spatial relationships within their observations. The\nresults indicate that agents can develop a language capable of expressing the\nrelationships between parts of their observation, achieving over 90% accuracy\nwhen trained in a referential game which requires such communication. Using a\ncollocation measure, we demonstrate how the agents create such references. This\nanalysis suggests that agents use a mixture of non-compositional and\ncompositional messages to convey spatial relationships. We also show that the\nemergent language is interpretable by humans. The translation accuracy is\ntested by communicating with the receiver agent, where the receiver achieves\nover 78% accuracy using parts of this lexicon, confirming that the\ninterpretation of the emergent language was successful.",
        "updated": "2024-06-11 14:04:25 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.07277v1"
    },
    {
        "title": "Scaling Large-Language-Model-based Multi-Agent Collaboration",
        "authors": "Chen QianZihao XieYifei WangWei LiuYufan DangZhuoyun DuWeize ChenCheng YangZhiyuan LiuMaosong Sun",
        "links": "http://arxiv.org/abs/2406.07155v1",
        "entry_id": "http://arxiv.org/abs/2406.07155v1",
        "pdf_url": "http://arxiv.org/pdf/2406.07155v1",
        "summary": "Pioneering advancements in large language model-powered agents have\nunderscored the design pattern of multi-agent collaboration, demonstrating that\ncollective intelligence can surpass the capabilities of each individual.\nInspired by the neural scaling law, which posits that increasing neurons leads\nto emergent abilities, this study investigates whether a similar principle\napplies to increasing agents in multi-agent collaboration. Technically, we\npropose multi-agent collaboration networks (MacNet), which utilize directed\nacyclic graphs to organize agents and streamline their interactive reasoning\nvia topological ordering, with solutions derived from their dialogues.\nExtensive experiments show that MacNet consistently outperforms baseline\nmodels, enabling effective agent collaboration across various network\ntopologies and supporting cooperation among more than a thousand agents.\nNotably, we observed a small-world collaboration phenomenon, where topologies\nresembling small-world properties achieved superior performance. Additionally,\nwe identified a collaborative scaling law, indicating that normalized solution\nquality follows a logistic growth pattern as scaling agents, with collaborative\nemergence occurring much earlier than previously observed instances of neural\nemergence. The code and data will be available at\nhttps://github.com/OpenBMB/ChatDev.",
        "updated": "2024-06-11 11:02:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.07155v1"
    },
    {
        "title": "Arbitrary-Order Distributed Finite-Time Differentiator for Multi-Agent Systems",
        "authors": "Weile ChenHaibo DuShihua LiXinghuo Yu",
        "links": "http://arxiv.org/abs/2406.07031v1",
        "entry_id": "http://arxiv.org/abs/2406.07031v1",
        "pdf_url": "http://arxiv.org/pdf/2406.07031v1",
        "summary": "This paper proposes arbitrary-order distributed finite-time differentiator\n(AODFD) for leader-follower multi-agent systems (MAS) under directed graph by\nonly using relative or absolute output information. By using arbitrary-order\ndistributed finite-time differentiator via relative output information\n(AODFD-R), each follower agent can obtain the relative output information\nbetween itself and leader and the relative output's arbitrary-order\nderivatives, where the information to be measured is only the local relative\noutput information between each follower agent and its neighboring agents. As a\nsimple extension of AODFD-R, the arbitrary-order distributed finite-time\ndifferentiator via absolute output information (AODFD-A) is also given. The\nfinite-time stability of the closed-loop system under AODFD is proved by\nconstructing a Lyapunov function skillfully. Finally, several simulation\nexamples are given to verify the effectiveness of the AODFD.",
        "updated": "2024-06-11 07:40:46 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.07031v1"
    }
]