[
    {
        "title": "Hyper Strategy Logic",
        "authors": "Raven BeutnerBernd Finkbeiner",
        "links": "http://arxiv.org/abs/2403.13741v1",
        "entry_id": "http://arxiv.org/abs/2403.13741v1",
        "pdf_url": "http://arxiv.org/pdf/2403.13741v1",
        "summary": "Strategy logic (SL) is a powerful temporal logic that enables strategic\nreasoning in multi-agent systems. SL supports explicit (first-order)\nquantification over strategies and provides a logical framework to express many\nimportant properties such as Nash equilibria, dominant strategies, etc. While\nin SL the same strategy can be used in multiple strategy profiles, each such\nprofile is evaluated w.r.t. a path-property, i.e., a property that considers\nthe single path resulting from a particular strategic interaction. In this\npaper, we present Hyper Strategy Logic (HyperSL), a strategy logic where the\noutcome of multiple strategy profiles can be compared w.r.t. a hyperproperty,\ni.e., a property that relates multiple paths. We show that HyperSL can capture\nimportant properties that cannot be expressed in SL, including\nnon-interference, quantitative Nash equilibria, optimal adversarial planning,\nand reasoning under imperfect information. On the algorithmic side, we identify\nan expressive fragment of HyperSL with decidable model checking and present a\nmodel-checking algorithm. We contribute a prototype implementation of our\nalgorithm and report on encouraging experimental results.",
        "updated": "2024-03-20 16:47:53 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.13741v1"
    },
    {
        "title": "Agent-based MST Construction",
        "authors": "Ajay D. KshemkalyaniManish KumarAnisur Rahaman MollaGokarna Sharma",
        "links": "http://arxiv.org/abs/2403.13716v1",
        "entry_id": "http://arxiv.org/abs/2403.13716v1",
        "pdf_url": "http://arxiv.org/pdf/2403.13716v1",
        "summary": "{\\em Minimum-weight spanning tree} (MST) is one of the fundamental and\nwell-studied problems in distributed computing. In this paper, we initiate the\nstudy of constructing MST using mobile agents (aka robots). Suppose $n$ agents\nare positioned initially arbitrarily on the nodes of a connected, undirected,\narbitrary, anonymous, port-labeled, weighted $n$-node, $m$-edge graph $G$ of\ndiameter $D$ and maximum degree $\\Delta$. The agents relocate themselves\nautonomously and compute an MST of $G$ such that exactly one agent positions on\na node and tracks in its memory which of its adjacent edges belong to the MST.\nThe objective is to minimize time and memory requirements. Following the\nliterature, we consider the synchronous setting in which each agent performs\nits operations synchronously with others and hence time can be measured in\nrounds. We first establish a generic result: if $n$ and $\\Delta$ are known a\npriori and memory per agent is as much as node memory in the message-passing\nmodel (of distributed computing), agents can simulate any $O(T)$-round\ndeterministic algorithm for any problem in the message-passing model to the\nagent model in $O(\\Delta T \\log n+n\\log^2n)$ rounds. As a corollary, MST can be\nconstructed in the agent model in $O(\\max\\{\\Delta \\sqrt{n} \\log n \\log^*n,\n\\Delta D \\log n,n\\log^2n\\})$ rounds simulating the celebrated $O(\\sqrt{n}\n\\log^*n +D)$-round GKP algorithm for MST in the message-passing model. We then\nestablish that, without knowing any graph parameter a priori, there exists a\ndeterministic algorithm to construct MST in the agent model in $O(m+n\\log n)$\nrounds with $O(n \\log n)$ bits memory at each agent. The presented algorithm\nneeds to overcome highly non-trivial challenges on how to synchronize agents in\ncomputing MST as they may initially be positioned arbitrarily on the graph\nnodes.",
        "updated": "2024-03-20 16:22:53 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.13716v1"
    },
    {
        "title": "Multi-agent Reinforcement Traffic Signal Control based on Interpretable Influence Mechanism and Biased ReLU Approximation",
        "authors": "Zhiyue LuoJun XuFanglin Chen",
        "links": "http://arxiv.org/abs/2403.13639v1",
        "entry_id": "http://arxiv.org/abs/2403.13639v1",
        "pdf_url": "http://arxiv.org/pdf/2403.13639v1",
        "summary": "Traffic signal control is important in intelligent transportation system, of\nwhich cooperative control is difficult to realize but yet vital. Many methods\nmodel multi-intersection traffic networks as grids and address the problem\nusing multi-agent reinforcement learning (RL). Despite these existing studies,\nthere is an opportunity to further enhance our understanding of the\nconnectivity and globality of the traffic networks by capturing the\nspatiotemporal traffic information with efficient neural networks in deep RL.\nIn this paper, we propose a novel multi-agent actor-critic framework based on\nan interpretable influence mechanism with a centralized learning and\ndecentralized execution method. Specifically, we first construct an\nactor-critic framework, for which the piecewise linear neural network (PWLNN),\nnamed biased ReLU (BReLU), is used as the function approximator to obtain a\nmore accurate and theoretically grounded approximation. Finally, our proposed\nframework is validated on two synthetic traffic networks to coordinate signal\ncontrol between intersections, achieving lower traffic delays across the entire\ntraffic network compared to state-of-the-art (SOTA) performance.",
        "updated": "2024-03-20 14:43:23 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.13639v1"
    },
    {
        "title": "Caching-Augmented Lifelong Multi-Agent Path Finding",
        "authors": "Yimin TangZhenghong YuYi ZhengT. K. Satish KumarJiaoyang LiSven Koenig",
        "links": "http://arxiv.org/abs/2403.13421v1",
        "entry_id": "http://arxiv.org/abs/2403.13421v1",
        "pdf_url": "http://arxiv.org/pdf/2403.13421v1",
        "summary": "Multi-Agent Path Finding (MAPF), which involves finding collision-free paths\nfor multiple robots, is crucial in various applications. Lifelong MAPF, where\ntargets are reassigned to agents as soon as they complete their initial\nobjectives, offers a more accurate approximation of real-world warehouse\nplanning. In this paper, we present a novel mechanism named Caching-Augmented\nLifelong MAPF (CAL-MAPF), designed to improve the performance of Lifelong MAPF.\nWe have developed a new map grid type called cache for temporary item storage\nand replacement and designed a lock mechanism for it to improve the stability\nof the planning solution. This cache mechanism was evaluated using various\ncache replacement policies and a spectrum of input task distributions. We\nidentified three main factors significantly impacting CAL-MAPF performance\nthrough experimentation: suitable input task distribution, high cache hit rate,\nand smooth traffic. Overall, CAL-MAPF has demonstrated potential for\nperformance improvements in certain task distributions, maps and agent\nconfigurations.",
        "updated": "2024-03-20 09:07:23 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.13421v1"
    },
    {
        "title": "Causal Graph Dynamics and Kan Extensions",
        "authors": "Luidnel MaignanAntoine Spicher",
        "links": "http://arxiv.org/abs/2403.13393v1",
        "entry_id": "http://arxiv.org/abs/2403.13393v1",
        "pdf_url": "http://arxiv.org/pdf/2403.13393v1",
        "summary": "On the one side, the formalism of Global Transformations comes with the claim\nof capturing any transformation of space that is local, synchronous and\ndeterministic.The claim has been proven for different classes of models such as\nmesh refinements from computer graphics, Lindenmayer systems from morphogenesis\nmodeling and cellular automata from biological, physical and parallel\ncomputation modeling.The Global Transformation formalism achieves this by using\ncategory theory for its genericity, and more precisely the notion of Kan\nextension to determine the global behaviors based on the local ones.On the\nother side, Causal Graph Dynamics describe the transformation of port graphs in\na synchronous and deterministic way and has not yet being tackled.In this\npaper, we show the precise sense in which the claim of Global Transformations\nholds for them as well.This is done by showing different ways in which they can\nbe expressed as Kan extensions, each of them highlighting different features of\nCausal Graph Dynamics.Along the way, this work uncovers the interesting class\nof Monotonic Causal Graph Dynamics and their universality among General Causal\nGraph Dynamics.",
        "updated": "2024-03-20 08:35:14 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.13393v1"
    }
]