[
    {
        "title": "Quantifying Misalignment Between Agents",
        "authors": "Aidan KieransAvijit GhoshHananel HazanShiri Dori-Hacohen",
        "links": "http://arxiv.org/abs/2406.04231v1",
        "entry_id": "http://arxiv.org/abs/2406.04231v1",
        "pdf_url": "http://arxiv.org/pdf/2406.04231v1",
        "summary": "Growing concerns about the AI alignment problem have emerged in recent years,\nwith previous work focusing mainly on (1) qualitative descriptions of the\nalignment problem; (2) attempting to align AI actions with human interests by\nfocusing on value specification and learning; and/or (3) focusing on a single\nagent or on humanity as a singular unit. Recent work in sociotechnical AI\nalignment has made some progress in defining alignment inclusively, but the\nfield as a whole still lacks a systematic understanding of how to specify,\ndescribe, and analyze misalignment among entities, which may include individual\nhumans, AI agents, and complex compositional entities such as corporations,\nnation-states, and so forth. Previous work on controversy in computational\nsocial science offers a mathematical model of contention among populations (of\nhumans). In this paper, we adapt this contention model to the alignment\nproblem, and show how misalignment can vary depending on the population of\nagents (human or otherwise) being observed, the domain in question, and the\nagents' probability-weighted preferences between possible outcomes. Our model\ndeparts from value specification approaches and focuses instead on the morass\nof complex, interlocking, sometimes contradictory goals that agents may have in\npractice. We apply our model by analyzing several case studies ranging from\nsocial media moderation to autonomous vehicle behavior. By applying our model\nwith appropriately representative value data, AI engineers can ensure that\ntheir systems learn values maximally aligned with diverse human interests.",
        "updated": "2024-06-06 16:31:22 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.04231v1"
    },
    {
        "title": "Towards Principled Superhuman AI for Multiplayer Symmetric Games",
        "authors": "Jiawei GeYuanhao WangWenzhe LiChi Jin",
        "links": "http://arxiv.org/abs/2406.04201v1",
        "entry_id": "http://arxiv.org/abs/2406.04201v1",
        "pdf_url": "http://arxiv.org/pdf/2406.04201v1",
        "summary": "Multiplayer games, when the number of players exceeds two, present unique\nchallenges that fundamentally distinguish them from the extensively studied\ntwo-player zero-sum games. These challenges arise from the non-uniqueness of\nequilibria and the risk of agents performing highly suboptimally when adopting\nequilibrium strategies. While a line of recent works developed learning systems\nsuccessfully achieving human-level or even superhuman performance in popular\nmultiplayer games such as Mahjong, Poker, and Diplomacy, two critical questions\nremain unaddressed: (1) What is the correct solution concept that AI agents\nshould find? and (2) What is the general algorithmic framework that provably\nsolves all games within this class? This paper takes the first step towards\nsolving these unique challenges of multiplayer games by provably addressing\nboth questions in multiplayer symmetric normal-form games. We also demonstrate\nthat many meta-algorithms developed in prior practical systems for multiplayer\ngames can fail to achieve even the basic goal of obtaining agent's equal share\nof the total reward.",
        "updated": "2024-06-06 15:59:17 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.04201v1"
    },
    {
        "title": "MARLander: A Local Path Planning for Drone Swarms using Multiagent Deep Reinforcement Learning",
        "authors": "Demetros AschuRobinroy PeterSausar KarafAleksey FedoseevDzmitry Tsetserukou",
        "links": "http://arxiv.org/abs/2406.04159v1",
        "entry_id": "http://arxiv.org/abs/2406.04159v1",
        "pdf_url": "http://arxiv.org/pdf/2406.04159v1",
        "summary": "Achieving safe and precise landings for a swarm of drones poses a significant\nchallenge, primarily attributed to conventional control and planning methods.\nThis paper presents the implementation of multi-agent deep reinforcement\nlearning (MADRL) techniques for the precise landing of a drone swarm at\nrelocated target locations. The system is trained in a realistic simulated\nenvironment with a maximum velocity of 3 m/s in training spaces of 4 x 4 x 4 m\nand deployed utilizing Crazyflie drones with a Vicon indoor localization\nsystem. The experimental results revealed that the proposed approach achieved a\nlanding accuracy of 2.26 cm on stationary and 3.93 cm on moving platforms\nsurpassing a baseline method used with a Proportional-integral-derivative (PID)\ncontroller with an Artificial Potential Field (APF). This research highlights\ndrone landing technologies that eliminate the need for analytical centralized\nsystems, potentially offering scalability and revolutionizing applications in\nlogistics, safety, and rescue missions.",
        "updated": "2024-06-06 15:19:15 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.04159v1"
    },
    {
        "title": "Mini Honor of Kings: A Lightweight Environment for Multi-Agent Reinforcement Learning",
        "authors": "Lin LiuJian ZhaoCheng HuZhengtao CaoYoupeng ZhaoZhenbin YeMeng MengWenjun WangZhaofeng HeHouqiang LiXia LinLanxiao Huang",
        "links": "http://arxiv.org/abs/2406.03978v1",
        "entry_id": "http://arxiv.org/abs/2406.03978v1",
        "pdf_url": "http://arxiv.org/pdf/2406.03978v1",
        "summary": "Games are widely used as research environments for multi-agent reinforcement\nlearning (MARL), but they pose three significant challenges: limited\ncustomization, high computational demands, and oversimplification. To address\nthese issues, we introduce the first publicly available map editor for the\npopular mobile game Honor of Kings and design a lightweight environment, Mini\nHonor of Kings (Mini HoK), for researchers to conduct experiments. Mini HoK is\nhighly efficient, allowing experiments to be run on personal PCs or laptops\nwhile still presenting sufficient challenges for existing MARL algorithms. We\nhave tested our environment on common MARL algorithms and demonstrated that\nthese algorithms have yet to find optimal solutions within this environment.\nThis facilitates the dissemination and advancement of MARL methods within the\nresearch community. Additionally, we hope that more researchers will leverage\nthe Honor of Kings map editor to develop innovative and scientifically valuable\nnew maps. Our code and user manual are available at:\nhttps://github.com/tencent-ailab/mini-hok.",
        "updated": "2024-06-06 11:42:33 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.03978v1"
    },
    {
        "title": "Amortized Equation Discovery in Hybrid Dynamical Systems",
        "authors": "Yongtuo LiuSara MagliacaneMiltiadis KofinasEfstratios Gavves",
        "links": "http://arxiv.org/abs/2406.03818v1",
        "entry_id": "http://arxiv.org/abs/2406.03818v1",
        "pdf_url": "http://arxiv.org/pdf/2406.03818v1",
        "summary": "Hybrid dynamical systems are prevalent in science and engineering to express\ncomplex systems with continuous and discrete states. To learn the laws of\nsystems, all previous methods for equation discovery in hybrid systems follow a\ntwo-stage paradigm, i.e. they first group time series into small cluster\nfragments and then discover equations in each fragment separately through\nmethods in non-hybrid systems. Although effective, these methods do not fully\ntake advantage of the commonalities in the shared dynamics of multiple\nfragments that are driven by the same equations. Besides, the two-stage\nparadigm breaks the interdependence between categorizing and representing\ndynamics that jointly form hybrid systems. In this paper, we reformulate the\nproblem and propose an end-to-end learning framework, i.e. Amortized Equation\nDiscovery (AMORE), to jointly categorize modes and discover equations\ncharacterizing the dynamics of each mode by all segments of the mode.\nExperiments on four hybrid and six non-hybrid systems show that our method\noutperforms previous methods on equation discovery, segmentation, and\nforecasting.",
        "updated": "2024-06-06 07:49:02 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.03818v1"
    }
]