[
    {
        "title": "Practices and Challenges of Online Love-seeking Among Deaf or Hard of Hearing People: A Case Study in China",
        "authors": "Beiyan CaoJingling ZhangChangyang HeYuru HuangMuzhi ZhouMingming Fan",
        "links": "http://arxiv.org/abs/2410.11810v2",
        "entry_id": "http://arxiv.org/abs/2410.11810v2",
        "pdf_url": "http://arxiv.org/pdf/2410.11810v2",
        "summary": "People who are deaf or hard of hearing (DHH) in China are increasingly\nexploring online platforms to connect with potential partners. This research\nexplores the online dating experiences of DHH communities in China, an area\nthat has not been extensively researched. We interviewed sixteen participants\nwho have varying levels of hearing ability and love-seeking statuses to\nunderstand how they manage their identities and communicate with potential\npartners online. We find that DHH individuals made great efforts to navigate\nthe rich modality features to seek love online. Participants used both\nalgorithm-based dating apps and community-based platforms like forums and\nWeChat to facilitate initial encounters through text-based functions that\nminimized the need for auditory interaction, thus fostering a more equitable\nstarting point. Community-based platforms were found to facilitate more\nin-depth communication and excelled in fostering trust and authenticity,\nproviding a more secure environment for genuine relationships. Design\nrecommendations are proposed to enhance the accessibility and inclusiveness of\nonline dating platforms for DHH individuals in China. This research sheds light\non the benefits and challenges of online dating for DHH individuals in China\nand provides guidance for platform developers and researchers to enhance user\nexperience in this area.",
        "updated": "2024-10-16 04:26:07 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.11810v2"
    },
    {
        "title": "Personas with Attitudes: Controlling LLMs for Diverse Data Annotation",
        "authors": "Leon FröhlingGianluca DemartiniDennis Assenmacher",
        "links": "http://arxiv.org/abs/2410.11745v1",
        "entry_id": "http://arxiv.org/abs/2410.11745v1",
        "pdf_url": "http://arxiv.org/pdf/2410.11745v1",
        "summary": "We present a novel approach for enhancing diversity and control in data\nannotation tasks by personalizing large language models (LLMs). We investigate\nthe impact of injecting diverse persona descriptions into LLM prompts across\ntwo studies, exploring whether personas increase annotation diversity and\nwhether the impacts of individual personas on the resulting annotations are\nconsistent and controllable. Our results show that persona-prompted LLMs\nproduce more diverse annotations than LLMs prompted without personas and that\nthese effects are both controllable and repeatable, making our approach a\nsuitable tool for improving data annotation in subjective NLP tasks like\ntoxicity detection.",
        "updated": "2024-10-15 16:22:49 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.11745v1"
    },
    {
        "title": "RClicks: Realistic Click Simulation for Benchmarking Interactive Segmentation",
        "authors": "Anton AntonovAndrey MoskalenkoDenis ShepelevAlexander KrapukhinKonstantin SoshinAnton KonushinVlad Shakhuro",
        "links": "http://arxiv.org/abs/2410.11722v1",
        "entry_id": "http://arxiv.org/abs/2410.11722v1",
        "pdf_url": "http://arxiv.org/pdf/2410.11722v1",
        "summary": "The emergence of Segment Anything (SAM) sparked research interest in the\nfield of interactive segmentation, especially in the context of image editing\ntasks and speeding up data annotation. Unlike common semantic segmentation,\ninteractive segmentation methods allow users to directly influence their output\nthrough prompts (e.g. clicks). However, click patterns in real-world\ninteractive segmentation scenarios remain largely unexplored. Most methods rely\non the assumption that users would click in the center of the largest erroneous\narea. Nevertheless, recent studies show that this is not always the case. Thus,\nmethods may have poor performance in real-world deployment despite high metrics\nin a baseline benchmark. To accurately simulate real-user clicks, we conducted\na large crowdsourcing study of click patterns in an interactive segmentation\nscenario and collected 475K real-user clicks. Drawing on ideas from saliency\ntasks, we develop a clickability model that enables sampling clicks, which\nclosely resemble actual user inputs. Using our model and dataset, we propose\nRClicks benchmark for a comprehensive comparison of existing interactive\nsegmentation methods on realistic clicks. Specifically, we evaluate not only\nthe average quality of methods, but also the robustness w.r.t. click patterns.\nAccording to our benchmark, in real-world usage interactive segmentation models\nmay perform worse than it has been reported in the baseline benchmark, and most\nof the methods are not robust. We believe that RClicks is a significant step\ntowards creating interactive segmentation methods that provide the best user\nexperience in real-world cases.",
        "updated": "2024-10-15 15:55:00 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.11722v1"
    },
    {
        "title": "Human-LLM Collaborative Construction of a Cantonese Emotion Lexicon",
        "authors": "Yusong ZhangDong DongChi-tim HungLeonard HeyerdahlTamara Giles-VernickEng-kiong Yeoh",
        "links": "http://arxiv.org/abs/2410.11526v1",
        "entry_id": "http://arxiv.org/abs/2410.11526v1",
        "pdf_url": "http://arxiv.org/pdf/2410.11526v1",
        "summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities in\nlanguage understanding and generation. Advanced utilization of the knowledge\nembedded in LLMs for automated annotation has consistently been explored. This\nstudy proposed to develop an emotion lexicon for Cantonese, a low-resource\nlanguage, through collaborative efforts between LLM and human annotators. By\nintegrating emotion labels provided by LLM and human annotators, the study\nleveraged existing linguistic resources including lexicons in other languages\nand local forums to construct a Cantonese emotion lexicon enriched with\ncolloquial expressions. The consistency of the proposed emotion lexicon in\nemotion extraction was assessed through modification and utilization of three\ndistinct emotion text datasets. This study not only validates the efficacy of\nthe constructed lexicon but also emphasizes that collaborative annotation\nbetween human and artificial intelligence can significantly enhance the quality\nof emotion labels, highlighting the potential of such partnerships in\nfacilitating natural language processing tasks for low-resource languages.",
        "updated": "2024-10-15 11:57:34 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.11526v1"
    },
    {
        "title": "EmoBridge: Bridging the Communication Gap between Students with Disabilities and Peer Note-Takers Utilizing Emojis and Real-Time Sharing",
        "authors": "Hyungwoo SongMinjeong ShinHyehyun ChuJiin HongJaechan LeeJinsu EunHajin Lim",
        "links": "http://arxiv.org/abs/2410.11432v1",
        "entry_id": "http://arxiv.org/abs/2410.11432v1",
        "pdf_url": "http://arxiv.org/pdf/2410.11432v1",
        "summary": "Students with disabilities (SWDs) often struggle with note-taking during\nlectures. Therefore, many higher education institutions have implemented peer\nnote-taking programs (PNTPs), where peer note-takers (PNTs) assist SWDs in\ntaking lecture notes. To better understand the experiences of SWDs and PNTs, we\nconducted semi-structured interviews with eight SWDs and eight PNTs. We found\nthat the interaction between SWDs and PNTs was predominantly unidirectional,\nhighlighting specific needs and challenges. In response, we developed\nEmoBridge, a collaborative note-taking platform that facilitates real-time\ncollaboration and communication between PNT-SWD pairs using emojis. We\nevaluated EmoBridge through an in-the-wild study with seven PNT-SWD pairs. The\nresults showed improved class participation for SWDs and a reduced sense of\nsole responsibility for PNTs. Based on these insights, we discuss design\nimplications for collaborative note-taking systems aimed at enhancing PNTPs and\nfostering more effective and inclusive educational experiences for SWDs.",
        "updated": "2024-10-15 09:34:33 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.11432v1"
    }
]