[
    {
        "title": "Review on modeling the societal impact of infrastructure disruptions due to disasters",
        "authors": "Yongsheng YangHuan LiuAli MostafaviHirokazu Tatano",
        "links": "http://arxiv.org/abs/2405.12732v1",
        "entry_id": "http://arxiv.org/abs/2405.12732v1",
        "pdf_url": "http://arxiv.org/pdf/2405.12732v1",
        "summary": "Infrastructure systems play a critical role in providing essential products\nand services for the functioning of modern society; however, they are\nvulnerable to disasters and their service disruptions can cause severe societal\nimpacts. To protect infrastructure from disasters and reduce potential impacts,\ngreat achievements have been made in modeling interdependent infrastructure\nsystems in past decades. In recent years, scholars have gradually shifted their\nresearch focus to understanding and modeling societal impacts of disruptions\nconsidering the fact that infrastructure systems are critical because of their\nrole in societal functioning, especially under situations of modern societies.\nExploring how infrastructure disruptions impair society to enhance resilient\ncity has become a key field of study. By comprehensively reviewing relevant\nstudies, this paper demonstrated the definition and types of societal impact of\ninfrastructure disruptions, and summarized the modeling approaches into four\ntypes: extended infrastructure modeling approaches, empirical approaches,\nagent-based approaches, and big data-driven approaches. For each approach, this\npaper organized relevant literature in terms of modeling ideas, advantages, and\ndisadvantages. Furthermore, the four approaches were compared according to\nseveral criteria, including the input data, types of societal impact, and\napplication scope. Finally, this paper illustrated the challenges and future\nresearch directions in the field.",
        "updated": "2024-05-21 12:37:45 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.12732v1"
    },
    {
        "title": "Reinforcement Learning Enabled Peer-to-Peer Energy Trading for Dairy Farms",
        "authors": "Mian Ibad Ali ShahEnda BarrettKarl Mason",
        "links": "http://arxiv.org/abs/2405.12716v1",
        "entry_id": "http://arxiv.org/abs/2405.12716v1",
        "pdf_url": "http://arxiv.org/pdf/2405.12716v1",
        "summary": "Farm businesses are increasingly adopting renewables to enhance energy\nefficiency and reduce reliance on fossil fuels and the grid. This shift aims to\ndecrease dairy farms' dependence on traditional electricity grids by enabling\nthe sale of surplus renewable energy in Peer-to-Peer markets. However, the\ndynamic nature of farm communities poses challenges, requiring specialized\nalgorithms for P2P energy trading. To address this, the Multi-Agent\nPeer-to-Peer Dairy Farm Energy Simulator (MAPDES) has been developed, providing\na platform to experiment with Reinforcement Learning techniques. The\nsimulations demonstrate significant cost savings, including a 43% reduction in\nelectricity expenses, a 42% decrease in peak demand, and a 1.91% increase in\nenergy sales compared to baseline scenarios lacking peer-to-peer energy trading\nor renewable energy sources.",
        "updated": "2024-05-21 12:19:17 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.12716v1"
    },
    {
        "title": "Learning to connect in action: Measuring and understanding the emergence of boundary spanners in volatile times",
        "authors": "Vittorio NespecaTina ComesFrances Brazier",
        "links": "http://arxiv.org/abs/2405.11998v1",
        "entry_id": "http://arxiv.org/abs/2405.11998v1",
        "pdf_url": "http://arxiv.org/pdf/2405.11998v1",
        "summary": "Collective intelligence of diverse groups is key for tackling many of today's\ngrand challenges such as fostering resilience and climate adaptation.\nInformation exchange across such diverse groups is crucial for collective\nintelligence, especially in volatile environments. To facilitate inter-group\ninformation exchange, Informational Boundary Spanners (IBSs) as pivotal\ninformation exchange 'hubs' are promising. However, the mechanisms that drive\nthe emergence of IBSs remain poorly understood. To address this gap there is\nfirst a need for a method to identify and measure the emergence of IBSs.\nSecond, an Agent-Based Modelling (ABM) framework is not available to\nsystematically study mechanisms for the emergence of IBSs in volatile\nenvironments. Third, even though the ability to learn who provides high-quality\ninformation is thought to be essential to explain the emergence of IBSs, a\nrigorous test of this mechanism is missing. The learning mechanism is\nformalized using an ABM framework, with the model's outputs analyzed using the\nproposed IBS emergence measurement method. To illustrate both the method and\nthe learning mechanism, we present a case study focused on information sharing\nin the volatile environment of a disaster. The study shows that learning\nconstitutes a mechanism for the emergence of effective IBSs in (a)\nlow-volatility environments characterised by low uncertainty and (b) in\nhigh-volatility environments characterised by rapid change if the number of\ninter-group connections is sufficient. With the method and model, this paper\naims to lay the foundations for exploring mechanisms for the emergence of IBSs\nthat facilitate inter-group information exchange. This article advances\ncollective intelligence by providing the essential elements for measuring and\nunderstanding the emergence of IBSs and exploring the effect of learning on\ntheir emergence in volatile environments.",
        "updated": "2024-05-20 13:09:52 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.11998v1"
    },
    {
        "title": "Safe by Design Autonomous Driving Systems",
        "authors": "Marius BozgaJoseph Sifakis",
        "links": "http://arxiv.org/abs/2405.11995v1",
        "entry_id": "http://arxiv.org/abs/2405.11995v1",
        "pdf_url": "http://arxiv.org/pdf/2405.11995v1",
        "summary": "Developing safe autonomous driving systems is a major scientific and\ntechnical challenge. Existing AI-based end-to-end solutions do not offer the\nnecessary safety guarantees, while traditional systems engineering approaches\nare defeated by the complexity of the problem. Currently, there is an\nincreasing interest in hybrid design solutions, integrating machine learning\ncomponents, when necessary, while using model-based components for goal\nmanagement and planning.\n  We study a method for building safe by design autonomous driving systems,\nbased on the assumption that the capability to drive boils down to the\ncoordinated execution of a given set of driving operations. The assumption is\nsubstantiated by a compositionality result considering that autopilots are\ndynamic systems receiving a small number of types of vistas as input, each\nvista defining a free space in its neighborhood. It is shown that safe driving\nfor each type of vista in the corresponding free space, implies safe driving\nfor any possible scenario under some easy-to-check conditions concerning the\ntransition between vistas. The designed autopilot comprises distinct control\npolicies one per type of vista, articulated in two consecutive phases. The\nfirst phase consists of carefully managing a potentially risky situation by\nvirtually reducing speed, while the second phase consists of exiting the\nsituation by accelerating.\n  The autopilots designed use for their predictions simple functions\ncharacterizing the acceleration and deceleration capabilities of the vehicles.\nThey cover the main driving operations, including entering a main road,\novertaking, crossing intersections protected by traffic lights or signals, and\ndriving on freeways. The results presented reinforce the case for hybrid\nsolutions that incorporate mathematically elegant and robust decision methods\nthat are safe by design.",
        "updated": "2024-05-20 12:58:25 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.11995v1"
    },
    {
        "title": "Equilibria in multiagent online problems with predictions",
        "authors": "Gabriel IstrateCosmin BonchişVictor Bogdan",
        "links": "http://arxiv.org/abs/2405.11873v1",
        "entry_id": "http://arxiv.org/abs/2405.11873v1",
        "pdf_url": "http://arxiv.org/pdf/2405.11873v1",
        "summary": "We study the power of (competitive) algorithms with predictions in a\nmultiagent setting. For this we introduce a multiagent version of the\nski-rental problem. In this problem agents can collaborate by pooling resources\nto get a group license for some asset. If the license price is not met agents\nhave to rent the asset individually for the day at a unit price. Otherwise the\nlicense becomes available forever to everyone at no extra cost. Our main\ncontribution is a best-response analysis of a single-agent competitive\nalgorithm that assumes perfect knowledge of other agents' actions (but no\nknowledge of its own renting time). We then analyze the setting when agents\nhave a predictor for their own active time, yielding a tradeoff between\nrobustness and consistency. We investigate the effect of using such a predictor\nin an equilibrium, as well as the new equilibria formed in this way.",
        "updated": "2024-05-20 08:30:11 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.11873v1"
    }
]