[
    {
        "title": "GazeGPT: Augmenting Human Capabilities using Gaze-contingent Contextual AI for Smart Eyewear",
        "authors": "Robert KonradNitish PadmanabanJ. Gabriel BuckmasterKevin C. BoyleGordon Wetzstein",
        "links": "http://arxiv.org/abs/2401.17217v2",
        "entry_id": "http://arxiv.org/abs/2401.17217v2",
        "pdf_url": "http://arxiv.org/pdf/2401.17217v2",
        "summary": "Multimodal large language models (LMMs) excel in world knowledge and\nproblem-solving abilities. Through the use of a world-facing camera and\ncontextual AI, emerging smart accessories aim to provide a seamless interface\nbetween humans and LMMs. Yet, these wearable computing systems lack an\nunderstanding of the user's attention. We introduce GazeGPT as a new user\ninteraction paradigm for contextual AI. GazeGPT uses eye tracking to help the\nLMM understand which object in the world-facing camera view a user is paying\nattention to. Using extensive user evaluations, we show that this\ngaze-contingent mechanism is a faster and more accurate pointing mechanism than\nalternatives; that it augments human capabilities by significantly improving\ntheir accuracy in a dog-breed classification task; and that it is consistently\nranked as more natural than head- or body-driven selection mechanisms for\ncontextual AI. Moreover, we prototype a variety of application scenarios that\nsuggest GazeGPT could be of significant value to users as part of future\nAI-driven personal assistants.",
        "updated": "2024-01-31 05:21:13 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.17217v2"
    },
    {
        "title": "Learning Agent-based Modeling with LLM Companions: Experiences of Novices and Experts Using ChatGPT & NetLogo Chat",
        "authors": "John ChenXi LuMichael RejtigDavid DuRuth BagleyMichael S. HornUri J. Wilensky",
        "links": "http://dx.doi.org/10.1145/3613904.3642377",
        "entry_id": "http://arxiv.org/abs/2401.17163v1",
        "pdf_url": "http://arxiv.org/pdf/2401.17163v1",
        "summary": "Large Language Models (LLMs) have the potential to fundamentally change the\nway people engage in computer programming. Agent-based modeling (ABM) has\nbecome ubiquitous in natural and social sciences and education, yet no prior\nstudies have explored the potential of LLMs to assist it. We designed NetLogo\nChat to support the learning and practice of NetLogo, a programming language\nfor ABM. To understand how users perceive, use, and need LLM-based interfaces,\nwe interviewed 30 participants from global academia, industry, and graduate\nschools. Experts reported more perceived benefits than novices and were more\ninclined to adopt LLMs in their workflow. We found significant differences\nbetween experts and novices in their perceptions, behaviors, and needs for\nhuman-AI collaboration. We surfaced a knowledge gap between experts and novices\nas a possible reason for the benefit gap. We identified guidance,\npersonalization, and integration as major needs for LLM-based interfaces to\nsupport the programming of ABM.",
        "updated": "2024-01-30 16:49:50 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.17163v1"
    },
    {
        "title": "Wrist movement classification for adaptive mobile phone based rehabilitation of children with motor skill impairments",
        "authors": "Kayleigh SchoorlTamara Pinos CisnerosAlbert Ali SalahBen Schouten",
        "links": "http://arxiv.org/abs/2401.17134v1",
        "entry_id": "http://arxiv.org/abs/2401.17134v1",
        "pdf_url": "http://arxiv.org/pdf/2401.17134v1",
        "summary": "Rehabilitation exercises performed by children with cerebral palsy are\ntedious and repetitive. To make them more engaging, we propose to use an\nexergame approach, where an adaptive application can help the child remain\nstimulated and interested during exercises. In this paper, we describe how the\nmobile phone sensors can be used to classify wrist movements of the user during\nthe rehabilitation exercises to detect if the user is performing the correct\nexercise and illustrate the use of our approach in an actual mobile phone\napplication. We also show how an adaptive difficulty system was added to the\napplication to allow the system to adjust to the user. We present experimental\nresults from a pilot with healthy subjects that were constrained to simulate\nrestricted wrist movements, as well as from tests with a target group of\nchildren with cerebral palsy. Our results show that wrist movement\nclassification is successfully achieved and results in improved interactions.",
        "updated": "2024-01-30 16:11:31 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.17134v1"
    },
    {
        "title": "PlantoGraphy: Incorporating Iterative Design Process into Generative Artificial Intelligence for Landscape Rendering",
        "authors": "Rong HuangHai-Chuan LinChuanzhang ChenKang ZhangWei Zeng",
        "links": "http://dx.doi.org/10.1145/3613904.3642824",
        "entry_id": "http://arxiv.org/abs/2401.17120v1",
        "pdf_url": "http://arxiv.org/pdf/2401.17120v1",
        "summary": "Landscape renderings are realistic images of landscape sites, allowing\nstakeholders to perceive better and evaluate design ideas. While recent\nadvances in Generative Artificial Intelligence (GAI) enable automated\ngeneration of landscape renderings, the end-to-end methods are not compatible\nwith common design processes, leading to insufficient alignment with design\nidealizations and limited cohesion of iterative landscape design. Informed by a\nformative study for comprehending design requirements, we present PlantoGraphy,\nan iterative design system that allows for interactive configuration of GAI\nmodels to accommodate human-centered design practice. A two-stage pipeline is\nincorporated: first, concretization module transforms conceptual ideas into\nconcrete scene layouts with a domain-oriented large language model; and second,\nillustration module converts scene layouts into realistic landscape renderings\nusing a fine-tuned low-rank adaptation diffusion model. PlantoGraphy has\nundergone a series of performance evaluations and user studies, demonstrating\nits effectiveness in landscape rendering generation and the high recognition of\nits interactive functionality.",
        "updated": "2024-01-30 15:53:42 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.17120v1"
    },
    {
        "title": "The Influence of Presentation and Performance on User Satisfaction",
        "authors": "Kanaad PathakLeif AzzopardiMartin Halvey",
        "links": "http://arxiv.org/abs/2401.17100v1",
        "entry_id": "http://arxiv.org/abs/2401.17100v1",
        "pdf_url": "http://arxiv.org/pdf/2401.17100v1",
        "summary": "The effectiveness of an IR system is gauged not just by its ability to\nretrieve relevant results but also by how it presents these results to users;\nan engaging presentation often correlates with increased user satisfaction.\nWhile existing research has delved into the link between user satisfaction, IR\nperformance metrics, and presentation, these aspects have typically been\ninvestigated in isolation. Our research aims to bridge this gap by examining\nthe relationship between query performance, presentation and user satisfaction.\nFor our analysis, we conducted a between-subjects experiment comparing the\neffectiveness of various result card layouts for an ad-hoc news search\ninterface. Drawing data from the TREC WaPo 2018 collection, we centered our\nstudy on four specific topics. Within each of these topics, we assessed six\ndistinct queries with varying nDCG values. Our study involved 164 participants\nwho were exposed to one of five distinct layouts containing result cards, such\nas \"title'', \"title+image'', or \"title+image+summary''. Our findings indicate\nthat while nDCG is a strong predictor of user satisfaction at the query level,\nthere exists no linear relationship between the performance of the query,\npresentation of results and user satisfaction. However, when considering the\ntotal gain on the initial result page, we observed that presentation does play\na significant role in user satisfaction (at the query level) for certain\nlayouts with result cards such as, title+image or title+image+summary. Our\nresults also suggest that the layout differences have complex and multifaceted\nimpacts on satisfaction. We demonstrate the capacity to equalize user\nsatisfaction levels between queries of varying performance by changing how\nresults are presented. This emphasizes the necessity to harmonize both\nperformance and presentation in IR systems, considering users' diverse\npreferences.",
        "updated": "2024-01-30 15:32:56 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.17100v1"
    }
]