[
    {
        "title": "Scalable Mechanism Design for Multi-Agent Path Finding",
        "authors": "Paul FriedrichYulun ZhangMichael CurryLudwig DierksStephen McAleerJiaoyang LiTuomas SandholmSven Seuken",
        "links": "http://arxiv.org/abs/2401.17044v1",
        "entry_id": "http://arxiv.org/abs/2401.17044v1",
        "pdf_url": "http://arxiv.org/pdf/2401.17044v1",
        "summary": "Multi-Agent Path Finding (MAPF) involves determining paths for multiple\nagents to travel simultaneously through a shared area toward particular goal\nlocations. This problem is computationally complex, especially when dealing\nwith large numbers of agents, as is common in realistic applications like\nautonomous vehicle coordination. Finding an optimal solution is often\ncomputationally infeasible, making the use of approximate algorithms essential.\nAdding to the complexity, agents might act in a self-interested and strategic\nway, possibly misrepresenting their goals to the MAPF algorithm if it benefits\nthem. Although the field of mechanism design offers tools to align incentives,\nusing these tools without careful consideration can fail when only having\naccess to approximately optimal outcomes. Since approximations are crucial for\nscalable MAPF algorithms, this poses a significant challenge. In this work, we\nintroduce the problem of scalable mechanism design for MAPF and propose three\nstrategyproof mechanisms, two of which even use approximate MAPF algorithms. We\ntest our mechanisms on realistic MAPF domains with problem sizes ranging from\ndozens to hundreds of agents. Our findings indicate that they improve welfare\nbeyond a simple baseline.",
        "updated": "2024-01-30 14:26:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.17044v1"
    },
    {
        "title": "Congestion Pricing for Efficiency and Equity: Theory and Applications to the San Francisco Bay Area",
        "authors": "Chinmay MaheshwariKshitij KulkarniDruv PaiJiarui YangManxi WuShankar Sastry",
        "links": "http://arxiv.org/abs/2401.16844v1",
        "entry_id": "http://arxiv.org/abs/2401.16844v1",
        "pdf_url": "http://arxiv.org/pdf/2401.16844v1",
        "summary": "Congestion pricing, while adopted by many cities to alleviate traffic\ncongestion, raises concerns about widening socioeconomic disparities due to its\ndisproportionate impact on low-income travelers. In this study, we address this\nconcern by proposing a new class of congestion pricing schemes that not only\nminimize congestion levels but also incorporate an equity objective to reduce\ncost disparities among travelers with different willingness-to-pay. Our\nanalysis builds on a congestion game model with heterogeneous traveler\npopulations. We present four pricing schemes that account for practical\nconsiderations, such as the ability to charge differentiated tolls to various\ntraveler populations and the option to toll all or only a subset of edges in\nthe network. We evaluate our pricing schemes in the calibrated freeway network\nof the San Francisco Bay Area. We demonstrate that the proposed congestion\npricing schemes improve both efficiency (in terms of reduced average travel\ntime) and equity (the disparities of travel costs experienced by different\npopulations) compared to the current pricing scheme. Moreover, our pricing\nschemes also generate a total revenue comparable to the current pricing scheme.\nOur results further show that pricing schemes charging differentiated prices to\ntraveler populations with varying willingness-to-pay lead to a more equitable\ndistribution of travel costs compared to those that charge a homogeneous price\nto all.",
        "updated": "2024-01-30 09:35:02 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.16844v1"
    },
    {
        "title": "Learning to Manipulate under Limited Information",
        "authors": "Wesley H. HollidayAlexander KristoffersenEric Pacuit",
        "links": "http://arxiv.org/abs/2401.16412v1",
        "entry_id": "http://arxiv.org/abs/2401.16412v1",
        "pdf_url": "http://arxiv.org/pdf/2401.16412v1",
        "summary": "By classic results in social choice theory, any reasonable preferential\nvoting method sometimes gives individuals an incentive to report an insincere\npreference. The extent to which different voting methods are more or less\nresistant to such strategic manipulation has become a key consideration for\ncomparing voting methods. Here we measure resistance to manipulation by whether\nneural networks of varying sizes can learn to profitably manipulate a given\nvoting method in expectation, given different types of limited information\nabout how other voters will vote. We trained nearly 40,000 neural networks of\n26 sizes to manipulate against 8 different voting methods, under 6 types of\nlimited information, in committee-sized elections with 5-21 voters and 3-6\ncandidates. We find that some voting methods, such as Borda, are highly\nmanipulable by networks with limited information, while others, such as Instant\nRunoff, are not, despite being quite profitably manipulated by an ideal\nmanipulator with full information.",
        "updated": "2024-01-29 18:49:50 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.16412v1"
    },
    {
        "title": "Towards Regret Free Slot Allocation in Billboard Advertisement",
        "authors": "Dildar AliSuman BanerjeeYamuna Prasad",
        "links": "http://arxiv.org/abs/2401.16464v1",
        "entry_id": "http://arxiv.org/abs/2401.16464v1",
        "pdf_url": "http://arxiv.org/pdf/2401.16464v1",
        "summary": "Creating and maximizing influence among the customers is one of the central\ngoals of an advertiser, and hence, remains an active area of research in recent\ntimes. In this advertisement technique, the advertisers approach an influence\nprovider for a specific number of views of their content on a payment basis.\nNow, if the influence provider can provide the required number of views or\nmore, he will receive the full, else a partial payment. In the context of an\ninfluence provider, it is a loss for him if he offers more or less views. This\nis formalized as 'Regret', and naturally, in the context of the influence\nprovider, the goal will be to minimize this quantity. In this paper, we solve\nthis problem in the context of billboard advertisement and pose it as a\ndiscrete optimization problem. We propose four efficient solution approaches\nfor this problem and analyze them to understand their time and space\ncomplexity. We implement all the solution methodologies with real-life datasets\nand compare the obtained results with the existing solution approaches from the\nliterature. We observe that the proposed solutions lead to less regret while\ntaking less computational time.",
        "updated": "2024-01-29 16:10:05 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.16464v1"
    },
    {
        "title": "Effective Communication with Dynamic Feature Compression",
        "authors": "Pietro TalliFrancesco PaseFederico ChiariottiAndrea ZanellaMichele Zorzi",
        "links": "http://arxiv.org/abs/2401.16236v1",
        "entry_id": "http://arxiv.org/abs/2401.16236v1",
        "pdf_url": "http://arxiv.org/pdf/2401.16236v1",
        "summary": "The remote wireless control of industrial systems is one of the major use\ncases for 5G and beyond systems: in these cases, the massive amounts of sensory\ninformation that need to be shared over the wireless medium may overload even\nhigh-capacity connections. Consequently, solving the effective communication\nproblem by optimizing the transmission strategy to discard irrelevant\ninformation can provide a significant advantage, but is often a very complex\ntask. In this work, we consider a prototypal system in which an observer must\ncommunicate its sensory data to a robot controlling a task (e.g., a mobile\nrobot in a factory). We then model it as a remote Partially Observable Markov\nDecision Process (POMDP), considering the effect of adopting semantic and\neffective communication-oriented solutions on the overall system performance.\nWe split the communication problem by considering an ensemble Vector Quantized\nVariational Autoencoder (VQ-VAE) encoding, and train a Deep Reinforcement\nLearning (DRL) agent to dynamically adapt the quantization level, considering\nboth the current state of the environment and the memory of past messages. We\ntested the proposed approach on the well-known CartPole reference control\nproblem, obtaining a significant performance increase over traditional\napproaches.",
        "updated": "2024-01-29 15:35:05 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.16236v1"
    }
]