[
    {
        "title": "Coniferest: a complete active anomaly detection framework",
        "authors": "M. V. KornilovV. S. KorolevK. L. MalanchevA. D. LavrukhinaE. RusseilT. A. SemenikhinE. GanglerE. E. O. IshidaM. V. PruzhinskayaA. A. VolnovaS. Sreejith",
        "links": "http://arxiv.org/abs/2410.17142v1",
        "entry_id": "http://arxiv.org/abs/2410.17142v1",
        "pdf_url": "http://arxiv.org/pdf/2410.17142v1",
        "summary": "We present coniferest, an open source generic purpose active anomaly\ndetection framework written in Python. The package design and implemented\nalgorithms are described. Currently, static outlier detection analysis is\nsupported via the Isolation forest algorithm. Moreover, Active Anomaly\nDiscovery (AAD) and Pineforest algorithms are available to tackle active\nanomaly detection problems. The algorithms and package performance are\nevaluated on a series of synthetic datasets. We also describe a few success\ncases which resulted from applying the package to real astronomical data in\nactive anomaly detection tasks within the SNAD project.",
        "updated": "2024-10-22 16:19:13 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.17142v1"
    },
    {
        "title": "Lunar Subterra: a Self-Integrative Unit with an Automated Drilling System",
        "authors": "Anthony SfeirAsya PetkovaSabine ChaayaKarina ChichovaMarta RossiAnna VockAlessandro MosutAkshayanivasini Ramasamy SaravanarajValentina SuminiTommy Nilsson",
        "links": "http://arxiv.org/abs/2410.17114v1",
        "entry_id": "http://arxiv.org/abs/2410.17114v1",
        "pdf_url": "http://arxiv.org/pdf/2410.17114v1",
        "summary": "As humans venture deeper into space, the need for a lunar settlement, housing\nthe first group of settlers, grows steadily. By means of new technologies such\nas in situ resource utilisation (ISRU) as well as computational design, this\ngoal can be implemented in present years. Providing the first arrivals with an\nimmediate underground habitat safe from radiation and other environmental\nconstraints is of crucial importance to initialise a prolonged mission on the\nMoon. The project's proposal revolves around the idea of establishing a base\nwhich provides an immediately habitable space with the possibility for future\nexpansion. Advanced construction methods and sustainable practices lay the\ngroundwork for a permanent human presence, predominantly based on ISRU. This\npaper outlines a two-phase initiative aimed at the foundation of the Lunar\nSubterra, followed by an extension of the habitat above ground. Following our\ncollaboration with the PoliSpace Sparc Student Association group, a Virtual\nReality (VR) reproduction of the proposed habitat enabled quick iterative\ntesting of the habitable space with the use of a Meta Quest 2 headset. This not\nonly allowed an evaluation of the environment and its impact on human residents\nbut also eradicated the need for tangible models to conceptualise the idea,\nenabling rapid user-centred design and implementation in the future of space\nexploration.",
        "updated": "2024-10-22 15:40:44 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.17114v1"
    },
    {
        "title": "Human-LLM Hybrid Text Answer Aggregation for Crowd Annotations",
        "authors": "Jiyi Li",
        "links": "http://arxiv.org/abs/2410.17099v1",
        "entry_id": "http://arxiv.org/abs/2410.17099v1",
        "pdf_url": "http://arxiv.org/pdf/2410.17099v1",
        "summary": "The quality is a crucial issue for crowd annotations. Answer aggregation is\nan important type of solution. The aggregated answers estimated from multiple\ncrowd answers to the same instance are the eventually collected annotations,\nrather than the individual crowd answers themselves. Recently, the capability\nof Large Language Models (LLMs) on data annotation tasks has attracted interest\nfrom researchers. Most of the existing studies mainly focus on the average\nperformance of individual crowd workers; several recent works studied the\nscenarios of aggregation on categorical labels and LLMs used as label creators.\nHowever, the scenario of aggregation on text answers and the role of LLMs as\naggregators are not yet well-studied. In this paper, we investigate the\ncapability of LLMs as aggregators in the scenario of close-ended crowd text\nanswer aggregation. We propose a human-LLM hybrid text answer aggregation\nmethod with a Creator-Aggregator Multi-Stage (CAMS) crowdsourcing framework. We\nmake the experiments based on public crowdsourcing datasets. The results show\nthe effectiveness of our approach based on the collaboration of crowd workers\nand LLMs.",
        "updated": "2024-10-22 15:22:58 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.17099v1"
    },
    {
        "title": "Evaluation of a Data Annotation Platform for Large, Time-Series Datasets in Intensive Care: Mixed Methods Study",
        "authors": "Marceli WacRaul Santos-RodriguezChris McWilliamsChristopher Bourdeaux",
        "links": "http://arxiv.org/abs/2410.16959v1",
        "entry_id": "http://arxiv.org/abs/2410.16959v1",
        "pdf_url": "http://arxiv.org/pdf/2410.16959v1",
        "summary": "Intensive Care Units are complex, data-rich environments where critically ill\npatients are treated using variety of clinical equipment. The data collected\nusing this equipment can be used clinical staff to gain insight into the\ncondition of the patients and provide adequate treatment, but it also provides\nample opportunity for applications in machine learning and data science. While\nthis data can frequently be used directly, complex problems may require\nadditional annotations to provide context and meaning before it could be used\nto train the machine learning models. Annotating time-series datasets in\nclinical setting is a complex problem due to a large volume and complexity of\nthe data, time-consuming nature of the process and the fact that clinicians'\ntime is in both high demand and short supply. In this study, we present an\nevaluation of a bespoke tool designed to annotate large, clinical time-series\ndatasets with staff from intensive care units. The software incorporates two\nmodes for annotation: by annotating individual admissions and by generating\nrulesets which are applied to the entire dataset. Our study was split into two\nstages focusing on individual and semi-automated annotation and included 28\nannotators across both stages who utilised 50 clinical parameters to guide\ntheir annotations. We experienced significant challenges in recruitment and\nengagement of the participants in the annotation activities and developed\ninterventions which improved the participation over the course of the study.\nDuring the semi-automated annotation, we observed preferences for different\nparameter types (measured vs. observed), as well as relative agreement of\nparticipants across shared admissions to the decision-tree model trained using\ntheir rulesets.",
        "updated": "2024-10-22 12:38:56 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.16959v1"
    },
    {
        "title": "Satori: Towards Proactive AR Assistant with Belief-Desire-Intention User Modeling",
        "authors": "Chenyi LiGuande WuGromit Yeuk-Yin ChanDishita G TurakhiaSonia Castelo QuispeDong LiLeslie WelchClaudio SilvaJing Qian",
        "links": "http://arxiv.org/abs/2410.16668v1",
        "entry_id": "http://arxiv.org/abs/2410.16668v1",
        "pdf_url": "http://arxiv.org/pdf/2410.16668v1",
        "summary": "Augmented Reality assistance are increasingly popular for supporting users\nwith tasks like assembly and cooking. However, current practice typically\nprovide reactive responses initialized from user requests, lacking\nconsideration of rich contextual and user-specific information. To address this\nlimitation, we propose a novel AR assistance system, Satori, that models both\nuser states and environmental contexts to deliver proactive guidance. Our\nsystem combines the Belief-Desire-Intention (BDI) model with a state-of-the-art\nmulti-modal large language model (LLM) to infer contextually appropriate\nguidance. The design is informed by two formative studies involving twelve\nexperts. A sixteen within-subject study find that Satori achieves performance\ncomparable to an designer-created Wizard-of-Oz (WoZ) system without relying on\nmanual configurations or heuristics, thereby enhancing generalizability,\nreusability and opening up new possibilities for AR assistance.",
        "updated": "2024-10-22 03:53:46 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.16668v1"
    }
]