[
    {
        "title": "Scalable spectral representations for network multiagent control",
        "authors": "Zhaolin RenRunyuZhangBo DaiNa Li",
        "links": "http://arxiv.org/abs/2410.17221v1",
        "entry_id": "http://arxiv.org/abs/2410.17221v1",
        "pdf_url": "http://arxiv.org/pdf/2410.17221v1",
        "summary": "Network Markov Decision Processes (MDPs), a popular model for multi-agent\ncontrol, pose a significant challenge to efficient learning due to the\nexponential growth of the global state-action space with the number of agents.\nIn this work, utilizing the exponential decay property of network dynamics, we\nfirst derive scalable spectral local representations for network MDPs, which\ninduces a network linear subspace for the local $Q$-function of each agent.\nBuilding on these local spectral representations, we design a scalable\nalgorithmic framework for continuous state-action network MDPs, and provide\nend-to-end guarantees for the convergence of our algorithm. Empirically, we\nvalidate the effectiveness of our scalable representation-based approach on two\nbenchmark problems, and demonstrate the advantages of our approach over generic\nfunction approximation approaches to representing the local $Q$-functions.",
        "updated": "2024-10-22 17:45:45 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.17221v1"
    },
    {
        "title": "Delay-Constrained Grant-Free Random Access in MIMO Systems: Distributed Pilot Allocation and Power Control",
        "authors": "Jianan BaiZheng ChenErik. G. Larsson",
        "links": "http://arxiv.org/abs/2410.17068v1",
        "entry_id": "http://arxiv.org/abs/2410.17068v1",
        "pdf_url": "http://arxiv.org/pdf/2410.17068v1",
        "summary": "We study a delay-constrained grant-free random access system with a\nmulti-antenna base station. The users randomly generate data packets with\nexpiration deadlines, which are then transmitted from data queues on a first-in\nfirst-out basis. To deliver a packet, a user needs to succeed in both random\naccess phase (sending a pilot without collision) and data transmission phase\n(achieving a required data rate with imperfect channel information) before the\npacket expires. We develop a distributed, cross-layer policy that allows the\nusers to dynamically and independently choose their pilots and transmit powers\nto achieve a high effective sum throughput with fairness consideration. Our\npolicy design involves three key components: 1) a proxy of the instantaneous\ndata rate that depends only on macroscopic environment variables and\ntransmission decisions, considering pilot collisions and imperfect channel\nestimation; 2) a quantitative, instantaneous measure of fairness within each\ncommunication round; and 3) a deep learning-based, multi-agent control\nframework with centralized training and distributed execution. The proposed\nframework benefits from an accurate, differentiable objective function for\ntraining, thereby achieving a higher sample efficiency compared with a\nconventional application of model-free, multi-agent reinforcement learning\nalgorithms. The performance of the proposed approach is verified by simulations\nunder highly dynamic and heterogeneous scenarios.",
        "updated": "2024-10-22 14:47:08 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.17068v1"
    },
    {
        "title": "SERN: Simulation-Enhanced Realistic Navigation for Multi-Agent Robotic Systems in Contested Environments",
        "authors": "Jumman HossainEmon DeySnehalraj ChughMasud AhmedMS AnwarAbu-Zaher FarideeJason HoppesTheron TroutAnjon BasakRafidh ChowdhuryRishabh MistryHyun KimJade FreemanNiranjan SuriAdrienne RaglinCarl BusartTimothy GregoryAnuradha RaviNirmalya Roy",
        "links": "http://arxiv.org/abs/2410.16686v1",
        "entry_id": "http://arxiv.org/abs/2410.16686v1",
        "pdf_url": "http://arxiv.org/pdf/2410.16686v1",
        "summary": "The increasing deployment of autonomous systems in complex environments\nnecessitates efficient communication and task completion among multiple agents.\nThis paper presents SERN (Simulation-Enhanced Realistic Navigation), a novel\nframework integrating virtual and physical environments for real-time\ncollaborative decision-making in multi-robot systems. SERN addresses key\nchallenges in asset deployment and coordination through a bi-directional\ncommunication framework using the AuroraXR ROS Bridge. Our approach advances\nthe SOTA through accurate real-world representation in virtual environments\nusing Unity high-fidelity simulator; synchronization of physical and virtual\nrobot movements; efficient ROS data distribution between remote locations; and\nintegration of SOTA semantic segmentation for enhanced environmental\nperception. Our evaluations show a 15% to 24% improvement in latency and up to\na 15% increase in processing efficiency compared to traditional ROS setups.\nReal-world and virtual simulation experiments with multiple robots demonstrate\nsynchronization accuracy, achieving less than 5 cm positional error and under\n2-degree rotational error. These results highlight SERN's potential to enhance\nsituational awareness and multi-agent coordination in diverse, contested\nenvironments.",
        "updated": "2024-10-22 04:35:57 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.16686v1"
    },
    {
        "title": "Cutting Through the Confusion and Hype: Understanding the True Potential of Generative AI",
        "authors": "Ante ProdanJo-An OcchipintiRehez AhlipGoran UjdurHarris A. EyreKyle GoosenLuke PenzaMark Heffernan",
        "links": "http://arxiv.org/abs/2410.16629v1",
        "entry_id": "http://arxiv.org/abs/2410.16629v1",
        "pdf_url": "http://arxiv.org/pdf/2410.16629v1",
        "summary": "This paper explores the nuanced landscape of generative AI (genAI),\nparticularly focusing on neural network-based models like Large Language Models\n(LLMs). While genAI garners both optimistic enthusiasm and sceptical criticism,\nthis work seeks to provide a balanced examination of its capabilities,\nlimitations, and the profound impact it may have on societal functions and\npersonal interactions. The first section demystifies language-based genAI\nthrough detailed discussions on how LLMs learn, their computational needs,\ndistinguishing features from supporting technologies, and the inherent\nlimitations in their accuracy and reliability. Real-world examples illustrate\nthe practical applications and implications of these technologies. The latter\npart of the paper adopts a systems perspective, evaluating how the integration\nof LLMs with existing technologies can enhance productivity and address\nemerging concerns. It highlights the need for significant investment to\nunderstand the implications of recent advancements, advocating for a\nwell-informed dialogue to ethically and responsibly integrate genAI into\ndiverse sectors. The paper concludes with prospective developments and\nrecommendations, emphasizing a forward-looking approach to harnessing genAI`s\npotential while mitigating its risks.",
        "updated": "2024-10-22 02:18:44 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.16629v1"
    },
    {
        "title": "Convex Markov Games: A Framework for Fairness, Imitation, and Creativity in Multi-Agent Learning",
        "authors": "Ian GempAndreas HauptLuke MarrisSiqi LiuGeorgios Piliouras",
        "links": "http://arxiv.org/abs/2410.16600v1",
        "entry_id": "http://arxiv.org/abs/2410.16600v1",
        "pdf_url": "http://arxiv.org/pdf/2410.16600v1",
        "summary": "Expert imitation, behavioral diversity, and fairness preferences give rise to\npreferences in sequential decision making domains that do not decompose\nadditively across time. We introduce the class of convex Markov games that\nallow general convex preferences over occupancy measures. Despite infinite time\nhorizon and strictly higher generality than Markov games, pure strategy Nash\nequilibria exist under strict convexity. Furthermore, equilibria can be\napproximated efficiently by performing gradient descent on an upper bound of\nexploitability. Our experiments imitate human choices in ultimatum games,\nreveal novel solutions to the repeated prisoner's dilemma, and find fair\nsolutions in a repeated asymmetric coordination game. In the prisoner's\ndilemma, our algorithm finds a policy profile that deviates from observed human\nplay only slightly, yet achieves higher per-player utility while also being\nthree orders of magnitude less exploitable.",
        "updated": "2024-10-22 00:55:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2410.16600v1"
    }
]