[
    {
        "title": "On the Pros and Cons of Active Learning for Moral Preference Elicitation",
        "authors": "Vijay KeswaniVincent ConitzerHoda HeidariJana Schaich BorgWalter Sinnott-Armstrong",
        "links": "http://arxiv.org/abs/2407.18889v1",
        "entry_id": "http://arxiv.org/abs/2407.18889v1",
        "pdf_url": "http://arxiv.org/pdf/2407.18889v1",
        "summary": "Computational preference elicitation methods are tools used to learn people's\npreferences quantitatively in a given context. Recent works on preference\nelicitation advocate for active learning as an efficient method to iteratively\nconstruct queries (framed as comparisons between context-specific cases) that\nare likely to be most informative about an agent's underlying preferences. In\nthis work, we argue that the use of active learning for moral preference\nelicitation relies on certain assumptions about the underlying moral\npreferences, which can be violated in practice. Specifically, we highlight the\nfollowing common assumptions (a) preferences are stable over time and not\nsensitive to the sequence of presented queries, (b) the appropriate hypothesis\nclass is chosen to model moral preferences, and (c) noise in the agent's\nresponses is limited. While these assumptions can be appropriate for preference\nelicitation in certain domains, prior research on moral psychology suggests\nthey may not be valid for moral judgments. Through a synthetic simulation of\npreferences that violate the above assumptions, we observe that active learning\ncan have similar or worse performance than a basic random query selection\nmethod in certain settings. Yet, simulation results also demonstrate that\nactive learning can still be viable if the degree of instability or noise is\nrelatively small and when the agent's preferences can be approximately\nrepresented with the hypothesis class used for learning. Our study highlights\nthe nuances associated with effective moral preference elicitation in practice\nand advocates for the cautious use of active learning as a methodology to learn\nmoral preferences.",
        "updated": "2024-07-26 17:40:52 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.18889v1"
    },
    {
        "title": "Engaging with Children's Artwork in Mixed Visual-Ability Families",
        "authors": "Arnavi Chheda-KotharyJacob O. WobbrockJon E. Froehlich",
        "links": "http://arxiv.org/abs/2407.18874v1",
        "entry_id": "http://arxiv.org/abs/2407.18874v1",
        "pdf_url": "http://arxiv.org/pdf/2407.18874v1",
        "summary": "We present two studies exploring how blind or low-vision (BLV) family members\nengage with their sighted children's artwork, strategies to support\nunderstanding and interpretation, and the potential role of technology, such as\nAI, therein. Our first study involved 14 BLV individuals, and the second\nincluded five groups of BLV individuals with their children. Through\nsemi-structured interviews with AI descriptions of children's artwork and\nmulti-sensory design probes, we found that BLV family members value artwork\nengagement as a bonding opportunity, preferring the child's storytelling and\ninterpretation over other nonvisual representations. Additionally, despite some\ninaccuracies, BLV family members felt that AI-generated descriptions could\nfacilitate dialogue with their children and aid self-guided art discovery. We\nclose with specific design considerations for supporting artwork engagement in\nmixed visual-ability families, including enabling artwork access through\nvarious methods, supporting children's corrections of AI output, and\ndistinctions in context vs. content and interpretation vs. description of\nchildren's artwork.",
        "updated": "2024-07-26 17:08:53 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.18874v1"
    },
    {
        "title": "Design Frictions on Social Media: Balancing Reduced Mindless Scrolling and User Satisfaction",
        "authors": "Nicolas RuizGrabriela Molina LeónHendrik Heuer",
        "links": "http://arxiv.org/abs/2407.18803v1",
        "entry_id": "http://arxiv.org/abs/2407.18803v1",
        "pdf_url": "http://arxiv.org/pdf/2407.18803v1",
        "summary": "Design features of social media platforms, such as infinite scroll, increase\nusers' likelihood of experiencing normative dissociation -- a mental state of\nabsorption that diminishes self-awareness and disrupts memory. This paper\ninvestigates how adding design frictions into the interface of a social media\nplatform reduce mindless scrolling and user satisfaction. We conducted a study\nwith 30 participants and compared their memory recognition of posts in two\nscenarios: one where participants had to react to each post to access further\ncontent and another using an infinite scroll design. Participants who used the\ndesign frictions interface exhibited significantly better content recall,\nalthough a majority of participants found the interface frustrating. We discuss\ndesign recommendations and scenarios where adding design frictions to social\nmedia platforms can be beneficial.",
        "updated": "2024-07-26 15:07:01 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.18803v1"
    },
    {
        "title": "TAGIFY: LLM-powered Tagging Interface for Improved Data Findability on OGD portals",
        "authors": "Kevin KliimaskAnastasija Nikiforova",
        "links": "http://arxiv.org/abs/2407.18764v1",
        "entry_id": "http://arxiv.org/abs/2407.18764v1",
        "pdf_url": "http://arxiv.org/pdf/2407.18764v1",
        "summary": "Efforts directed towards promoting Open Government Data (OGD) have gained\nsignificant traction across various governmental tiers since the mid-2000s. As\nmore datasets are published on OGD portals, finding specific data becomes\nharder, leading to information overload. Complete and accurate documentation of\ndatasets, including association of proper tags with datasets is key to\nimproving dataset findability and accessibility. Analysis conducted on the\nEstonian Open Data Portal, revealed that 11% datasets have no associated tags,\nwhile 26% had only one tag assigned to them, which underscores challenges in\ndata findability and accessibility within the portal, which, according to the\nrecent Open Data Maturity Report, is considered trend-setter. The aim of this\nstudy is to propose an automated solution to tagging datasets to improve data\nfindability on OGD portals. This paper presents Tagify - a prototype of tagging\ninterface that employs large language models (LLM) such as GPT-3.5-turbo and\nGPT-4 to automate dataset tagging, generating tags for datasets in English and\nEstonian, thereby augmenting metadata preparation by data publishers and\nimproving data findability on OGD portals by data users. The developed solution\nwas evaluated by users and their feedback was collected to define an agenda for\nfuture prototype improvements.",
        "updated": "2024-07-26 14:22:30 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.18764v1"
    },
    {
        "title": "Who Let the Guards Out: Visual Support for Patrolling Games",
        "authors": "Matěj LangAdam ŠtěpánekRóbert ZvaraVojtěch ŘehákBarbora Kozlíková",
        "links": "http://arxiv.org/abs/2407.18705v1",
        "entry_id": "http://arxiv.org/abs/2407.18705v1",
        "pdf_url": "http://arxiv.org/pdf/2407.18705v1",
        "summary": "Effective security patrol management is critical for ensuring safety in\ndiverse environments such as art galleries, airports, and factories. The\nbehavior of patrols in these situations can be modeled by patrolling games.\nThey simulate the behavior of the patrol and adversary in the building, which\nis modeled as a graph of interconnected nodes representing rooms. The designers\nof algorithms solving the game face the problem of analyzing complex graph\nlayouts with temporal dependencies. Therefore, appropriate visual support is\ncrucial for them to work effectively. In this paper, we present a novel tool\nthat helps the designers of patrolling games explore the outcomes of the\nproposed algorithms and approaches, evaluate their success rate, and propose\nmodifications that can improve their solutions. Our tool offers an intuitive\nand interactive interface, featuring a detailed exploration of patrol routes\nand probabilities of taking them, simulation of patrols, and other requested\nfeatures. In close collaboration with experts in designing patrolling games, we\nconducted three case studies demonstrating the usage and usefulness of our\ntool. The prototype of the tool, along with exemplary datasets, is available at\nhttps://gitlab.fi.muni.cz/formela/strategy-vizualizer.",
        "updated": "2024-07-26 12:41:34 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.18705v1"
    }
]