[
    {
        "title": "Mechanism Design for Locating Facilities with Capacities with Insufficient Resources",
        "authors": "Gennaro AuricchioHarry J. CloughJie Zhang",
        "links": "http://arxiv.org/abs/2407.18547v1",
        "entry_id": "http://arxiv.org/abs/2407.18547v1",
        "pdf_url": "http://arxiv.org/pdf/2407.18547v1",
        "summary": "This paper explores the Mechanism Design aspects of the $m$-Capacitated\nFacility Location Problem where the total facility capacity is less than the\nnumber of agents. Following the framework outlined by Aziz et al., the Social\nWelfare of the facility location is determined through a\nFirst-Come-First-Served (FCFS) game, in which agents compete once the facility\npositions are established. When the number of facilities is $m > 1$, the Nash\nEquilibrium (NE) of the FCFS game is not unique, making the utility of the\nagents and the concept of truthfulness unclear. To tackle these issues, we\nconsider absolutely truthful mechanisms, i.e. mechanisms that prevent agents\nfrom misreporting regardless of the strategies used during the FCFS game. We\ncombine this stricter truthfulness requirement with the notion of Equilibrium\nStable (ES) mechanisms, which are mechanisms whose Social Welfare does not\ndepend on the NE of the FCFS game. We demonstrate that the class of percentile\nmechanisms is absolutely truthful and identify the conditions under which they\nare ES. We also show that the approximation ratio of each ES percentile\nmechanism is bounded and determine its value. Notably, when all the facilities\nhave the same capacity and the number of agents is sufficiently large, it is\npossible to achieve an approximation ratio smaller than $1+\\frac{1}{2m-1}$.\nFinally, we extend our study to encompass higher-dimensional problems. Within\nthis framework, we demonstrate that the class of ES percentile mechanisms is\neven more restricted and characterize the mechanisms that are both ES and\nabsolutely truthful. We further support our findings by empirically evaluating\nthe performance of the mechanisms when the agents are the samples of a\ndistribution.",
        "updated": "2024-07-26 06:55:26 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.18547v1"
    },
    {
        "title": "Socially efficient mechanism on the minimum budget",
        "authors": "Hirota KinoshitaTakayuki OsogamiKohei Miyaguchi",
        "links": "http://arxiv.org/abs/2407.18515v1",
        "entry_id": "http://arxiv.org/abs/2407.18515v1",
        "pdf_url": "http://arxiv.org/pdf/2407.18515v1",
        "summary": "In social decision-making among strategic agents, a universal focus lies on\nthe balance between social and individual interests. Socially efficient\nmechanisms are thus desirably designed to not only maximize the social welfare\nbut also incentivize the agents for their own profit. Under a generalized model\nthat includes applications such as double auctions and trading networks, this\nstudy establishes a socially efficient (SE), dominant-strategy incentive\ncompatible (DSIC), and individually rational (IR) mechanism with the minimum\ntotal budget expensed to the agents. The present method exploits discrete and\nknown type domains to reduce a set of constraints into the shortest path\nproblem in a weighted graph. In addition to theoretical derivation, we\nsubstantiate the optimality of the proposed mechanism through numerical\nexperiments, where it certifies strictly lower budget than\nVickery-Clarke-Groves (VCG) mechanisms for a wide class of instances.",
        "updated": "2024-07-26 05:00:19 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.18515v1"
    },
    {
        "title": "Strategic Cost Selection in Participatory Budgeting",
        "authors": "Piotr FaliszewskiŁukasz JaneczkoAndrzej KaczmarczykGrzegorz LisowskiPiotr SkowronStanisław Szufa",
        "links": "http://arxiv.org/abs/2407.18092v1",
        "entry_id": "http://arxiv.org/abs/2407.18092v1",
        "pdf_url": "http://arxiv.org/pdf/2407.18092v1",
        "summary": "We study strategic behavior of project proposers in the context of\napproval-based participatory budgeting (PB). In our model we assume that the\nvotes are fixed and known and the proposers want to set as high project prices\nas possible, provided that their projects get selected and the prices are not\nbelow the minimum costs of their delivery. We study the existence of pure Nash\nequilibria (NE) in such games, focusing on the AV/Cost, Phragm\\'en, and Method\nof Equal Shares rules. Furthermore, we report an experimental study of\nstrategic cost selection on real-life PB election data.",
        "updated": "2024-07-25 15:00:12 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.18092v1"
    },
    {
        "title": "Principal-Agent Reinforcement Learning",
        "authors": "Dima IvanovPaul DüttingInbal Talgam-CohenTonghan WangDavid C. Parkes",
        "links": "http://arxiv.org/abs/2407.18074v1",
        "entry_id": "http://arxiv.org/abs/2407.18074v1",
        "pdf_url": "http://arxiv.org/pdf/2407.18074v1",
        "summary": "Contracts are the economic framework which allows a principal to delegate a\ntask to an agent -- despite misaligned interests, and even without directly\nobserving the agent's actions. In many modern reinforcement learning settings,\nself-interested agents learn to perform a multi-stage task delegated to them by\na principal. We explore the significant potential of utilizing contracts to\nincentivize the agents. We model the delegated task as an MDP, and study a\nstochastic game between the principal and agent where the principal learns what\ncontracts to use, and the agent learns an MDP policy in response. We present a\nlearning-based algorithm for optimizing the principal's contracts, which\nprovably converges to the subgame-perfect equilibrium of the principal-agent\ngame. A deep RL implementation allows us to apply our method to very large MDPs\nwith unknown transition dynamics. We extend our approach to multiple agents,\nand demonstrate its relevance to resolving a canonical sequential social\ndilemma with minimal intervention to agent rewards.",
        "updated": "2024-07-25 14:28:58 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.18074v1"
    },
    {
        "title": "Stochastic Games with Minimally Bounded Action Costs",
        "authors": "David Mguni",
        "links": "http://arxiv.org/abs/2407.18010v1",
        "entry_id": "http://arxiv.org/abs/2407.18010v1",
        "pdf_url": "http://arxiv.org/pdf/2407.18010v1",
        "summary": "In many multi-player interactions, players incur strictly positive costs each\ntime they execute actions e.g. 'menu costs' or transaction costs in financial\nsystems. Since acting at each available opportunity would accumulate\nprohibitively large costs, the resulting decision problem is one in which\nplayers must make strategic decisions about when to execute actions in addition\nto their choice of action. This paper analyses a discrete-time stochastic game\n(SG) in which players face minimally bounded positive costs for each action and\ninfluence the system using impulse controls. We prove SGs of two-sided impulse\ncontrol have a unique value and characterise the saddle point equilibrium in\nwhich the players execute actions at strategically chosen times in accordance\nwith Markovian strategies. We prove the game respects a dynamic programming\nprinciple and that the Markov perfect equilibrium can be computed as a limit\npoint of a sequence of Bellman operations. We then introduce a new Q-learning\nvariant which we show converges almost surely to the value of the game enabling\nsolutions to be extracted in unknown settings. Lastly, we extend our results to\nsettings with budgetory constraints.",
        "updated": "2024-07-25 13:04:49 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.18010v1"
    }
]