[
    {
        "title": "Improved Consensus ADMM for Cooperative Motion Planning of Large-Scale Connected Autonomous Vehicles with Limited Communication",
        "authors": "Haichao LiuZhenmin HuangZicheng ZhuYulin LiShaojie ShenJun Ma",
        "links": "http://arxiv.org/abs/2401.09032v1",
        "entry_id": "http://arxiv.org/abs/2401.09032v1",
        "pdf_url": "http://arxiv.org/pdf/2401.09032v1",
        "summary": "This paper investigates a cooperative motion planning problem for large-scale\nconnected autonomous vehicles (CAVs) under limited communications, which\naddresses the challenges of high communication and computing resource\nrequirements. Our proposed methodology incorporates a parallel optimization\nalgorithm with improved consensus ADMM considering a more realistic locally\nconnected topology network, and time complexity of O(N) is achieved by\nexploiting the sparsity in the dual update process. To further enhance the\ncomputational efficiency, we employ a lightweight evolution strategy for the\ndynamic connectivity graph of CAVs, and each sub-problem split from the\nconsensus ADMM only requires managing a small group of CAVs. The proposed\nmethod implemented with the receding horizon scheme is validated thoroughly,\nand comparisons with existing numerical solvers and approaches demonstrate the\nefficiency of our proposed algorithm. Also, simulations on large-scale\ncooperative driving tasks involving 80 vehicles are performed in the\nhigh-fidelity CARLA simulator, which highlights the remarkable computational\nefficiency, scalability, and effectiveness of our proposed development.\nDemonstration videos are available at\nhttps://henryhcliu.github.io/icadmm_cmp_carla.",
        "updated": "2024-01-17 07:58:48 UTC",
        "id": 1
    },
    {
        "title": "Data assimilation approach for addressing imperfections in people flow measurement techniques using particle filter",
        "authors": "Ryo MurataKenji Tanaka",
        "links": "http://arxiv.org/abs/2401.09014v1",
        "entry_id": "http://arxiv.org/abs/2401.09014v1",
        "pdf_url": "http://arxiv.org/pdf/2401.09014v1",
        "summary": "Understanding and predicting people flow in urban areas is useful for\ndecision-making in urban planning and marketing strategies. Traditional methods\nfor understanding people flow can be divided into measurement-based approaches\nand simulation-based approaches. Measurement-based approaches have the\nadvantage of directly capturing actual people flow, but they face the challenge\nof data imperfection. On the other hand, simulations can obtain complete data\non a computer, but they only consider some of the factors determining human\nbehavior, leading to a divergence from actual people flow. Both measurement and\nsimulation methods have unresolved issues, and combining the two can\ncomplementarily overcome them. This paper proposes a method that applies data\nassimilation, a fusion technique of measurement and simulation, to agent-based\nsimulation. Data assimilation combines the advantages of both measurement and\nsimulation, contributing to the creation of an environment that can reflect\nreal people flow while acquiring richer data. The paper verifies the\neffectiveness of the proposed method in a virtual environment and demonstrates\nthe potential of data assimilation to compensate for the three types of\nimperfection in people flow measurement techniques. These findings can serve as\nguidelines for supplementing sparse measurement data in physical environments.",
        "updated": "2024-01-17 07:20:15 UTC",
        "id": 2
    },
    {
        "title": "AgentMixer: Multi-Agent Correlated Policy Factorization",
        "authors": "Zhiyuan LiWenshuai ZhaoLijun WuJoni Pajarinen",
        "links": "http://arxiv.org/abs/2401.08728v1",
        "entry_id": "http://arxiv.org/abs/2401.08728v1",
        "pdf_url": "http://arxiv.org/pdf/2401.08728v1",
        "summary": "Centralized training with decentralized execution (CTDE) is widely employed\nto stabilize partially observable multi-agent reinforcement learning (MARL) by\nutilizing a centralized value function during training. However, existing\nmethods typically assume that agents make decisions based on their local\nobservations independently, which may not lead to a correlated joint policy\nwith sufficient coordination. Inspired by the concept of correlated\nequilibrium, we propose to introduce a \\textit{strategy modification} to\nprovide a mechanism for agents to correlate their policies. Specifically, we\npresent a novel framework, AgentMixer, which constructs the joint fully\nobservable policy as a non-linear combination of individual partially\nobservable policies. To enable decentralized execution, one can derive\nindividual policies by imitating the joint policy. Unfortunately, such\nimitation learning can lead to \\textit{asymmetric learning failure} caused by\nthe mismatch between joint policy and individual policy information. To\nmitigate this issue, we jointly train the joint policy and individual policies\nand introduce \\textit{Individual-Global-Consistency} to guarantee mode\nconsistency between the centralized and decentralized policies. We then\ntheoretically prove that AgentMixer converges to an $\\epsilon$-approximate\nCorrelated Equilibrium. The strong experimental performance on three MARL\nbenchmarks demonstrates the effectiveness of our method.",
        "updated": "2024-01-16 15:32:41 UTC",
        "id": 3
    },
    {
        "title": "A Day-to-Day Dynamical Approach to the Most Likely User Equilibrium Problem",
        "authors": "Jiayang LiQianni WangLiyang FengJun XieYu Marco Nie",
        "links": "http://arxiv.org/abs/2401.08013v1",
        "entry_id": "http://arxiv.org/abs/2401.08013v1",
        "pdf_url": "http://arxiv.org/pdf/2401.08013v1",
        "summary": "The lack of a unique user equilibrium (UE) route flow in traffic assignment\nhas posed a significant challenge to many transportation applications. The\nmaximum-entropy principle, which advocates for the consistent selection of the\nmost likely solution as a representative, is often used to address the\nchallenge. Built on a recently proposed day-to-day (DTD) discrete-time\ndynamical model called cumulative logit (CULO), this study provides a new\nbehavioral underpinning for the maximum-entropy UE (MEUE) route flow. It has\nbeen proven that CULO can reach a UE state without presuming travelers are\nperfectly rational. Here, we further establish that CULO always converges to\nthe MEUE route flow if (i) travelers have zero prior information about routes\nand thus are forced to give all routes an equal choice probability, or (ii) all\ntravelers gather information from the same source such that the so-called\ngeneral proportionality condition is satisfied. Thus, CULO may be used as a\npractical solution algorithm for the MEUE problem. To put this idea into\npractice, we propose to eliminate the route enumeration requirement of the\noriginal CULO model through an iterative route discovery scheme. We also\nexamine the discrete-time versions of four popular continuous-time dynamical\nmodels and compare them to CULO. The analysis shows that the replicator dynamic\nis the only one that has the potential to reach the MEUE solution with some\nregularity. The analytical results are confirmed through numerical experiments.",
        "updated": "2024-01-15 23:43:41 UTC",
        "id": 4
    },
    {
        "title": "Emergency Localization for Mobile Ground Users: An Adaptive UAV Trajectory Planning Method",
        "authors": "Zhihao ZhuJiafan HeLuyang HouLianming XuWendi ZhuLi Wang",
        "links": "http://arxiv.org/abs/2401.07256v1",
        "entry_id": "http://arxiv.org/abs/2401.07256v1",
        "pdf_url": "http://arxiv.org/pdf/2401.07256v1",
        "summary": "In emergency search and rescue scenarios, the quick location of trapped\npeople is essential. However, disasters can render the Global Positioning\nSystem (GPS) unusable. Unmanned aerial vehicles (UAVs) with localization\ndevices can serve as mobile anchors due to their agility and high line-of-sight\n(LoS) probability. Nonetheless, the number of available UAVs during the initial\nstages of disaster relief is limited, and innovative methods are needed to\nquickly plan UAV trajectories to locate non-uniformly distributed dynamic\ntargets while ensuring localization accuracy. To address this challenge, we\ndesign a single UAV localization method without hovering, use the maximum\nlikelihood estimation (MLE) method to estimate the location of mobile users and\ndefine the upper bound of the localization error by considering users'\nmovement.Combining this localization method and localization error-index, we\nutilize the enhanced particle swarm optimization (EPSO) algorithm and edge\naccess strategy to develop a low complexity localization-oriented adaptive\ntrajectory planning algorithm. Simulation results demonstrate that our method\noutperforms other baseline algorithms, enabling faster localization without\ncompromising localization accuracy.",
        "updated": "2024-01-14 11:20:20 UTC",
        "id": 5
    }
]