[
    {
        "title": "Design and Realization of a Benchmarking Testbed for Evaluating Autonomous Platooning Algorithms",
        "authors": "Michael ShahamRisha RanjanEngin KirdaTaskin Padir",
        "links": "http://arxiv.org/abs/2402.09233v1",
        "entry_id": "http://arxiv.org/abs/2402.09233v1",
        "pdf_url": "http://arxiv.org/pdf/2402.09233v1",
        "summary": "Autonomous vehicle platoons present near- and long-term opportunities to\nenhance operational efficiencies and save lives. The past 30 years have seen\nrapid development in the autonomous driving space, enabling new technologies\nthat will alleviate the strain placed on human drivers and reduce vehicle\nemissions. This paper introduces a testbed for evaluating and benchmarking\nplatooning algorithms on 1/10th scale vehicles with onboard sensors. To\ndemonstrate the testbed's utility, we evaluate three algorithms, linear\nfeedback and two variations of distributed model predictive control, and\ncompare their results on a typical platooning scenario where the lead vehicle\ntracks a reference trajectory that changes speed multiple times. We validate\nour algorithms in simulation to analyze the performance as the platoon size\nincreases, and find that the distributed model predictive control algorithms\noutperform linear feedback on hardware and in simulation.",
        "updated": "2024-02-14 15:22:24 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.09233v1"
    },
    {
        "title": "Time preference, wealth and utility inequality: A microeconomic interaction and dynamic macroeconomic model connection approach",
        "authors": "Takeshi Kato",
        "links": "http://arxiv.org/abs/2402.08905v1",
        "entry_id": "http://arxiv.org/abs/2402.08905v1",
        "pdf_url": "http://arxiv.org/pdf/2402.08905v1",
        "summary": "Based on interactions between individuals and others and references to social\nnorms, this study reveals the impact of heterogeneity in time preference on\nwealth distribution and inequality. We present a novel approach that connects\nthe interactions between microeconomic agents that generate heterogeneity to\nthe dynamic equations for capital and consumption in macroeconomic models.\nUsing this approach, we estimate the impact of changes in the discount rate due\nto microeconomic interactions on capital, consumption and utility and the\ndegree of inequality. The results show that intercomparisons with others\nregarding consumption significantly affect capital, i.e. wealth inequality.\nFurthermore, the impact on utility is never small and social norms can reduce\nthis impact. Our supporting evidence shows that the quantitative results of\ninequality calculations correspond to survey data from cohort and\ncross-cultural studies. This study's micro-macro connection approach can be\ndeployed to connect microeconomic interactions, such as exchange, interest and\ndebt, redistribution, mutual aid and time preference, to dynamic macroeconomic\nmodels.",
        "updated": "2024-02-14 02:41:36 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.08905v1"
    },
    {
        "title": "Auto-Encoding Bayesian Inverse Games",
        "authors": "Xinjie LiuLasse PetersJavier Alonso-MoraUfuk TopcuDavid Fridovich-Keil",
        "links": "http://arxiv.org/abs/2402.08902v1",
        "entry_id": "http://arxiv.org/abs/2402.08902v1",
        "pdf_url": "http://arxiv.org/pdf/2402.08902v1",
        "summary": "When multiple agents interact in a common environment, each agent's actions\nimpact others' future decisions, and noncooperative dynamic games naturally\ncapture this coupling. In interactive motion planning, however, agents\ntypically do not have access to a complete model of the game, e.g., due to\nunknown objectives of other players. Therefore, we consider the inverse game\nproblem, in which some properties of the game are unknown a priori and must be\ninferred from observations. Existing maximum likelihood estimation (MLE)\napproaches to solve inverse games provide only point estimates of unknown\nparameters without quantifying uncertainty, and perform poorly when many\nparameter values explain the observed behavior. To address these limitations,\nwe take a Bayesian perspective and construct posterior distributions of game\nparameters. To render inference tractable, we employ a variational autoencoder\n(VAE) with an embedded differentiable game solver. This structured VAE can be\ntrained from an unlabeled dataset of observed interactions, naturally handles\ncontinuous, multi-modal distributions, and supports efficient sampling from the\ninferred posteriors without computing game solutions at runtime. Extensive\nevaluations in simulated driving scenarios demonstrate that the proposed\napproach successfully learns the prior and posterior objective distributions,\nprovides more accurate objective estimates than MLE baselines, and facilitates\nsafer and more efficient game-theoretic motion planning.",
        "updated": "2024-02-14 02:17:37 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.08902v1"
    },
    {
        "title": "Strategic Contract Negotiation in Financial Networks",
        "authors": "Akhil JalanDeepayan Chakrabarti",
        "links": "http://arxiv.org/abs/2402.08779v1",
        "entry_id": "http://arxiv.org/abs/2402.08779v1",
        "pdf_url": "http://arxiv.org/pdf/2402.08779v1",
        "summary": "How can firms optimally negotiate bilateral contracts with each other in a\nfinancial network? Every firm seeks to maximize the utility it gains from its\nportfolio of contracts. We focus on mean-variance utilities, where each firm\nhas its own beliefs about the expected returns of the contracts and the\ncovariances between them (Markowitz, J. Finance 7(11), 1952). Instead of\nrevealing these beliefs, a firm may adopt a different negotiating position,\nseeking better contract terms. We formulate a contract negotiation process by\nwhich such strategic behavior leads to a network of contracts. In our\nformulation, any subset of firms can be strategic. The negotiating positions of\nthese firms can form Nash equilibria, where each firm's position is optimal\ngiven the others' positions.\n  We give a polynomial-time algorithm to find the Nash equilibria, if they\nexist, and certify their nonexistence otherwise. We explore the implications of\nsuch equilibria on several model networks. These illustrate that firms'\nutilities can be sensitive to their negotiating position. We then propose trade\ndeadlines as a mechanism to reduce the need for strategic behavior. At the\ndeadline, each firm can unilaterally cancel some or all of its contracts, for a\npenalty. In our model networks, we show that trade deadlines can reduce the\nloss of utility from being honest. We empirically verify our insights using\ndata on international trade between 46 large economies.",
        "updated": "2024-02-13 20:23:19 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.08779v1"
    },
    {
        "title": "Optimal Task Assignment and Path Planning using Conflict-Based Search with Precedence and Temporal Constraints",
        "authors": "Yu Quan ChongJiaoyang LiKatia Sycara",
        "links": "http://arxiv.org/abs/2402.08772v1",
        "entry_id": "http://arxiv.org/abs/2402.08772v1",
        "pdf_url": "http://arxiv.org/pdf/2402.08772v1",
        "summary": "The Multi-Agent Path Finding (MAPF) problem entails finding collision-free\npaths for a set of agents, guiding them from their start to goal locations.\nHowever, MAPF does not account for several practical task-related constraints.\nFor example, agents may need to perform actions at goal locations with specific\nexecution times, adhering to predetermined orders and timeframes. Moreover,\ngoal assignments may not be predefined for agents, and the optimization\nobjective may lack an explicit definition. To incorporate task assignment, path\nplanning, and a user-defined objective into a coherent framework, this paper\nexamines the Task Assignment and Path Finding with Precedence and Temporal\nConstraints (TAPF-PTC) problem. We augment Conflict-Based Search (CBS) to\nsimultaneously generate task assignments and collision-free paths that adhere\nto precedence and temporal constraints, maximizing an objective quantified by\nthe return from a user-defined reward function in reinforcement learning (RL).\nExperimentally, we demonstrate that our algorithm, CBS-TA-PTC, can solve highly\nchallenging bomb-defusing tasks with precedence and temporal constraints\nefficiently relative to MARL and adapted Target Assignment and Path Finding\n(TAPF) methods.",
        "updated": "2024-02-13 20:07:58 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.08772v1"
    }
]