[
    {
        "title": "Aligning Cyber Space with Physical World: A Comprehensive Survey on Embodied AI",
        "authors": "Yang LiuWeixing ChenYongjie BaiJingzhou LuoXinshuai SongKaixuan JiangZhida LiGanlong ZhaoJunyi LinGuanbin LiWen GaoLiang Lin",
        "links": "http://arxiv.org/abs/2407.06886v1",
        "entry_id": "http://arxiv.org/abs/2407.06886v1",
        "pdf_url": "http://arxiv.org/pdf/2407.06886v1",
        "summary": "Embodied Artificial Intelligence (Embodied AI) is crucial for achieving\nArtificial General Intelligence (AGI) and serves as a foundation for various\napplications that bridge cyberspace and the physical world. Recently, the\nemergence of Multi-modal Large Models (MLMs) and World Models (WMs) have\nattracted significant attention due to their remarkable perception,\ninteraction, and reasoning capabilities, making them a promising architecture\nfor the brain of embodied agents. However, there is no comprehensive survey for\nEmbodied AI in the era of MLMs. In this survey, we give a comprehensive\nexploration of the latest advancements in Embodied AI. Our analysis firstly\nnavigates through the forefront of representative works of embodied robots and\nsimulators, to fully understand the research focuses and their limitations.\nThen, we analyze four main research targets: 1) embodied perception, 2)\nembodied interaction, 3) embodied agent, and 4) sim-to-real adaptation,\ncovering the state-of-the-art methods, essential paradigms, and comprehensive\ndatasets. Additionally, we explore the complexities of MLMs in virtual and real\nembodied agents, highlighting their significance in facilitating interactions\nin dynamic digital and physical environments. Finally, we summarize the\nchallenges and limitations of embodied AI and discuss their potential future\ndirections. We hope this survey will serve as a foundational reference for the\nresearch community and inspire continued innovation. The associated project can\nbe found at https://github.com/HCPLab-SYSU/Embodied_AI_Paper_List.",
        "updated": "2024-07-09 14:14:47 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.06886v1"
    },
    {
        "title": "Richelieu: Self-Evolving LLM-Based Agents for AI Diplomacy",
        "authors": "Zhenyu GuanXiangyu KongFangwei ZhongYizhou Wang",
        "links": "http://arxiv.org/abs/2407.06813v1",
        "entry_id": "http://arxiv.org/abs/2407.06813v1",
        "pdf_url": "http://arxiv.org/pdf/2407.06813v1",
        "summary": "Diplomacy is one of the most sophisticated activities in human society. The\ncomplex interactions among multiple parties/ agents involve various abilities\nlike social reasoning, negotiation arts, and long-term strategy planning.\nPrevious AI agents surely have proved their capability of handling multi-step\ngames and larger action spaces on tasks involving multiple agents. However,\ndiplomacy involves a staggering magnitude of decision spaces, especially\nconsidering the negotiation stage required. Recently, LLM agents have shown\ntheir potential for extending the boundary of previous agents on a couple of\napplications, however, it is still not enough to handle a very long planning\nperiod in a complex multi-agent environment. Empowered with cutting-edge LLM\ntechnology, we make the first stab to explore AI's upper bound towards a\nhuman-like agent for such a highly comprehensive multi-agent mission by\ncombining three core and essential capabilities for stronger LLM-based societal\nagents: 1) strategic planner with memory and reflection; 2) goal-oriented\nnegotiate with social reasoning; 3) augmenting memory by self-play games to\nself-evolving without any human in the loop.",
        "updated": "2024-07-09 12:37:54 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.06813v1"
    },
    {
        "title": "Fast Distributed Optimization over Directed Graphs under Malicious Attacks using Trust",
        "authors": "Arif Kerem DayıOrhan Eren AkgünStephanie GilMichal YeminiAngelia Nedić",
        "links": "http://arxiv.org/abs/2407.06541v1",
        "entry_id": "http://arxiv.org/abs/2407.06541v1",
        "pdf_url": "http://arxiv.org/pdf/2407.06541v1",
        "summary": "In this work, we introduce the Resilient Projected Push-Pull (RP3) algorithm\ndesigned for distributed optimization in multi-agent cyber-physical systems\nwith directed communication graphs and the presence of malicious agents. Our\nalgorithm leverages stochastic inter-agent trust values and gradient tracking\nto achieve geometric convergence rates in expectation even in adversarial\nenvironments. We introduce growing constraint sets to limit the impact of the\nmalicious agents without compromising the geometric convergence rate of the\nalgorithm. We prove that RP3 converges to the nominal optimal solution almost\nsurely and in the $r$-th mean for any $r\\geq 1$, provided the step sizes are\nsufficiently small and the constraint sets are appropriately chosen. We\nvalidate our approach with numerical studies on average consensus and\nmulti-robot target tracking problems, demonstrating that RP3 effectively\nmitigates the impact of malicious agents and achieves the desired geometric\nconvergence.",
        "updated": "2024-07-09 04:22:35 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.06541v1"
    },
    {
        "title": "Analysis of Robotic System Models Through Property Inheritance from Petri Net Meta-models",
        "authors": "Maksym FigatCezary Zieliński",
        "links": "http://arxiv.org/abs/2407.06454v1",
        "entry_id": "http://arxiv.org/abs/2407.06454v1",
        "pdf_url": "http://arxiv.org/pdf/2407.06454v1",
        "summary": "This article investigates the analysis of robotic system models using the\nRobotic System Hierarchic Petri Net (RSHPN) meta-model, proposing streamlined\nmethods by focusing on significant system fragments and inheriting properties\nfrom the meta-model. Our research demonstrates that it is feasible to: 1)\neffectively analyze complex robotic systems expressed using RSHPN, and 2)\nenable models to inherit properties from the meta-model. This approach\nsignificantly simplifies the analysis process, reduces design time, and ensures\nthe safety and reliability of the systems. These aspects are crucial for robots\noperating in human environments. Our results suggest that Petri nets could be\nfurther explored as a useful tool for the formal description and in-depth\nanalysis of the properties of robotic systems.",
        "updated": "2024-07-08 23:35:36 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.06454v1"
    },
    {
        "title": "DebUnc: Mitigating Hallucinations in Large Language Model Agent Communication with Uncertainty Estimations",
        "authors": "Luke YoffeAlfonso AmayuelasWilliam Yang Wang",
        "links": "http://arxiv.org/abs/2407.06426v1",
        "entry_id": "http://arxiv.org/abs/2407.06426v1",
        "pdf_url": "http://arxiv.org/pdf/2407.06426v1",
        "summary": "To enhance Large Language Model (LLM) capabilities, multi-agent debates have\nbeen introduced, where multiple LLMs discuss solutions to a problem over\nseveral rounds of debate. However, LLMs often produce incorrect responses that\nappear deceptively confident, which can mislead other agents. This is partly\nbecause agents do not express their confidence levels during standard debates.\nTo address this, we introduce DebUnc, a multi-agent debate framework that uses\nuncertainty metrics to assess agent confidence levels. We adapted the LLM\nattention mechanism to adjust token weights based on confidence levels and also\nexplored using textual prompts to convey confidence. Our evaluations across\nvarious benchmarks show that attention-based methods are particularly\neffective, and that as uncertainty metrics evolve, performance will continue to\nincrease. The code is available at https://github.com/lukeyoffe/debunc",
        "updated": "2024-07-08 22:15:01 UTC",
        "interpretation": "解释内容未找到",
        "id": "2407.06426v1"
    }
]