[
    {
        "title": "Investigating Persuasive Socially Assistive Robot Behavior Strategies for Sustained Engagement in Long-Term Care",
        "authors": "Cristina GetsonGoldie Nejat",
        "links": "http://arxiv.org/abs/2408.14322v1",
        "entry_id": "http://arxiv.org/abs/2408.14322v1",
        "pdf_url": "http://arxiv.org/pdf/2408.14322v1",
        "summary": "Socially assistive robots are increasingly being used to support the social,\ncognitive, and physical well-being of those who provide care (healthcare\nprofessionals) and those in need of care (older adults). However, the\neffectiveness of persuasive socially assistive robot behaviors and their impact\non the sustained motivation of older adults is still not well understood. This\nextended abstract describes our prior human-robot interaction study on\ninvestigating the effectiveness of persuasive social robot behaviors with care\nproviders, followed by our current research assessing the impact of these\npersuasive robot behaviors on the well-being of older adults in long-term care.\nThe findings provide insights into engagement and sustained motivation of older\nadults when providing assistance.",
        "updated": "2024-08-26 14:51:49 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.14322v1"
    },
    {
        "title": "Collaborative XRTactics: A Formative Study on Tactical Communication in Outdoor Team Sports",
        "authors": "Ut GongQihan ZhangZiqing YinStefanie Zollmann",
        "links": "http://arxiv.org/abs/2408.14305v1",
        "entry_id": "http://arxiv.org/abs/2408.14305v1",
        "pdf_url": "http://arxiv.org/pdf/2408.14305v1",
        "summary": "In team sports, effective tactical communication is crucial for success,\nparticularly in the fast-paced and complex environment of outdoor athletics.\nThis paper investigates the challenges faced in transmitting strategic plans to\nplayers and explores potential solutions using eXtended Reality (XR)\ntechnologies. We conducted a formative study involving interviews with 4\nDivision I professional soccer coaches, 4 professional players, 2 college club\ncoaches, and 2 college club players, as well as a survey among 17 Division I\nplayers. The study identified key requirements for tactical communication\ntools, including the need for rapid communication, minimal disruption to game\nflow, reduced cognitive load, clear visualization for all players, and enhanced\nauditory clarity. Based on these insights, we propose a potential solution - a\nMobile Augmented Reality (AR) system designed to address these challenges by\nproviding real-time, intuitive tactical visualization and communication. The\nsystem aims to improve strategic planning and execution, thereby enhancing team\nperformance and cohesion. This work represents a significant step towards\nintegrating XR technologies into sports coaching, offering a modern and\npractical solution for real-time tactical communication.",
        "updated": "2024-08-26 14:37:16 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.14305v1"
    },
    {
        "title": "\"Hi. I'm Molly, Your Virtual Interviewer!\" -- Exploring the Impact of Race and Gender in AI-powered Virtual Interview Experiences",
        "authors": "Shreyan BiswasJi-Youn JungAbhishek UnnamKuldeep YadavShreyansh GuptaUjwal Gadiraju",
        "links": "http://arxiv.org/abs/2408.14159v1",
        "entry_id": "http://arxiv.org/abs/2408.14159v1",
        "pdf_url": "http://arxiv.org/pdf/2408.14159v1",
        "summary": "The persistent issue of human bias in recruitment processes poses a\nformidable challenge to achieving equitable hiring practices, particularly when\ninfluenced by demographic characteristics such as gender and race of both\ninterviewers and candidates. Asynchronous Video Interviews (AVIs), powered by\nArtificial Intelligence (AI), have emerged as innovative tools aimed at\nstreamlining the application screening process while potentially mitigating the\nimpact of such biases. These AI-driven platforms present an opportunity to\ncustomize the demographic features of virtual interviewers to align with\ndiverse applicant preferences, promising a more objective and fair evaluation.\nDespite their growing adoption, the implications of virtual interviewer\nidentities on candidate experiences within AVIs remain underexplored. We aim to\naddress this research and empirical gap in this paper. To this end, we carried\nout a comprehensive between-subjects study involving 218 participants across\nsix distinct experimental conditions, manipulating the gender and skin color of\nan AI virtual interviewer agent. Our empirical analysis revealed that while the\ndemographic attributes of the agents did not significantly influence the\noverall experience of interviewees, variations in the interviewees'\ndemographics significantly altered their perception of the AVI process.\nFurther, we uncovered that the mediating roles of Social Presence and\nPerception of the virtual interviewer critically affect interviewees'\nperceptions of fairness (+), privacy (-), and impression management (+).",
        "updated": "2024-08-26 10:14:07 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.14159v1"
    },
    {
        "title": "Perceived Usability of Collaborative Modeling Tools",
        "authors": "Ranci RenJohn W. CastroSantiago R. AcuñaOscar DiesteSilvia T. Acuña",
        "links": "http://dx.doi.org/10.1016/j.jss.2023.111807",
        "entry_id": "http://arxiv.org/abs/2408.14088v1",
        "pdf_url": "http://arxiv.org/pdf/2408.14088v1",
        "summary": "Context: Online collaborative creation of models is becoming commonplace.\nCollaborative modeling using chatbots and natural language may lower the\nbarriers to modeling for users from different domains. Objective: We compare\nthe perceived usability of two similarly online collaborative modeling tools,\nthe SOCIO chatbot and the Creately web-based tool. Method: We conducted a\ncrossover experiment with 66 participants. The evaluation instrument was based\non the System Usability Scale (SUS). We performed a quantitative and\nqualitative exploration, employing inferential statistics and thematic\nanalysis. Results: The results indicate that chatbots enabling natural language\ncommunication enhance communication and collaboration efficiency and improve\nthe user experience. Conclusion: Chatbots need to improve guidance and help for\nnovices, but they appear beneficial for enhancing user experience.",
        "updated": "2024-08-26 08:19:23 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.14088v1"
    },
    {
        "title": "Say Your Reason: Extract Contextual Rules In Situ for Context-aware Service Recommendation",
        "authors": "Yuxuan LiJiahui LiLihang PanChun YuYuanchun Shi",
        "links": "http://arxiv.org/abs/2408.13977v1",
        "entry_id": "http://arxiv.org/abs/2408.13977v1",
        "pdf_url": "http://arxiv.org/pdf/2408.13977v1",
        "summary": "This paper introduces SayRea, an interactive system that facilitates the\nextraction of contextual rules for personalized context-aware service\nrecommendations in mobile scenarios. The system monitors a user's execution of\nregistered services on their smartphones (via accessibility service) and\nproactively requests a single-sentence reason from the user. By utilizing a\nLarge Language Model (LLM), SayRea parses the reason and predicts contextual\nrelationships between the observed service and potential contexts (such as\nsetting the alarm clock deep in the evening). In this way, SayRea can\nsignificantly reduce the cognitive load on users in anticipating future needs\nand selecting contextual attributes. A 10-day field study involving 20\nparticipants showed that SayRea accumulated an average of 62.4 rules per user\nand successfully recommended 45% of service usage. The participants provided\npositive feedback on the system's usability, interpretability, and\ncontrollability. The findings highlight SayRea's effectiveness in personalized\nservice recommendations and its potential to enhance user experience in mobile\nscenarios.",
        "updated": "2024-08-26 01:50:29 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.13977v1"
    }
]