[
    {
        "title": "A Survey on Small-Scale Testbeds for Connected and Automated Vehicles and Robot Swarms",
        "authors": "Armin MokhtarianJianye XuPatrick ScheffeMaximilian KloockSimon SchäferHeeseung BangViet-Anh LeSangeet UlhasJohannes BetzSean WilsonSpring BermanLiam PaullAmanda ProrokBassam Alrifaee",
        "links": "http://dx.doi.org/10.13140/RG.2.2.16176.74248/1",
        "entry_id": "http://arxiv.org/abs/2408.14199v1",
        "pdf_url": "http://arxiv.org/pdf/2408.14199v1",
        "summary": "Connected and automated vehicles and robot swarms hold transformative\npotential for enhancing safety, efficiency, and sustainability in the\ntransportation and manufacturing sectors. Extensive testing and validation of\nthese technologies is crucial for their deployment in the real world. While\nsimulations are essential for initial testing, they often have limitations in\ncapturing the complex dynamics of real-world interactions. This limitation\nunderscores the importance of small-scale testbeds. These testbeds provide a\nrealistic, cost-effective, and controlled environment for testing and\nvalidating algorithms, acting as an essential intermediary between simulation\nand full-scale experiments. This work serves to facilitate researchers' efforts\nin identifying existing small-scale testbeds suitable for their experiments and\nprovide insights for those who want to build their own. In addition, it\ndelivers a comprehensive survey of the current landscape of these testbeds. We\nderive 62 characteristics of testbeds based on the well-known sense-plan-act\nparadigm and offer an online table comparing 22 small-scale testbeds based on\nthese characteristics. The online table is hosted on our designated public\nwebpage www.cpm-remote.de/testbeds, and we invite testbed creators and\ndevelopers to contribute to it. We closely examine nine testbeds in this paper,\ndemonstrating how the derived characteristics can be used to present testbeds.\nFurthermore, we discuss three ongoing challenges concerning small-scale\ntestbeds that we identified, i.e., small-scale to full-scale transition,\nsustainability, and power and resource management.",
        "updated": "2024-08-26 11:54:27 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.14199v1"
    },
    {
        "title": "Decentralized Stochastic Control in Standard Borel Spaces: Centralized MDP Reductions, Near Optimality of Finite Window Local Information, and Q-Learning",
        "authors": "Omar Mrani-ZentarSerdar Yüksel",
        "links": "http://arxiv.org/abs/2408.13828v1",
        "entry_id": "http://arxiv.org/abs/2408.13828v1",
        "pdf_url": "http://arxiv.org/pdf/2408.13828v1",
        "summary": "Decentralized stochastic control problems are intrinsically difficult to\nstudy because of the inapplicability of standard tools from centralized control\nsuch as dynamic programming and the resulting computational complexity. In this\npaper, we address some of these challenges for decentralized stochastic control\nwith Borel spaces under three different but tightly related information\nstructures under a unified theme: the one-step delayed information sharing\npattern, the K-step periodic information sharing pattern, and the completely\ndecentralized information structure where no sharing of information occurs. We\nwill show that the one-step delayed and K-step periodic problems can be reduced\nto a centralized MDP, generalizing prior results which considered finite,\nlinear, or static models, by addressing several measurability questions. The\nseparated nature of policies under both information structures is then\nestablished. We then provide sufficient conditions for the transition kernels\nof both centralized reductions to be weak-Feller, which facilitates rigorous\napproximation and learning theoretic results. We will then show that for the\ncompletely decentralized control problem finite memory local policies are near\noptimal under a joint conditional mixing condition. This is achieved by\nobtaining a bound for finite memory policies which goes to zero as memory size\nincreases. We will also provide a performance bound for the K-periodic problem,\nwhich results from replacing the full common information by a finite sliding\nwindow of information. The latter will depend on the condition of predictor\nstability in expected total variation, which we will establish. We finally show\nthat under the periodic information sharing pattern, a quantized Q-learning\nalgorithm converges asymptotically towards a near optimal solution. Each of the\nabove, to our knowledge, is a new contribution to the literature.",
        "updated": "2024-08-25 13:07:34 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.13828v1"
    },
    {
        "title": "Multi-Agent Target Assignment and Path Finding for Intelligent Warehouse: A Cooperative Multi-Agent Deep Reinforcement Learning Perspective",
        "authors": "Qi LiuJianqi GaoDongjie ZhuXizheng PangPengbin ChenJingxiang GuoYanjie Li",
        "links": "http://arxiv.org/abs/2408.13750v1",
        "entry_id": "http://arxiv.org/abs/2408.13750v1",
        "pdf_url": "http://arxiv.org/pdf/2408.13750v1",
        "summary": "Multi-agent target assignment and path planning (TAPF) are two key problems\nin intelligent warehouse. However, most literature only addresses one of these\ntwo problems separately. In this study, we propose a method to simultaneously\nsolve target assignment and path planning from a perspective of cooperative\nmulti-agent deep reinforcement learning (RL). To the best of our knowledge,\nthis is the first work to model the TAPF problem for intelligent warehouse to\ncooperative multi-agent deep RL, and the first to simultaneously address TAPF\nbased on multi-agent deep RL. Furthermore, previous literature rarely considers\nthe physical dynamics of agents. In this study, the physical dynamics of the\nagents is considered. Experimental results show that our method performs well\nin various task settings, which means that the target assignment is solved\nreasonably well and the planned path is almost shortest. Moreover, our method\nis more time-efficient than baselines.",
        "updated": "2024-08-25 07:32:58 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.13750v1"
    },
    {
        "title": "DeepVoting: Learning Voting Rules with Tailored Embeddings",
        "authors": "Leonardo MatoneBen AbramowitzNicholas MatteiAvinash Balakrishnan",
        "links": "http://arxiv.org/abs/2408.13630v1",
        "entry_id": "http://arxiv.org/abs/2408.13630v1",
        "pdf_url": "http://arxiv.org/pdf/2408.13630v1",
        "summary": "Aggregating the preferences of multiple agents into a collective decision is\na common step in many important problems across areas of computer science\nincluding information retrieval, reinforcement learning, and recommender\nsystems. As Social Choice Theory has shown, the problem of designing algorithms\nfor aggregation rules with specific properties (axioms) can be difficult, or\nprovably impossible in some cases. Instead of designing algorithms by hand, one\ncan learn aggregation rules, particularly voting rules, from data. However, the\nprior work in this area has required extremely large models, or been limited by\nthe choice of preference representation, i.e., embedding. We recast the problem\nof designing a good voting rule into one of learning probabilistic versions of\nvoting rules that output distributions over a set of candidates. Specifically,\nwe use neural networks to learn probabilistic social choice functions from the\nliterature. We show that embeddings of preference profiles derived from the\nsocial choice literature allows us to learn existing voting rules more\nefficiently and scale to larger populations of voters more easily than other\nwork if the embedding is tailored to the learning objective. Moreover, we show\nthat rules learned using embeddings can be tweaked to create novel voting rules\nwith improved axiomatic properties. Namely, we show that existing voting rules\nrequire only minor modification to combat a probabilistic version of the No\nShow Paradox.",
        "updated": "2024-08-24 17:15:20 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.13630v1"
    },
    {
        "title": "Reaching New Heights in Multi-Agent Collective Construction",
        "authors": "Martin RamešPavel Surynek",
        "links": "http://arxiv.org/abs/2408.13615v1",
        "entry_id": "http://arxiv.org/abs/2408.13615v1",
        "pdf_url": "http://arxiv.org/pdf/2408.13615v1",
        "summary": "We propose a new approach for multi-agent collective construction, based on\nthe idea of reversible ramps. Our ReRamp algorithm utilizes reversible\nside-ramps to generate construction plans for ramped block structures higher\nand larger than was previously possible using state-of-the-art planning\nalgorithms, given the same building area. We compare the ReRamp algorithm to\nsimilar state-of-the-art algorithms on a set of benchmark instances, where we\ndemonstrate its superior computational speed. We also establish in our\nexperiments that the ReRamp algorithm is capable of generating plans for a\nsingle-story house, an important milestone on the road to real-world\nmulti-agent construction applications.",
        "updated": "2024-08-24 16:04:58 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.13615v1"
    }
]