[
    {
        "title": "Symmetry & Critical Points",
        "authors": "Yossi Arjevani",
        "links": "http://arxiv.org/abs/2408.14445v1",
        "entry_id": "http://arxiv.org/abs/2408.14445v1",
        "pdf_url": "http://arxiv.org/pdf/2408.14445v1",
        "summary": "Critical points of an invariant function may or may not be symmetric. We\nprove, however, that if a symmetric critical point exists, those adjacent to it\nare generically symmetry breaking. This mathematical mechanism is shown to\ncarry important implications for our ability to efficiently minimize invariant\nnonconvex functions, in particular those associated with neural networks.",
        "updated": "2024-08-26 17:36:51 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.14445v1"
    },
    {
        "title": "A quasi-Bayesian sequential approach to deconvolution density estimation",
        "authors": "Stefano FavaroSandra Fortini",
        "links": "http://arxiv.org/abs/2408.14402v1",
        "entry_id": "http://arxiv.org/abs/2408.14402v1",
        "pdf_url": "http://arxiv.org/pdf/2408.14402v1",
        "summary": "Density deconvolution addresses the estimation of the unknown (probability)\ndensity function $f$ of a random signal from data that are observed with an\nindependent additive random noise. This is a classical problem in statistics,\nfor which frequentist and Bayesian nonparametric approaches are available to\ndeal with static or batch data. In this paper, we consider the problem of\ndensity deconvolution in a streaming or online setting where noisy data arrive\nprogressively, with no predetermined sample size, and we develop a sequential\nnonparametric approach to estimate $f$. By relying on a quasi-Bayesian\nsequential approach, often referred to as Newton's algorithm, we obtain\nestimates of $f$ that are of easy evaluation, computationally efficient, and\nwith a computational cost that remains constant as the amount of data\nincreases, which is critical in the streaming setting. Large sample asymptotic\nproperties of the proposed estimates are studied, yielding provable guarantees\nwith respect to the estimation of $f$ at a point (local) and on an interval\n(uniform). In particular, we establish local and uniform central limit\ntheorems, providing corresponding asymptotic credible intervals and bands. We\nvalidate empirically our methods on synthetic and real data, by considering the\ncommon setting of Laplace and Gaussian noise distributions, and make a\ncomparison with respect to the kernel-based approach and a Bayesian\nnonparametric approach with a Dirichlet process mixture prior.",
        "updated": "2024-08-26 16:40:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.14402v1"
    },
    {
        "title": "One-layer transformers fail to solve the induction heads task",
        "authors": "Clayton SanfordDaniel HsuMatus Telgarsky",
        "links": "http://arxiv.org/abs/2408.14332v1",
        "entry_id": "http://arxiv.org/abs/2408.14332v1",
        "pdf_url": "http://arxiv.org/pdf/2408.14332v1",
        "summary": "A simple communication complexity argument proves that no one-layer\ntransformer can solve the induction heads task unless its size is exponentially\nlarger than the size sufficient for a two-layer transformer.",
        "updated": "2024-08-26 15:01:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.14332v1"
    },
    {
        "title": "Function-Space MCMC for Bayesian Wide Neural Networks",
        "authors": "Lucia PezzettiStefano FavaroStefano Pelucchetti",
        "links": "http://arxiv.org/abs/2408.14325v1",
        "entry_id": "http://arxiv.org/abs/2408.14325v1",
        "pdf_url": "http://arxiv.org/pdf/2408.14325v1",
        "summary": "Bayesian Neural Networks represent a fascinating confluence of deep learning\nand probabilistic reasoning, offering a compelling framework for understanding\nuncertainty in complex predictive models. In this paper, we investigate the use\nof the preconditioned Crank-Nicolson algorithm and its Langevin version to\nsample from the reparametrised posterior distribution of the weights as the\nwidths of Bayesian Neural Networks grow larger. In addition to being robust in\nthe infinite-dimensional setting, we prove that the acceptance probabilities of\nthe proposed methods approach 1 as the width of the network increases,\nindependently of any stepsize tuning. Moreover, we examine and compare how the\nmixing speeds of the underdamped Langevin Monte Carlo, the preconditioned\nCrank-Nicolson and the preconditioned Crank-Nicolson Langevin samplers are\ninfluenced by changes in the network width in some real-world cases. Our\nfindings suggest that, in wide Bayesian Neural Networks configurations, the\npreconditioned Crank-Nicolson method allows for more efficient sampling of the\nreparametrised posterior distribution, as evidenced by a higher effective\nsample size and improved diagnostic results compared with the other analysed\nalgorithms.",
        "updated": "2024-08-26 14:54:13 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.14325v1"
    },
    {
        "title": "HyperSBINN: A Hypernetwork-Enhanced Systems Biology-Informed Neural Network for Efficient Drug Cardiosafety Assessment",
        "authors": "Inass SoukariehGerhard HesslerHervé MinouxMarcel MohrFriedemann SchmidtJan WenzelPierre BarbillonHugo GangloffPierre Gloaguen",
        "links": "http://arxiv.org/abs/2408.14266v1",
        "entry_id": "http://arxiv.org/abs/2408.14266v1",
        "pdf_url": "http://arxiv.org/pdf/2408.14266v1",
        "summary": "Mathematical modeling in systems toxicology enables a comprehensive\nunderstanding of the effects of pharmaceutical substances on cardiac health.\nHowever, the complexity of these models limits their widespread application in\nearly drug discovery. In this paper, we introduce a novel approach to solving\nparameterized models of cardiac action potentials by combining meta-learning\ntechniques with Systems Biology-Informed Neural Networks (SBINNs). The proposed\nmethod, HyperSBINN, effectively addresses the challenge of predicting the\neffects of various compounds at different concentrations on cardiac action\npotentials, outperforming traditional differential equation solvers in speed.\nOur model efficiently handles scenarios with limited data and complex\nparameterized differential equations. The HyperSBINN model demonstrates robust\nperformance in predicting APD90 values, indicating its potential as a reliable\ntool for modeling cardiac electrophysiology and aiding in preclinical drug\ndevelopment. This framework represents an advancement in computational\nmodeling, offering a scalable and efficient solution for simulating and\nunderstanding complex biological systems.",
        "updated": "2024-08-26 13:40:33 UTC",
        "interpretation": "解释内容未找到",
        "id": "2408.14266v1"
    }
]