[
    {
        "title": "Bridging the Gap: Unravelling Local Government Data Sharing Barriers in Estonia and Beyond",
        "authors": "Katrin Rajamäe SoosaarAnastasija Nikiforova",
        "links": "http://arxiv.org/abs/2406.08461v1",
        "entry_id": "http://arxiv.org/abs/2406.08461v1",
        "pdf_url": "http://arxiv.org/pdf/2406.08461v1",
        "summary": "Estonia's digital government success has received global acclaim, yet its\nOpen Government Data (OGD) initiatives, especially at the local level,\nencounter persistent challenges. Despite significant progress of national OGD\ninitiative in OGD rankings, local governments lag in OGD provision. This study\naims to examine barriers hindering municipalities from openly sharing OGD.\nEmploying a qualitative approach through interviews with Estonian\nmunicipalities and drawing on the OGD-adapted Innovation Resistance Theory\nmodel, the study sheds light on barriers impeding OGD sharing. Practical\nrecommendations are proposed to bridge the gap between national policies and\nlocal implementation, including enhancing awareness, improving data governance\nframeworks, and fostering collaboration be-tween local and national\nauthorities. By addressing overlooked weaknesses in the Estonian open data\necosystem and providing actionable recommendations, this research contributes\nto a more resilient and sustainable open data ecosystem. Additionally, by\nvalidating the OGD-adapted Innovation Resistance Theory model and proposing a\nrevised version tailored for local government contexts, the study advances\ntheoretical frameworks for understanding data sharing resistance. Ultimately,\nthis study serves as a call to action for policymakers and practitioners to\nprioritize local OGD initiatives.",
        "updated": "2024-06-12 17:51:47 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.08461v1"
    },
    {
        "title": "ORES-Inspect: A technology probe for machine learning audits on enwiki",
        "authors": "Zachary LevonianLauren HagenLu LiJada LilleboeSolvejg WastvedtAaron HalfakerLoren Terveen",
        "links": "http://arxiv.org/abs/2406.08453v1",
        "entry_id": "http://arxiv.org/abs/2406.08453v1",
        "pdf_url": "http://arxiv.org/pdf/2406.08453v1",
        "summary": "Auditing the machine learning (ML) models used on Wikipedia is important for\nensuring that vandalism-detection processes remain fair and effective. However,\nconducting audits is challenging because stakeholders have diverse priorities\nand assembling evidence for a model's [in]efficacy is technically complex. We\ndesigned an interface to enable editors to learn about and audit the\nperformance of the ORES edit quality model. ORES-Inspect is an open-source web\ntool and a provocative technology probe for researching how editors think about\nauditing the many ML models used on Wikipedia. We describe the design of\nORES-Inspect and our plans for further research with this system.",
        "updated": "2024-06-12 17:45:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.08453v1"
    },
    {
        "title": "Designing Child-Centered Content Exposure and Moderation",
        "authors": "Belén Saldías",
        "links": "http://arxiv.org/abs/2406.08420v1",
        "entry_id": "http://arxiv.org/abs/2406.08420v1",
        "pdf_url": "http://arxiv.org/pdf/2406.08420v1",
        "summary": "Research on children's online experience and computer interaction often\noverlooks the relationship children have with hidden algorithms that control\nthe content they encounter. Furthermore, it is not only about how children\ninteract with targeted content but also how their development and agency are\nlargely affected by these. By engaging with the body of literature at the\nintersection of i) human-centered design approaches, ii) exclusion and\ndiscrimination in A.I., iii) privacy, transparency, and accountability, and iv)\nchildren's online citizenship, this article dives into the question of \"How can\nwe approach the design of a child-centered moderation process to (1) include\naspects that families value for their children and (2) provide explanations for\ncontent appropriateness and removal so that we can scale (according to systems\nand human needs) the moderation process assisted by A.I.?\".\n  This article contributes a sociotechnical highlight of core challenges and\nopportunities of designing child-centered content control tools. The article\nconcludes by grounding and characterizing design considerations for a\nchild-centered, family-guided moderation system. We hope this work serves as a\nstepping stone for designers and researchers pursuing children's safety online\nwith an eye on hidden agents controlling children's online experiences and, by\nextension, the values and opportunities children are exposed to.",
        "updated": "2024-06-12 17:04:36 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.08420v1"
    },
    {
        "title": "Tailoring Generative AI Chatbots for Multiethnic Communities in Disaster Preparedness Communication: Extending the CASA Paradigm",
        "authors": "Xinyan ZhaoYuan SunWenlin LiuChau-Wai Wong",
        "links": "http://arxiv.org/abs/2406.08411v1",
        "entry_id": "http://arxiv.org/abs/2406.08411v1",
        "pdf_url": "http://arxiv.org/pdf/2406.08411v1",
        "summary": "This study is among the first to develop different prototypes of generative\nAI (GenAI) chatbots powered by GPT 4 to communicate hurricane preparedness\ninformation to diverse residents. Drawing from the Computers Are Social Actors\n(CASA) paradigm and the literature on disaster vulnerability and cultural\ntailoring, this study conducted a between-subjects experiment with 441 Black,\nHispanic, and Caucasian residents of Florida. A computational analysis of chat\nlogs (N = 7,848) shows that anthropomorphism and personalization are key\ncommunication topics in GenAI chatbot-user interactions. SEM results (N = 441)\nsuggest that GenAI chatbots varying in tone formality and cultural tailoring\nsignificantly predict bot perceptions and, subsequently, hurricane preparedness\noutcomes. These results highlight the potential of using GenAI chatbots to\nimprove diverse communities' disaster preparedness.",
        "updated": "2024-06-12 16:57:28 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.08411v1"
    },
    {
        "title": "SonicID: User Identification on Smart Glasses with Acoustic Sensing",
        "authors": "Ke LiDevansh AgarwalRuidong ZhangVipin GundaTianjun MoSaif MahmudBoao ChenFrançois GuimbretièreCheng Zhang",
        "links": "http://arxiv.org/abs/2406.08273v1",
        "entry_id": "http://arxiv.org/abs/2406.08273v1",
        "pdf_url": "http://arxiv.org/pdf/2406.08273v1",
        "summary": "Smart glasses have become more prevalent as they provide an increasing number\nof applications for users. They store various types of private information or\ncan access it via connections established with other devices. Therefore, there\nis a growing need for user identification on smart glasses. In this paper, we\nintroduce a low-power and minimally-obtrusive system called SonicID, designed\nto authenticate users on glasses. SonicID extracts unique biometric information\nfrom users by scanning their faces with ultrasonic waves and utilizes this\ninformation to distinguish between different users, powered by a customized\nbinary classifier with the ResNet-18 architecture. SonicID can authenticate\nusers within 0.12 seconds, with an energy consumption of 19.8 mAs per trial. A\nuser study involving 24 participants confirms that SonicID achieves a true\npositive rate of 96.5%, a false positive rate of 4.1%, and a balanced accuracy\nof 96.2% using just 4 minutes of training data collected for each new user.\nThis performance is relatively consistent across different remounting sessions\nand days. Given this promising performance, we further discuss the potential\napplications of SonicID and methods to improve its performance in the future.",
        "updated": "2024-06-12 14:38:34 UTC",
        "interpretation": "解释内容未找到",
        "id": "2406.08273v1"
    }
]