[
    {
        "title": "Supporting Business Document Workflows via Collection-Centric Information Foraging with Large Language Models",
        "authors": "Raymond FokNedim LipkaTong SunAlexa Siu",
        "links": "http://arxiv.org/abs/2405.01501v1",
        "entry_id": "http://arxiv.org/abs/2405.01501v1",
        "pdf_url": "http://arxiv.org/pdf/2405.01501v1",
        "summary": "Knowledge workers often need to extract and analyze information from a\ncollection of documents to solve complex information tasks in the workplace,\ne.g., hiring managers reviewing resumes or analysts assessing risk in\ncontracts. However, foraging for relevant information can become tedious and\nrepetitive over many documents and criteria of interest. We introduce Marco, a\nmixed-initiative workspace supporting sensemaking over diverse business\ndocument collections. Through collection-centric assistance, Marco reduces the\ncognitive costs of extracting and structuring information, allowing users to\nprioritize comparative synthesis and decision making processes. Users\ninteractively communicate their information needs to an AI assistant using\nnatural language and compose schemas that provide an overview of a document\ncollection. Findings from a usability study (n=16) demonstrate that when using\nMarco, users complete sensemaking tasks 16% more quickly, with less effort, and\nwithout diminishing accuracy. A design probe with seven domain experts\nidentifies how Marco can benefit various real-world workflows.",
        "updated": "2024-05-02 17:32:38 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.01501v1"
    },
    {
        "title": "Designing Algorithmic Recommendations to Achieve Human-AI Complementarity",
        "authors": "Bryce McLaughlinJann Spiess",
        "links": "http://arxiv.org/abs/2405.01484v1",
        "entry_id": "http://arxiv.org/abs/2405.01484v1",
        "pdf_url": "http://arxiv.org/pdf/2405.01484v1",
        "summary": "Algorithms frequently assist, rather than replace, human decision-makers.\nHowever, the design and analysis of algorithms often focus on predicting\noutcomes and do not explicitly model their effect on human decisions. This\ndiscrepancy between the design and role of algorithmic assistants becomes of\nparticular concern in light of empirical evidence that suggests that\nalgorithmic assistants again and again fail to improve human decisions. In this\narticle, we formalize the design of recommendation algorithms that assist human\ndecision-makers without making restrictive ex-ante assumptions about how\nrecommendations affect decisions. We formulate an algorithmic-design problem\nthat leverages the potential-outcomes framework from causal inference to model\nthe effect of recommendations on a human decision-maker's binary treatment\nchoice. Within this model, we introduce a monotonicity assumption that leads to\nan intuitive classification of human responses to the algorithm. Under this\nmonotonicity assumption, we can express the human's response to algorithmic\nrecommendations in terms of their compliance with the algorithm and the\ndecision they would take if the algorithm sends no recommendation. We showcase\nthe utility of our framework using an online experiment that simulates a hiring\ntask. We argue that our approach explains the relative performance of different\nrecommendation algorithms in the experiment, and can help design solutions that\nrealize human-AI complementarity.",
        "updated": "2024-05-02 17:15:30 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.01484v1"
    },
    {
        "title": "Student Reflections on Self-Initiated GenAI Use in HCI Education",
        "authors": "Hauke SandhausMaria Teresa ParreiraWendy Ju",
        "links": "http://arxiv.org/abs/2405.01467v1",
        "entry_id": "http://arxiv.org/abs/2405.01467v1",
        "pdf_url": "http://arxiv.org/pdf/2405.01467v1",
        "summary": "This study explores students' self-initiated use of Generative Artificial\nIntelligence (GenAI) tools in an interactive systems design class. Through 12\ngroup interviews, students revealed the dual nature of GenAI in (1) stimulating\ncreativity and (2) speeding up design iterations, alongside concerns over its\npotential to cause shallow learning and reliance. GenAI's benefits were\npronounced in the execution phase of design, aiding rapid prototyping and\nideation, while its use in initial insight generation posed risks to depth and\nreflective practice. This reflection highlights the complex role of GenAI in\nHuman-Computer Interaction education, emphasizing the need for balanced\nintegration to leverage its advantages without compromising fundamental\nlearning outcomes.",
        "updated": "2024-05-02 16:58:17 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.01467v1"
    },
    {
        "title": "Human-Robot Interaction Conversational User Enjoyment Scale (HRI CUES)",
        "authors": "Bahar IrfanJura MiniotaSofia ThunbergErik LagerstedtSanna KuoppamäkiGabriel SkantzeAndré Pereira",
        "links": "http://arxiv.org/abs/2405.01354v1",
        "entry_id": "http://arxiv.org/abs/2405.01354v1",
        "pdf_url": "http://arxiv.org/pdf/2405.01354v1",
        "summary": "Understanding user enjoyment is crucial in human-robot interaction (HRI), as\nit can impact interaction quality and influence user acceptance and long-term\nengagement with robots, particularly in the context of conversations with\nsocial robots. However, current assessment methods rely solely on self-reported\nquestionnaires, failing to capture interaction dynamics. This work introduces\nthe Human-Robot Interaction Conversational User Enjoyment Scale (HRI CUES), a\nnovel scale for assessing user enjoyment from an external perspective during\nconversations with a robot. Developed through rigorous evaluations and\ndiscussions of three annotators with relevant expertise, the scale provides a\nstructured framework for assessing enjoyment in each conversation exchange\n(turn) alongside overall interaction levels. It aims to complement\nself-reported enjoyment from users and holds the potential for autonomously\nidentifying user enjoyment in real-time HRI. The scale was validated on 25\nolder adults' open-domain dialogue with a companion robot that was powered by a\nlarge language model for conversations, corresponding to 174 minutes of data,\nshowing moderate to good alignment. Additionally, the study offers insights\ninto understanding the nuances and challenges of assessing user enjoyment in\nrobot interactions, and provides guidelines on applying the scale to other\ndomains.",
        "updated": "2024-05-02 15:01:43 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.01354v1"
    },
    {
        "title": "Quantifying Spatial Domain Explanations in BCI using Earth Mover's Distance",
        "authors": "Param RajpuraHubert CecottiYogesh Kumar Meena",
        "links": "http://arxiv.org/abs/2405.01277v1",
        "entry_id": "http://arxiv.org/abs/2405.01277v1",
        "pdf_url": "http://arxiv.org/pdf/2405.01277v1",
        "summary": "Brain-computer interface (BCI) systems facilitate unique communication\nbetween humans and computers, benefiting severely disabled individuals. Despite\ndecades of research, BCIs are not fully integrated into clinical and commercial\nsettings. It's crucial to assess and explain BCI performance, offering clear\nexplanations for potential users to avoid frustration when it doesn't work as\nexpected. This work investigates the efficacy of different deep learning and\nRiemannian geometry-based classification models in the context of motor imagery\n(MI) based BCI using electroencephalography (EEG). We then propose an optimal\ntransport theory-based approach using earth mover's distance (EMD) to quantify\nthe comparison of the feature relevance map with the domain knowledge of\nneuroscience. For this, we utilized explainable AI (XAI) techniques for\ngenerating feature relevance in the spatial domain to identify important\nchannels for model outcomes. Three state-of-the-art models are implemented - 1)\nRiemannian geometry-based classifier, 2) EEGNet, and 3) EEG Conformer, and the\nobserved trend in the model's accuracy across different architectures on the\ndataset correlates with the proposed feature relevance metrics. The models with\ndiverse architectures perform significantly better when trained on channels\nrelevant to motor imagery than data-driven channel selection. This work focuses\nattention on the necessity for interpretability and incorporating metrics\nbeyond accuracy, underscores the value of combining domain knowledge and\nquantifying model interpretations with data-driven approaches in creating\nreliable and robust Brain-Computer Interfaces (BCIs).",
        "updated": "2024-05-02 13:35:15 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.01277v1"
    }
]