[
    {
        "title": "Accelerating Convergence in Bayesian Few-Shot Classification",
        "authors": "Tianjun KeHaoqun CaoFeng Zhou",
        "links": "http://arxiv.org/abs/2405.01507v1",
        "entry_id": "http://arxiv.org/abs/2405.01507v1",
        "pdf_url": "http://arxiv.org/pdf/2405.01507v1",
        "summary": "Bayesian few-shot classification has been a focal point in the field of\nfew-shot learning. This paper seamlessly integrates mirror descent-based\nvariational inference into Gaussian process-based few-shot classification,\naddressing the challenge of non-conjugate inference. By leveraging\nnon-Euclidean geometry, mirror descent achieves accelerated convergence by\nproviding the steepest descent direction along the corresponding manifold. It\nalso exhibits the parameterization invariance property concerning the\nvariational distribution. Experimental results demonstrate competitive\nclassification accuracy, improved uncertainty quantification, and faster\nconvergence compared to baseline models. Additionally, we investigate the\nimpact of hyperparameters and components. Code is publicly available at\nhttps://github.com/keanson/MD-BSFC.",
        "updated": "2024-05-02 17:37:39 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.01507v1"
    },
    {
        "title": "Digital Twin Generators for Disease Modeling",
        "authors": "Nameyeh AlamJake BasilicoDaniele BertoliniSatish Casie ChettyHeather D'AngeloRyan DouglasCharles K. FisherFranklin FullerMelissa GomesRishabh GuptaAlex LangAnton LoukianovRachel Mak-McCullyCary MurrayHanalei PhamSusanna QiaoElena Ryapolova-WebbAaron SmithDimitri TheoharatosAnil TolwaniEric W. TramelAnna VidovszkyJudy ViduyaJonathan R. Walsh",
        "links": "http://arxiv.org/abs/2405.01488v1",
        "entry_id": "http://arxiv.org/abs/2405.01488v1",
        "pdf_url": "http://arxiv.org/pdf/2405.01488v1",
        "summary": "A patient's digital twin is a computational model that describes the\nevolution of their health over time. Digital twins have the potential to\nrevolutionize medicine by enabling individual-level computer simulations of\nhuman health, which can be used to conduct more efficient clinical trials or to\nrecommend personalized treatment options. Due to the overwhelming complexity of\nhuman biology, machine learning approaches that leverage large datasets of\nhistorical patients' longitudinal health records to generate patients' digital\ntwins are more tractable than potential mechanistic models. In this manuscript,\nwe describe a neural network architecture that can learn conditional generative\nmodels of clinical trajectories, which we call Digital Twin Generators (DTGs),\nthat can create digital twins of individual patients. We show that the same\nneural network architecture can be trained to generate accurate digital twins\nfor patients across 13 different indications simply by changing the training\nset and tuning hyperparameters. By introducing a general purpose architecture,\nwe aim to unlock the ability to scale machine learning approaches to larger\ndatasets and across more indications so that a digital twin could be created\nfor any patient in the world.",
        "updated": "2024-05-02 17:23:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.01488v1"
    },
    {
        "title": "Designing Algorithmic Recommendations to Achieve Human-AI Complementarity",
        "authors": "Bryce McLaughlinJann Spiess",
        "links": "http://arxiv.org/abs/2405.01484v1",
        "entry_id": "http://arxiv.org/abs/2405.01484v1",
        "pdf_url": "http://arxiv.org/pdf/2405.01484v1",
        "summary": "Algorithms frequently assist, rather than replace, human decision-makers.\nHowever, the design and analysis of algorithms often focus on predicting\noutcomes and do not explicitly model their effect on human decisions. This\ndiscrepancy between the design and role of algorithmic assistants becomes of\nparticular concern in light of empirical evidence that suggests that\nalgorithmic assistants again and again fail to improve human decisions. In this\narticle, we formalize the design of recommendation algorithms that assist human\ndecision-makers without making restrictive ex-ante assumptions about how\nrecommendations affect decisions. We formulate an algorithmic-design problem\nthat leverages the potential-outcomes framework from causal inference to model\nthe effect of recommendations on a human decision-maker's binary treatment\nchoice. Within this model, we introduce a monotonicity assumption that leads to\nan intuitive classification of human responses to the algorithm. Under this\nmonotonicity assumption, we can express the human's response to algorithmic\nrecommendations in terms of their compliance with the algorithm and the\ndecision they would take if the algorithm sends no recommendation. We showcase\nthe utility of our framework using an online experiment that simulates a hiring\ntask. We argue that our approach explains the relative performance of different\nrecommendation algorithms in the experiment, and can help design solutions that\nrealize human-AI complementarity.",
        "updated": "2024-05-02 17:15:30 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.01484v1"
    },
    {
        "title": "In-and-Out: Algorithmic Diffusion for Sampling Convex Bodies",
        "authors": "Yunbum KookSantosh S. VempalaMatthew S. Zhang",
        "links": "http://arxiv.org/abs/2405.01425v1",
        "entry_id": "http://arxiv.org/abs/2405.01425v1",
        "pdf_url": "http://arxiv.org/pdf/2405.01425v1",
        "summary": "We present a new random walk for uniformly sampling high-dimensional convex\nbodies. It achieves state-of-the-art runtime complexity with stronger\nguarantees on the output than previously known, namely in R\\'enyi divergence\n(which implies TV, $\\mathcal{W}_2$, KL, $\\chi^2$). The proof departs from known\napproaches for polytime algorithms for the problem -- we utilize a stochastic\ndiffusion perspective to show contraction to the target distribution with the\nrate of convergence determined by functional isoperimetric constants of the\nstationary density.",
        "updated": "2024-05-02 16:15:46 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.01425v1"
    },
    {
        "title": "Random Pareto front surfaces",
        "authors": "Ben TuNikolas KantasRobert M. LeeBehrang Shafei",
        "links": "http://arxiv.org/abs/2405.01404v1",
        "entry_id": "http://arxiv.org/abs/2405.01404v1",
        "pdf_url": "http://arxiv.org/pdf/2405.01404v1",
        "summary": "The Pareto front of a set of vectors is the subset which is comprised solely\nof all of the best trade-off points. By interpolating this subset, we obtain\nthe optimal trade-off surface. In this work, we prove a very useful result\nwhich states that all Pareto front surfaces can be explicitly parametrised\nusing polar coordinates. In particular, our polar parametrisation result tells\nus that we can fully characterise any Pareto front surface using the length\nfunction, which is a scalar-valued function that returns the projected length\nalong any positive radial direction. Consequently, by exploiting this\nrepresentation, we show how it is possible to generalise many useful concepts\nfrom linear algebra, probability and statistics, and decision theory to\nfunction over the space of Pareto front surfaces. Notably, we focus our\nattention on the stochastic setting where the Pareto front surface itself is a\nstochastic process. Among other things, we showcase how it is possible to\ndefine and estimate many statistical quantities of interest such as the\nexpectation, covariance and quantile of any Pareto front surface distribution.\nAs a motivating example, we investigate how these statistics can be used within\na design of experiments setting, where the goal is to both infer and use the\nPareto front surface distribution in order to make effective decisions. Besides\nthis, we also illustrate how these Pareto front ideas can be used within the\ncontext of extreme value theory. Finally, as a numerical example, we applied\nsome of our new methodology on a real-world air pollution data set.",
        "updated": "2024-05-02 15:54:46 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.01404v1"
    }
]