[
    {
        "title": "Fusion Intelligence: Confluence of Natural and Artificial Intelligence for Enhanced Problem-Solving Efficiency",
        "authors": "Rohan Reddy KalavakondaJunjun HuanPeyman DehghanzadehArchit JaiswalSoumyajit MandalSwarup Bhunia",
        "links": "http://arxiv.org/abs/2405.09763v1",
        "entry_id": "http://arxiv.org/abs/2405.09763v1",
        "pdf_url": "http://arxiv.org/pdf/2405.09763v1",
        "summary": "This paper introduces Fusion Intelligence (FI), a bio-inspired intelligent\nsystem, where the innate sensing, intelligence and unique actuation abilities\nof biological organisms such as bees and ants are integrated with the\ncomputational power of Artificial Intelligence (AI). This interdisciplinary\nfield seeks to create systems that are not only smart but also adaptive and\nresponsive in ways that mimic the nature. As FI evolves, it holds the promise\nof revolutionizing the way we approach complex problems, leveraging the best of\nboth biological and digital worlds to create solutions that are more effective,\nsustainable, and harmonious with the environment. We demonstrate FI's potential\nto enhance agricultural IoT system performance through a simulated case study\non improving insect pollination efficacy (entomophily).",
        "updated": "2024-05-16 02:10:30 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.09763v1"
    },
    {
        "title": "BonnBot-I Plus: A Bio-diversity Aware Precise Weed Management Robotic Platform",
        "authors": "Alireza AhmadiMichael HalsteadClaus SmittChris McCool",
        "links": "http://arxiv.org/abs/2405.09118v1",
        "entry_id": "http://arxiv.org/abs/2405.09118v1",
        "pdf_url": "http://arxiv.org/pdf/2405.09118v1",
        "summary": "In this article, we focus on the critical tasks of plant protection in arable\nfarms, addressing a modern challenge in agriculture: integrating ecological\nconsiderations into the operational strategy of precision weeding robots like\n\\bbot. This article presents the recent advancements in weed management\nalgorithms and the real-world performance of \\bbot\\ at the University of Bonn's\nKlein-Altendorf campus. We present a novel Rolling-view observation model for\nthe BonnBot-Is weed monitoring section which leads to an average absolute\nweeding performance enhancement of $3.4\\%$. Furthermore, for the first time, we\nshow how precision weeding robots could consider bio-diversity-aware concerns\nin challenging weeding scenarios. We carried out comprehensive weeding\nexperiments in sugar-beet fields, covering both weed-only and mixed crop-weed\nsituations, and introduced a new dataset compatible with precision weeding. Our\nreal-field experiments revealed that our weeding approach is capable of\nhandling diverse weed distributions, with a minimal loss of only $11.66\\%$\nattributable to intervention planning and $14.7\\%$ to vision system limitations\nhighlighting required improvements of the vision system.",
        "updated": "2024-05-15 06:23:59 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.09118v1"
    },
    {
        "title": "Feature-based Federated Transfer Learning: Communication Efficiency, Robustness and Privacy",
        "authors": "Feng WangM. Cenk GursoySenem Velipasalar",
        "links": "http://arxiv.org/abs/2405.09014v1",
        "entry_id": "http://arxiv.org/abs/2405.09014v1",
        "pdf_url": "http://arxiv.org/pdf/2405.09014v1",
        "summary": "In this paper, we propose feature-based federated transfer learning as a\nnovel approach to improve communication efficiency by reducing the uplink\npayload by multiple orders of magnitude compared to that of existing approaches\nin federated learning and federated transfer learning. Specifically, in the\nproposed feature-based federated learning, we design the extracted features and\noutputs to be uploaded instead of parameter updates. For this distributed\nlearning model, we determine the required payload and provide comparisons with\nthe existing schemes. Subsequently, we analyze the robustness of feature-based\nfederated transfer learning against packet loss, data insufficiency, and\nquantization. Finally, we address privacy considerations by defining and\nanalyzing label privacy leakage and feature privacy leakage, and investigating\nmitigating approaches. For all aforementioned analyses, we evaluate the\nperformance of the proposed learning scheme via experiments on an image\nclassification task and a natural language processing task to demonstrate its\neffectiveness.",
        "updated": "2024-05-15 00:43:19 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.09014v1"
    },
    {
        "title": "Beyond Theorems: A Counterexample to Potential Markov Game Criteria",
        "authors": "Fatemeh FardnoSeyed Majid Zahedi",
        "links": "http://arxiv.org/abs/2405.08206v1",
        "entry_id": "http://arxiv.org/abs/2405.08206v1",
        "pdf_url": "http://arxiv.org/pdf/2405.08206v1",
        "summary": "There are only limited classes of multi-player stochastic games in which\nindependent learning is guaranteed to converge to a Nash equilibrium. Markov\npotential games are a key example of such classes. Prior work has outlined sets\nof sufficient conditions for a stochastic game to qualify as a Markov potential\ngame. However, these conditions often impose strict limitations on the game's\nstructure and tend to be challenging to verify. To address these limitations,\nMguni et al. [12] introduce a relaxed notion of Markov potential games and\noffer an alternative set of necessary conditions for categorizing stochastic\ngames as potential games. Under these conditions, the authors claim that a\ndeterministic Nash equilibrium can be computed efficiently by solving a dual\nMarkov decision process. In this paper, we offer evidence refuting this claim\nby presenting a counterexample.",
        "updated": "2024-05-13 21:49:15 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.08206v1"
    },
    {
        "title": "Evaluating Supply Chain Resilience During Pandemic Using Agent-based Simulation",
        "authors": "Teddy Lazebnik",
        "links": "http://arxiv.org/abs/2405.08830v1",
        "entry_id": "http://arxiv.org/abs/2405.08830v1",
        "pdf_url": "http://arxiv.org/pdf/2405.08830v1",
        "summary": "Recent pandemics have highlighted vulnerabilities in our global economic\nsystems, especially supply chains. Possible future pandemic raises a dilemma\nfor businesses owners between short-term profitability and long-term supply\nchain resilience planning. In this study, we propose a novel agent-based\nsimulation model integrating extended Susceptible-Infected-Recovered (SIR)\nepidemiological model and supply and demand economic model to evaluate supply\nchain resilience strategies during pandemics. Using this model, we explore a\nrange of supply chain resilience strategies under pandemic scenarios using in\nsilico experiments. We find that a balanced approach to supply chain resilience\nperforms better in both pandemic and non-pandemic times compared to extreme\nstrategies, highlighting the importance of preparedness in the form of a better\nsupply chain resilience. However, our analysis shows that the exact supply\nchain resilience strategy is hard to obtain for each firm and is relatively\nsensitive to the exact profile of the pandemic and economic state at the\nbeginning of the pandemic. As such, we used a machine learning model that uses\nthe agent-based simulation to estimate a near-optimal supply chain resilience\nstrategy for a firm. The proposed model offers insights for policymakers and\nbusinesses to enhance supply chain resilience in the face of future pandemics,\ncontributing to understanding the trade-offs between short-term gains and\nlong-term sustainability in supply chain management before and during\npandemics.",
        "updated": "2024-05-13 18:32:28 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.08830v1"
    }
]