[
    {
        "title": "Networked Multiagent Reinforcement Learning for Peer-to-Peer Energy Trading",
        "authors": "Chen FengAndrew L. Liu",
        "links": "http://arxiv.org/abs/2401.13947v1",
        "entry_id": "http://arxiv.org/abs/2401.13947v1",
        "pdf_url": "http://arxiv.org/pdf/2401.13947v1",
        "summary": "Utilizing distributed renewable and energy storage resources in local\ndistribution networks via peer-to-peer (P2P) energy trading has long been\ntouted as a solution to improve energy systems' resilience and sustainability.\nConsumers and prosumers (those who have energy generation resources), however,\ndo not have the expertise to engage in repeated P2P trading, and the\nzero-marginal costs of renewables present challenges in determining fair market\nprices. To address these issues, we propose multi-agent reinforcement learning\n(MARL) frameworks to help automate consumers' bidding and management of their\nsolar PV and energy storage resources, under a specific P2P clearing mechanism\nthat utilizes the so-called supply-demand ratio. In addition, we show how the\nMARL frameworks can integrate physical network constraints to realize voltage\ncontrol, hence ensuring physical feasibility of the P2P energy trading and\npaving way for real-world implementations.",
        "updated": "2024-01-25 05:05:55 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.13947v1"
    },
    {
        "title": "General Automatic Solution Generation of Social Problems",
        "authors": "Tong NiuHaoyu HuangYu DuWeihao ZhangLuping ShiRong Zhao",
        "links": "http://dx.doi.org/10.1007/s11633-024-1396-5",
        "entry_id": "http://arxiv.org/abs/2401.13945v1",
        "pdf_url": "http://arxiv.org/pdf/2401.13945v1",
        "summary": "Given the escalating intricacy and multifaceted nature of contemporary social\nsystems, manually generating solutions to address pertinent social issues has\nbecome a formidable task. In response to this challenge, the rapid development\nof artificial intelligence has spurred the exploration of computational\nmethodologies aimed at automatically generating solutions. However, current\nmethods for auto-generation of solutions mainly concentrate on local social\nregulations that pertain to specific scenarios. Here, we report an automatic\nsocial operating system (ASOS) designed for general social solution generation,\nwhich is built upon agent-based models, enabling both global and local analyses\nand regulations of social problems across spatial and temporal dimensions. ASOS\nadopts a hypergraph with extensible social semantics for a comprehensive and\nstructured representation of social dynamics. It also incorporates a\ngeneralized protocol for standardized hypergraph operations and a symbolic\nhybrid framework that delivers interpretable solutions, yielding a balance\nbetween regulatory efficacy and function viability. To demonstrate the\neffectiveness of ASOS, we apply it to the domain of averting extreme events\nwithin international oil futures markets. By generating a new trading role\nsupplemented by new mechanisms, ASOS can adeptly discern precarious market\nconditions and make front-running interventions for non-profit purposes. This\nstudy demonstrates that ASOS provides an efficient and systematic approach for\ngenerating solutions for enhancing our society.",
        "updated": "2024-01-25 05:00:46 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.13945v1"
    },
    {
        "title": "Stream-based perception for cognitive agents in mobile ecosystems",
        "authors": "Jeremias DötterlRalf BrunsJürgen DunkelSascha Ossowski",
        "links": "http://dx.doi.org/10.3233/AIC-190614",
        "entry_id": "http://arxiv.org/abs/2401.13604v1",
        "pdf_url": "http://arxiv.org/pdf/2401.13604v1",
        "summary": "Cognitive agent abstractions can help to engineer intelligent systems across\nmobile devices. On smartphones, the data obtained from onboard sensors can give\nvaluable insights into the user's current situation. Unfortunately, today's\ncognitive agent frameworks cannot cope well with the challenging\ncharacteristics of sensor data. Sensor data is located on a low abstraction\nlevel and the individual data elements are not meaningful when observed in\nisolation. In contrast, cognitive agents operate on high-level percepts and\nlack the means to effectively detect complex spatio-temporal patterns in\nsequences of multiple percepts. In this paper, we present a stream-based\nperception approach that enables the agents to perceive meaningful situations\nin low-level sensor data streams. We present a crowdshipping case study where\nautonomous, self-interested agents collaborate to deliver parcels to their\ndestinations. We show how situations derived from smartphone sensor data can\ntrigger and guide auctions, which the agents use to reach agreements.\nExperiments with real smartphone data demonstrate the benefits of stream-based\nagent perception.",
        "updated": "2024-01-24 17:14:50 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.13604v1"
    },
    {
        "title": "Multi-Agent Diagnostics for Robustness via Illuminated Diversity",
        "authors": "Mikayel SamvelyanDavide PaglieriMinqi JiangJack Parker-HolderTim Rocktäschel",
        "links": "http://arxiv.org/abs/2401.13460v1",
        "entry_id": "http://arxiv.org/abs/2401.13460v1",
        "pdf_url": "http://arxiv.org/pdf/2401.13460v1",
        "summary": "In the rapidly advancing field of multi-agent systems, ensuring robustness in\nunfamiliar and adversarial settings is crucial. Notwithstanding their\noutstanding performance in familiar environments, these systems often falter in\nnew situations due to overfitting during the training phase. This is especially\npronounced in settings where both cooperative and competitive behaviours are\npresent, encapsulating a dual nature of overfitting and generalisation\nchallenges. To address this issue, we present Multi-Agent Diagnostics for\nRobustness via Illuminated Diversity (MADRID), a novel approach for generating\ndiverse adversarial scenarios that expose strategic vulnerabilities in\npre-trained multi-agent policies. Leveraging the concepts from open-ended\nlearning, MADRID navigates the vast space of adversarial settings, employing a\ntarget policy's regret to gauge the vulnerabilities of these settings. We\nevaluate the effectiveness of MADRID on the 11vs11 version of Google Research\nFootball, one of the most complex environments for multi-agent reinforcement\nlearning. Specifically, we employ MADRID for generating a diverse array of\nadversarial settings for TiZero, the state-of-the-art approach which \"masters\"\nthe game through 45 days of training on a large-scale distributed\ninfrastructure. We expose key shortcomings in TiZero's tactical\ndecision-making, underlining the crucial importance of rigorous evaluation in\nmulti-agent systems.",
        "updated": "2024-01-24 14:02:09 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.13460v1"
    },
    {
        "title": "Generalization of Heterogeneous Multi-Robot Policies via Awareness and Communication of Capabilities",
        "authors": "Pierce HowellMax RudolphReza TorbatiKevin FuHarish Ravichandar",
        "links": "http://arxiv.org/abs/2401.13127v1",
        "entry_id": "http://arxiv.org/abs/2401.13127v1",
        "pdf_url": "http://arxiv.org/pdf/2401.13127v1",
        "summary": "Recent advances in multi-agent reinforcement learning (MARL) are enabling\nimpressive coordination in heterogeneous multi-robot teams. However, existing\napproaches often overlook the challenge of generalizing learned policies to\nteams of new compositions, sizes, and robots. While such generalization might\nnot be important in teams of virtual agents that can retrain policies\non-demand, it is pivotal in multi-robot systems that are deployed in the\nreal-world and must readily adapt to inevitable changes. As such, multi-robot\npolicies must remain robust to team changes -- an ability we call adaptive\nteaming. In this work, we investigate if awareness and communication of robot\ncapabilities can provide such generalization by conducting detailed experiments\ninvolving an established multi-robot test bed. We demonstrate that shared\ndecentralized policies, that enable robots to be both aware of and communicate\ntheir capabilities, can achieve adaptive teaming by implicitly capturing the\nfundamental relationship between collective capabilities and effective\ncoordination. Videos of trained policies can be viewed at:\nhttps://sites.google.com/view/cap-comm",
        "updated": "2024-01-23 22:31:34 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.13127v1"
    }
]