[
    {
        "title": "PrompTHis: Visualizing the Process and Influence of Prompt Editing during Text-to-Image Creation",
        "authors": "Yuhan GuoHanning ShaoCan LiuKai XuXiaoru Yuan",
        "links": "http://arxiv.org/abs/2403.09615v1",
        "entry_id": "http://arxiv.org/abs/2403.09615v1",
        "pdf_url": "http://arxiv.org/pdf/2403.09615v1",
        "summary": "Generative text-to-image models, which allow users to create appealing images\nthrough a text prompt, have seen a dramatic increase in popularity in recent\nyears. However, most users have a limited understanding of how such models work\nand it often requires many trials and errors to achieve satisfactory results.\nThe prompt history contains a wealth of information that could provide users\nwith insights into what have been explored and how the prompt changes impact\nthe output image, yet little research attention has been paid to the visual\nanalysis of such process to support users. We propose the Image Variant Graph,\na novel visual representation designed to support comparing prompt-image pairs\nand exploring the editing history. The Image Variant Graph models prompt\ndifferences as edges between corresponding images and presents the distances\nbetween images through projection. Based on the graph, we developed the\nPrompTHis system through co-design with artists. Besides Image Variant Graph,\nPrompTHis also incorporates a detailed prompt-image history and a navigation\nmini-map. Based on the review and analysis of the prompting history, users can\nbetter understand the impact of prompt changes and have a more effective\ncontrol of image generation. A quantitative user study with eleven amateur\nparticipants and qualitative interviews with five professionals and one amateur\nuser were conducted to evaluate the effectiveness of PrompTHis. The results\ndemonstrate PrompTHis can help users review the prompt history, make sense of\nthe model, and plan their creative process.",
        "updated": "2024-03-14 17:52:17 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.09615v1"
    },
    {
        "title": "pARam: Leveraging Parametric Design in Extended Reality to Support the Personalization of Artifacts for Personal Fabrication",
        "authors": "Evgeny StemasovSimon DemharterMax RädlerJan GugenheimerEnrico Rukzio",
        "links": "http://dx.doi.org/10.1145/3613904.3642083",
        "entry_id": "http://arxiv.org/abs/2403.09607v1",
        "pdf_url": "http://arxiv.org/pdf/2403.09607v1",
        "summary": "Extended Reality (XR) allows in-situ previewing of designs to be manufactured\nthrough Personal Fabrication (PF). These in-situ interactions exhibit\nadvantages for PF, like incorporating the environment into the design process.\nHowever, design-for-fabrication in XR often happens through either highly\ncomplex 3D-modeling or is reduced to rudimentary adaptations of crowd-sourced\nmodels. We present pARam, a tool combining parametric designs (PDs) and XR,\nenabling in-situ configuration of artifacts for PF. In contrast to modeling- or\nsearch-focused approaches, pARam supports customization through embodied and\npractical inputs (e.g., gestures, recommendations) and evaluation (e.g.,\nlighting estimation) without demanding complex 3D-modeling skills. We\nimplemented pARam for HoloLens 2 and evaluated it (n=20), comparing XR and\ndesktop conditions. Users succeeded in choosing context-related parameters and\ntook their environment into account for their configuration using pARam. We\nreflect on the prospects and challenges of PDs in XR to streamline complex\ndesign methods for PF while retaining suitable expressivity.",
        "updated": "2024-03-14 17:48:30 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.09607v1"
    },
    {
        "title": "DungeonMaker: Embedding Tangible Creation and Destruction in Hybrid Board Games through Personal Fabrication Technology",
        "authors": "Evgeny StemasovTobias WagnerAli AskariJessica JanekOmid RajabiAnja SchikorrJulian FrommelJan GugenheimerEnrico Rukzio",
        "links": "http://dx.doi.org/10.1145/3613904.3642243",
        "entry_id": "http://arxiv.org/abs/2403.09592v1",
        "pdf_url": "http://arxiv.org/pdf/2403.09592v1",
        "summary": "Hybrid board games (HBGs) augment their analog origins digitally (e.g.,\nthrough apps) and are an increasingly popular pastime activity. Continuous\nworld and character development and customization, known to facilitate\nengagement in video games, remain rare in HBGs. If present, they happen\ndigitally or imaginarily, often leaving physical aspects generic. We developed\nDungeonMaker, a fabrication-augmented HBG bridging physical and digital game\nelements: 1) the setup narrates a story and projects a digital game board onto\na laser cutter; 2) DungeonMaker assesses player-crafted artifacts; 3)\nDungeonMaker's modified laser head senses and moves player- and non-player\nfigures, and 4) can physically damage figures. An evaluation (n=4x3) indicated\nthat DungeonMaker provides an engaging experience, may support players'\nconnection to their figures, and potentially spark novices' interest in\nfabrication. DungeonMaker provides a rich constellation to play HBGs by\nblending aspects of craft and automation to couple the physical and digital\nelements of an HBG tightly.",
        "updated": "2024-03-14 17:35:19 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.09592v1"
    },
    {
        "title": "\"Are You Really Sure?\" Understanding the Effects of Human Self-Confidence Calibration in AI-Assisted Decision Making",
        "authors": "Shuai MaXinru WangYing LeiChuhan ShiMing YinXiaojuan Ma",
        "links": "http://arxiv.org/abs/2403.09552v1",
        "entry_id": "http://arxiv.org/abs/2403.09552v1",
        "pdf_url": "http://arxiv.org/pdf/2403.09552v1",
        "summary": "In AI-assisted decision-making, it is crucial but challenging for humans to\nachieve appropriate reliance on AI. This paper approaches this problem from a\nhuman-centered perspective, \"human self-confidence calibration\". We begin by\nproposing an analytical framework to highlight the importance of calibrated\nhuman self-confidence. In our first study, we explore the relationship between\nhuman self-confidence appropriateness and reliance appropriateness. Then in our\nsecond study, We propose three calibration mechanisms and compare their effects\non humans' self-confidence and user experience. Subsequently, our third study\ninvestigates the effects of self-confidence calibration on AI-assisted\ndecision-making. Results show that calibrating human self-confidence enhances\nhuman-AI team performance and encourages more rational reliance on AI (in some\naspects) compared to uncalibrated baselines. Finally, we discuss our main\nfindings and provide implications for designing future AI-assisted\ndecision-making interfaces.",
        "updated": "2024-03-14 16:39:23 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.09552v1"
    },
    {
        "title": "Effect of external characteristics of a virtual human being during the use of a computer-assisted therapy tool",
        "authors": "Navid AshrafiVanessa NeuhausFrancesco VonaNicolina Laura PeperkornYoussef ShibanJan-Niklas Voigt-Antons",
        "links": "http://arxiv.org/abs/2403.09544v1",
        "entry_id": "http://arxiv.org/abs/2403.09544v1",
        "pdf_url": "http://arxiv.org/pdf/2403.09544v1",
        "summary": "Identification within media, whether with real or fictional characters,\nsignificantly impacts users, shaping their behavior and enriching their social\nand emotional experiences. Immersive media, like video games, utilize virtual\nentities such as agents, avatars, or NPCs to connect users with virtual worlds,\nfostering a heightened sense of immersion and identification. However,\nchallenges arise in visually representing these entities, with design decisions\ncrucial for enhancing user interaction. Recent research highlights the\npotential of user-defined design, or customization, which goes beyond mere\nvisual resemblance to the user. Understanding how identification with virtual\navatars influences user experiences, especially in psychological interventions,\nis pivotal. In a study exploring this, 22 participants created virtual agents\neither similar or dissimilar to themselves, which then addressed their\ndysfunctional thoughts. Results indicate that similarity between users and\nvirtual agents not only boosts identification but also positively impacts\nemotions and motivation, enhancing interest and enjoyment. This study sheds\nlight on the significance of customization and identification, particularly in\ncomputer-assisted therapy tools, underscoring the importance of visual design\nfor optimizing user experiences.",
        "updated": "2024-03-14 16:31:18 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.09544v1"
    }
]