[
    {
        "title": "Humanoid Robots at work: where are we ?",
        "authors": "Fabrice R. Noreils",
        "links": "http://arxiv.org/abs/2404.04249v1",
        "entry_id": "http://arxiv.org/abs/2404.04249v1",
        "pdf_url": "http://arxiv.org/pdf/2404.04249v1",
        "summary": "Launched by Elon Musk and its Optimus, we are witnessing a new race in which\nmany companies have already engaged. The objective it to put at work a new\ngeneration of humanoid robots in demanding industrial environments within 2 or\n3 years. Is this objective realistic ? The aim of this document and its main\ncontributions is to provide some hints by covering the following topics: First\nan analysis of 12 companies based on eight criteria that will help us to\ndistinguish companies based on their maturity and approach to the market;\nsecond as these humanoids are very complex systems we will provide an overview\nof the technological challenges to be addressed; third when humanoids are\ndeployed at scale, Operation and Maintenance become critical and the we will\nexplore what is new with these complex machines; Finally Pilots are the last\nstep to test the feasibility of a new system before mass deployment. This is an\nimportant step to test the maturity of a product and the strategy of the\nhumanoid supplier to address a market and two pragmatic approaches will be\ndiscussed.",
        "updated": "2024-04-05 17:54:12 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.04249v1"
    },
    {
        "title": "Social Skill Training with Large Language Models",
        "authors": "Diyi YangCaleb ZiemsWilliam HeldOmar ShaikhMichael S. BernsteinJohn Mitchell",
        "links": "http://arxiv.org/abs/2404.04204v1",
        "entry_id": "http://arxiv.org/abs/2404.04204v1",
        "pdf_url": "http://arxiv.org/pdf/2404.04204v1",
        "summary": "People rely on social skills like conflict resolution to communicate\neffectively and to thrive in both work and personal life. However, practice\nenvironments for social skills are typically out of reach for most people. How\ncan we make social skill training more available, accessible, and inviting?\nDrawing upon interdisciplinary research from communication and psychology, this\nperspective paper identifies social skill barriers to enter specialized fields.\nThen we present a solution that leverages large language models for social\nskill training via a generic framework. Our AI Partner, AI Mentor framework\nmerges experiential learning with realistic practice and tailored feedback.\nThis work ultimately calls for cross-disciplinary innovation to address the\nbroader implications for workforce development and social equality.",
        "updated": "2024-04-05 16:29:58 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.04204v1"
    },
    {
        "title": "Designing Robots to Help Women",
        "authors": "Martin CooneyLena KlasénFernando Alonso-Fernandez",
        "links": "http://arxiv.org/abs/2404.04123v1",
        "entry_id": "http://arxiv.org/abs/2404.04123v1",
        "pdf_url": "http://arxiv.org/pdf/2404.04123v1",
        "summary": "Robots are being designed to help people in an increasing variety of\nsettings--but seemingly little attention has been given so far to the specific\nneeds of women, who represent roughly half of the world's population but are\nhighly underrepresented in robotics. Here we used a speculative prototyping\napproach to explore this expansive design space: First, we identified some\npotential challenges of interest, including crimes and illnesses that\ndisproportionately affect women, as well as potential opportunities for\ndesigners, which were visualized in five sketches. Then, one of the sketched\nscenarios was further explored by developing a prototype, of a robotic helper\ndrone equipped with computer vision to detect hidden cameras that could be used\nto spy on women. While object detection introduced some errors, hidden cameras\nwere identified with a reasonable accuracy of 80\\% (Intersection over Union\n(IoU) score: 0.40). Our aim is that the identified challenges and opportunities\ncould help spark discussion and inspire designers, toward realizing a safer,\nmore inclusive future through responsible use of technology.",
        "updated": "2024-04-05 14:22:56 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.04123v1"
    },
    {
        "title": "ChoreoVis: Planning and Assessing Formations in Dance Choreographies",
        "authors": "Samuel BeckNina DoerrKuno KurzhalsAlexander RiedlingerFabian SchmiererMichael SedlmairSteffen Koch",
        "links": "http://arxiv.org/abs/2404.04100v1",
        "entry_id": "http://arxiv.org/abs/2404.04100v1",
        "pdf_url": "http://arxiv.org/pdf/2404.04100v1",
        "summary": "Sports visualization has developed into an active research field over the\nlast decades. Many approaches focus on analyzing movement data recorded from\nunstructured situations, such as soccer. For the analysis of choreographed\nactivities like formation dancing, however, the goal differs, as dancers follow\nspecific formations in coordinated movement trajectories. To date, little work\nexists on how visual analytics methods can support such choreographed\nperformances. To fill this gap, we introduce a new visual approach for planning\nand assessing dance choreographies. In terms of planning choreographies, we\ncontribute a web application with interactive authoring tools and views for the\ndancers' positions and orientations, movement trajectories, poses, dance floor\nutilization, and movement distances. For assessing dancers' real-world movement\ntrajectories, extracted by manual bounding box annotations, we developed a\ntimeline showing aggregated trajectory deviations and a dance floor view for\ndetailed trajectory comparison. Our approach was developed and evaluated in\ncollaboration with dance instructors, showing that introducing visual analytics\ninto this domain promises improvements in training efficiency for the future.",
        "updated": "2024-04-05 13:51:26 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.04100v1"
    },
    {
        "title": "Hierarchical Neural Additive Models for Interpretable Demand Forecasts",
        "authors": "Leif FeddersenCatherine Cleophas",
        "links": "http://arxiv.org/abs/2404.04070v1",
        "entry_id": "http://arxiv.org/abs/2404.04070v1",
        "pdf_url": "http://arxiv.org/pdf/2404.04070v1",
        "summary": "Demand forecasts are the crucial basis for numerous business decisions,\nranging from inventory management to strategic facility planning. While machine\nlearning (ML) approaches offer accuracy gains, their interpretability and\nacceptance are notoriously lacking. Addressing this dilemma, we introduce\nHierarchical Neural Additive Models for time series (HNAM). HNAM expands upon\nNeural Additive Models (NAM) by introducing a time-series specific additive\nmodel with a level and interacting covariate components.\n  Covariate interactions are only allowed according to a user-specified\ninteraction hierarchy. For example, weekday effects may be estimated\nindependently of other covariates, whereas a holiday effect may depend on the\nweekday and an additional promotion may depend on both former covariates that\nare lower in the interaction hierarchy.\n  Thereby, HNAM yields an intuitive forecasting interface in which analysts can\nobserve the contribution for each known covariate. We evaluate the proposed\napproach and benchmark its performance against other state-of-the-art machine\nlearning and statistical models extensively on real-world retail data. The\nresults reveal that HNAM offers competitive prediction performance whilst\nproviding plausible explanations.",
        "updated": "2024-04-05 12:54:09 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.04070v1"
    }
]