[
    {
        "title": "CMP: Cooperative Motion Prediction with Multi-Agent Communication",
        "authors": "Zhuoyuan WuYuping WangHengbo MaZhaowei LiHang QiuJiachen Li",
        "links": "http://arxiv.org/abs/2403.17916v1",
        "entry_id": "http://arxiv.org/abs/2403.17916v1",
        "pdf_url": "http://arxiv.org/pdf/2403.17916v1",
        "summary": "The confluence of the advancement of Autonomous Vehicles (AVs) and the\nmaturity of Vehicle-to-Everything (V2X) communication has enabled the\ncapability of cooperative connected and automated vehicles (CAVs). Building on\ntop of cooperative perception, this paper explores the feasibility and\neffectiveness of cooperative motion prediction. Our method, CMP, takes LiDAR\nsignals as input to enhance tracking and prediction capabilities. Unlike\nprevious work that focuses separately on either cooperative perception or\nmotion prediction, our framework, to the best of our knowledge, is the first to\naddress the unified problem where CAVs share information in both perception and\nprediction modules. Incorporated into our design is the unique capability to\ntolerate realistic V2X bandwidth limitations and transmission delays, while\ndealing with bulky perception representations. We also propose a prediction\naggregation module, which unifies the predictions obtained by different CAVs\nand generates the final prediction. Through extensive experiments and ablation\nstudies, we demonstrate the effectiveness of our method in cooperative\nperception, tracking, and motion prediction tasks. In particular, CMP reduces\nthe average prediction error by 17.2\\% with fewer missing detections compared\nwith the no cooperation setting. Our work marks a significant step forward in\nthe cooperative capabilities of CAVs, showcasing enhanced performance in\ncomplex scenarios.",
        "updated": "2024-03-26 17:53:27 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.17916v1"
    },
    {
        "title": "Scenario-Based Curriculum Generation for Multi-Agent Autonomous Driving",
        "authors": "Axel BrunnbauerLuigi BerducciPeter PrillerDejan NickovicRadu Grosu",
        "links": "http://arxiv.org/abs/2403.17805v1",
        "entry_id": "http://arxiv.org/abs/2403.17805v1",
        "pdf_url": "http://arxiv.org/pdf/2403.17805v1",
        "summary": "The automated generation of diverse and complex training scenarios has been\nan important ingredient in many complex learning tasks. Especially in\nreal-world application domains, such as autonomous driving, auto-curriculum\ngeneration is considered vital for obtaining robust and general policies.\nHowever, crafting traffic scenarios with multiple, heterogeneous agents is\ntypically considered as a tedious and time-consuming task, especially in more\ncomplex simulation environments. In our work, we introduce MATS-Gym, a\nMulti-Agent Traffic Scenario framework to train agents in CARLA, a\nhigh-fidelity driving simulator. MATS-Gym is a multi-agent training framework\nfor autonomous driving that uses partial scenario specifications to generate\ntraffic scenarios with variable numbers of agents. This paper unifies various\nexisting approaches to traffic scenario description into a single training\nframework and demonstrates how it can be integrated with techniques from\nunsupervised environment design to automate the generation of adaptive\nauto-curricula. The code is available at\nhttps://github.com/AutonomousDrivingExaminer/mats-gym.",
        "updated": "2024-03-26 15:42:04 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.17805v1"
    },
    {
        "title": "Prioritize Team Actions: Multi-Agent Temporal Logic Task Planning with Ordering Constraints",
        "authors": "Bowen YeJianing ZhaoShaoyuan LiXiang Yin",
        "links": "http://arxiv.org/abs/2403.17704v1",
        "entry_id": "http://arxiv.org/abs/2403.17704v1",
        "pdf_url": "http://arxiv.org/pdf/2403.17704v1",
        "summary": "In this paper, we investigate the problem of linear temporal logic (LTL) path\nplanning for multi-agent systems, introducing the new concept of \\emph{ordering\nconstraints}. Specifically, we consider a generic objective function that is\ndefined for the path of each individual agent. The primary objective is to find\na global plan for the team of agents, ensuring they collectively meet the\nspecified LTL requirements. Simultaneously, we aim to maintain a pre-determined\norder in the values of the objective function for each agent, which we refer to\nas the ordering constraints. This new requirement stems from scenarios like\nsecurity-aware planning, where relative orders outweigh absolute values in\nimportance. We present an efficient algorithm to solve this problem, supported\nby proofs of correctness that demonstrate the optimality of our solution.\nAdditionally, we provide a case study in security-aware path planning to\nillustrate the practicality and effectiveness of our proposed approach.",
        "updated": "2024-03-26 13:49:48 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.17704v1"
    },
    {
        "title": "Depending on yourself when you should: Mentoring LLM with RL agents to become the master in cybersecurity games",
        "authors": "Yikuan YanYaolun ZhangKeman Huang",
        "links": "http://arxiv.org/abs/2403.17674v1",
        "entry_id": "http://arxiv.org/abs/2403.17674v1",
        "pdf_url": "http://arxiv.org/pdf/2403.17674v1",
        "summary": "Integrating LLM and reinforcement learning (RL) agent effectively to achieve\ncomplementary performance is critical in high stake tasks like cybersecurity\noperations. In this study, we introduce SecurityBot, a LLM agent mentored by\npre-trained RL agents, to support cybersecurity operations. In particularly,\nthe LLM agent is supported with a profile module to generated behavior\nguidelines, a memory module to accumulate local experiences, a reflection\nmodule to re-evaluate choices, and an action module to reduce action space.\nAdditionally, it adopts the collaboration mechanism to take suggestions from\npre-trained RL agents, including a cursor for dynamic suggestion taken, an\naggregator for multiple mentors' suggestions ranking and a caller for proactive\nsuggestion asking. Building on the CybORG experiment framework, our experiences\nshow that SecurityBot demonstrates significant performance improvement compared\nwith LLM or RL standalone, achieving the complementary performance in the\ncybersecurity games.",
        "updated": "2024-03-26 13:02:46 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.17674v1"
    },
    {
        "title": "Prediction-sharing During Training and Inference",
        "authors": "Yotam GafniRonen GradwohlMoshe Tennenholtz",
        "links": "http://arxiv.org/abs/2403.17515v1",
        "entry_id": "http://arxiv.org/abs/2403.17515v1",
        "pdf_url": "http://arxiv.org/pdf/2403.17515v1",
        "summary": "Two firms are engaged in a competitive prediction task. Each firm has two\nsources of data -- labeled historical data and unlabeled inference-time data --\nand uses the former to derive a prediction model, and the latter to make\npredictions on new instances. We study data-sharing contracts between the\nfirms. The novelty of our study is to introduce and highlight the differences\nbetween contracts that share prediction models only, contracts to share\ninference-time predictions only, and contracts to share both. Our analysis\nproceeds on three levels. First, we develop a general Bayesian framework that\nfacilitates our study. Second, we narrow our focus to two natural settings\nwithin this framework: (i) a setting in which the accuracy of each firm's\nprediction model is common knowledge, but the correlation between the\nrespective models is unknown; and (ii) a setting in which two hypotheses exist\nregarding the optimal predictor, and one of the firms has a structural\nadvantage in deducing it. Within these two settings we study optimal contract\nchoice. More specifically, we find the individually rational and Pareto-optimal\ncontracts for some notable cases, and describe specific settings where each of\nthe different sharing contracts emerge as optimal. Finally, in the third level\nof our analysis we demonstrate the applicability of our concepts in a synthetic\nsimulation using real loan data.",
        "updated": "2024-03-26 09:18:50 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.17515v1"
    }
]