[
    {
        "title": "Towards Democratized Flood Risk Management: An Advanced AI Assistant Enabled by GPT-4 for Enhanced Interpretability and Public Engagement",
        "authors": "Rafaela MarteloRuo-Qian Wang",
        "links": "http://arxiv.org/abs/2403.03188v1",
        "entry_id": "http://arxiv.org/abs/2403.03188v1",
        "pdf_url": "http://arxiv.org/pdf/2403.03188v1",
        "summary": "Real-time flood forecasting plays a crucial role in enabling timely and\neffective emergency responses. However, a significant challenge lies in\nbridging the gap between complex numerical flood models and practical\ndecision-making. Decision-makers often rely on experts to interpret these\nmodels for optimizing flood mitigation strategies. And the public requires\ncomplex techniques to inquiry and understand socio-cultural and institutional\nfactors, often hinders the public's understanding of flood risks. To overcome\nthese challenges, our study introduces an innovative solution: a customized AI\nAssistant powered by the GPT-4 Large Language Model. This AI Assistant is\ndesigned to facilitate effective communication between decision-makers, the\ngeneral public, and flood forecasters, without the requirement of specialized\nknowledge. The new framework utilizes GPT-4's advanced natural language\nunderstanding and function calling capabilities to provide immediate flood\nalerts and respond to various flood-related inquiries. Our developed prototype\nintegrates real-time flood warnings with flood maps and social vulnerability\ndata. It also effectively translates complex flood zone information into\nactionable risk management advice. To assess its performance, we evaluated the\nprototype using six criteria within three main categories: relevance, error\nresilience, and understanding of context. Our research marks a significant step\ntowards a more accessible and user-friendly approach in flood risk management.\nThis study highlights the potential of advanced AI tools like GPT-4 in\ndemocratizing information and enhancing public engagement in critical social\nand environmental issues.",
        "updated": "2024-03-05 18:24:52 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.03188v1"
    },
    {
        "title": "KnowAgent: Knowledge-Augmented Planning for LLM-Based Agents",
        "authors": "Yuqi ZhuShuofei QiaoYixin OuShumin DengNingyu ZhangShiwei LyuYue ShenLei LiangJinjie GuHuajun Chen",
        "links": "http://arxiv.org/abs/2403.03101v1",
        "entry_id": "http://arxiv.org/abs/2403.03101v1",
        "pdf_url": "http://arxiv.org/pdf/2403.03101v1",
        "summary": "Large Language Models (LLMs) have demonstrated great potential in complex\nreasoning tasks, yet they fall short when tackling more sophisticated\nchallenges, especially when interacting with environments through generating\nexecutable actions. This inadequacy primarily stems from the lack of built-in\naction knowledge in language agents, which fails to effectively guide the\nplanning trajectories during task solving and results in planning\nhallucination. To address this issue, we introduce KnowAgent, a novel approach\ndesigned to enhance the planning capabilities of LLMs by incorporating explicit\naction knowledge. Specifically, KnowAgent employs an action knowledge base and\na knowledgeable self-learning strategy to constrain the action path during\nplanning, enabling more reasonable trajectory synthesis, and thereby enhancing\nthe planning performance of language agents. Experimental results on HotpotQA\nand ALFWorld based on various backbone models demonstrate that KnowAgent can\nachieve comparable or superior performance to existing baselines. Further\nanalysis indicates the effectiveness of KnowAgent in terms of planning\nhallucinations mitigation. Code is available in\nhttps://github.com/zjunlp/KnowAgent.",
        "updated": "2024-03-05 16:39:12 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.03101v1"
    },
    {
        "title": "Tappy: Predicting Tap Accuracy of User-Interface Elements by Reverse-Engineering Webpage Structures",
        "authors": "Hiroki UsubaJunichi SatoNaomi SasayaShota YamanakaFumiya Yamashita",
        "links": "http://arxiv.org/abs/2403.03097v2",
        "entry_id": "http://arxiv.org/abs/2403.03097v2",
        "pdf_url": "http://arxiv.org/pdf/2403.03097v2",
        "summary": "Selecting a UI element is a fundamental operation on webpages, and the ease\nof tapping a target object has a significant impact on usability. It is thus\nimportant to analyze existing UIs in order to design better ones. However,\ntools proposed in previous studies cannot identify whether an element is\ntappable on modern webpages. In this study, we developed Tappy that can\nidentify tappable UI elements on webpages and estimate the tap-success rate\nbased on the element size. Our interviews of professional designers and\nengineers showed that Tappy helped discussions of UI design on the basis of its\nquantitative metric. Furthermore, we have launched this tool to be freely\navailable to external users, so readers can access Tappy by visiting the\nwebsite (https://tappy.yahoo.co.jp).",
        "updated": "2024-03-06 02:29:02 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.03097v2"
    },
    {
        "title": "Online Learning of Human Constraints from Feedback in Shared Autonomy",
        "authors": "Shibei ZhuTran Nguyen LeSamuel KaskiVille Kyrki",
        "links": "http://arxiv.org/abs/2403.02974v1",
        "entry_id": "http://arxiv.org/abs/2403.02974v1",
        "pdf_url": "http://arxiv.org/pdf/2403.02974v1",
        "summary": "Real-time collaboration with humans poses challenges due to the different\nbehavior patterns of humans resulting from diverse physical constraints.\nExisting works typically focus on learning safety constraints for\ncollaboration, or how to divide and distribute the subtasks between the\nparticipating agents to carry out the main task. In contrast, we propose to\nlearn a human constraints model that, in addition, considers the diverse\nbehaviors of different human operators. We consider a type of collaboration in\na shared-autonomy fashion, where both a human operator and an assistive robot\nact simultaneously in the same task space that affects each other's actions.\nThe task of the assistive agent is to augment the skill of humans to perform a\nshared task by supporting humans as much as possible, both in terms of reducing\nthe workload and minimizing the discomfort for the human operator. Therefore,\nwe propose an augmentative assistant agent capable of learning and adapting to\nhuman physical constraints, aligning its actions with the ergonomic preferences\nand limitations of the human operator.",
        "updated": "2024-03-05 13:53:48 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.02974v1"
    },
    {
        "title": "Bodioid: philosophical reflections on the hybrid of bodies and artefacts towards post-human",
        "authors": "Jiang XuGang SunJingyu XuPujie Su",
        "links": "http://arxiv.org/abs/2403.02972v1",
        "entry_id": "http://arxiv.org/abs/2403.02972v1",
        "pdf_url": "http://arxiv.org/pdf/2403.02972v1",
        "summary": "The advent of the post-human era has blurred the boundary between the body\nand artifacts. Further, external materials and information are more deeply\nintegrated into the body, making emerging technology a key driving force for\nshaping post-human existence and promoting bodily evolution. Based on this,\nthis study analyses the transformation process of three technological forms,\nnamely tools, machines, and cyborgs, and reveals the construction of bodies and\nartifacts. From the phenomenological perspective, the essences of body and\nartifact existences are reflected upon, and the existence is construction\nviewpoint is proposed. Furthermore, a technological design concept, bodioid, is\nproposed to meticulously depict the characteristics of integrating similarities\nand differences towards unity between the body and artifacts, based on the\ntheoretical foundation of technology mediation and the materialization of\nmorality. Finally, through analogizing the organizational form of language, the\ntwo key forms and specific mechanisms of bodioid construction, namely extension\nand mirroring, are indicated. With this in mind, the post-human existence\nlandscape is discussed with the objective of providing theoretical insights\ninto the study of the underlying philosophical principles of technological\ndesign.",
        "updated": "2024-03-05 13:50:25 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.02972v1"
    }
]