[
    {
        "title": "KnowAgent: Knowledge-Augmented Planning for LLM-Based Agents",
        "authors": "Yuqi ZhuShuofei QiaoYixin OuShumin DengNingyu ZhangShiwei LyuYue ShenLei LiangJinjie GuHuajun Chen",
        "links": "http://arxiv.org/abs/2403.03101v1",
        "entry_id": "http://arxiv.org/abs/2403.03101v1",
        "pdf_url": "http://arxiv.org/pdf/2403.03101v1",
        "summary": "Large Language Models (LLMs) have demonstrated great potential in complex\nreasoning tasks, yet they fall short when tackling more sophisticated\nchallenges, especially when interacting with environments through generating\nexecutable actions. This inadequacy primarily stems from the lack of built-in\naction knowledge in language agents, which fails to effectively guide the\nplanning trajectories during task solving and results in planning\nhallucination. To address this issue, we introduce KnowAgent, a novel approach\ndesigned to enhance the planning capabilities of LLMs by incorporating explicit\naction knowledge. Specifically, KnowAgent employs an action knowledge base and\na knowledgeable self-learning strategy to constrain the action path during\nplanning, enabling more reasonable trajectory synthesis, and thereby enhancing\nthe planning performance of language agents. Experimental results on HotpotQA\nand ALFWorld based on various backbone models demonstrate that KnowAgent can\nachieve comparable or superior performance to existing baselines. Further\nanalysis indicates the effectiveness of KnowAgent in terms of planning\nhallucinations mitigation. Code is available in\nhttps://github.com/zjunlp/KnowAgent.",
        "updated": "2024-03-05 16:39:12 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.03101v1"
    },
    {
        "title": "Distributed Policy Gradient for Linear Quadratic Networked Control with Limited Communication Range",
        "authors": "Yuzi YanYuan Shen",
        "links": "http://arxiv.org/abs/2403.03055v1",
        "entry_id": "http://arxiv.org/abs/2403.03055v1",
        "pdf_url": "http://arxiv.org/pdf/2403.03055v1",
        "summary": "This paper proposes a scalable distributed policy gradient method and proves\nits convergence to near-optimal solution in multi-agent linear quadratic\nnetworked systems. The agents engage within a specified network under local\ncommunication constraints, implying that each agent can only exchange\ninformation with a limited number of neighboring agents. On the underlying\ngraph of the network, each agent implements its control input depending on its\nnearby neighbors' states in the linear quadratic control setting. We show that\nit is possible to approximate the exact gradient only using local information.\nCompared with the centralized optimal controller, the performance gap decreases\nto zero exponentially as the communication and control ranges increase. We also\ndemonstrate how increasing the communication range enhances system stability in\nthe gradient descent process, thereby elucidating a critical trade-off. The\nsimulation results verify our theoretical findings.",
        "updated": "2024-03-05 15:38:54 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.03055v1"
    },
    {
        "title": "Policy Space Response Oracles: A Survey",
        "authors": "Ariyan BighashdelYongzhao WangStephen McAleerRahul SavaniFrans A. Oliehoek",
        "links": "http://arxiv.org/abs/2403.02227v1",
        "entry_id": "http://arxiv.org/abs/2403.02227v1",
        "pdf_url": "http://arxiv.org/pdf/2403.02227v1",
        "summary": "In game theory, a game refers to a model of interaction among rational\ndecision-makers or players, making choices with the goal of achieving their\nindividual objectives. Understanding their behavior in games is often referred\nto as game reasoning. This survey provides a comprehensive overview of a\nfast-developing game-reasoning framework for large games, known as Policy Space\nResponse Oracles (PSRO). We first motivate PSRO, provide historical context,\nand position PSRO within game-reasoning approaches. We then focus on the\nstrategy exploration issue for PSRO, the challenge of assembling an effective\nstrategy portfolio for modeling the underlying game with minimum computational\ncost. We also survey current research directions for enhancing the efficiency\nof PSRO, and explore the applications of PSRO across various domains. We\nconclude by discussing open questions and future research.",
        "updated": "2024-03-04 17:15:09 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.02227v1"
    },
    {
        "title": "VITAMIN: A Compositional Framework for Model Checking of Multi-Agent Systems",
        "authors": "Angelo FerrandoVadim Malvone",
        "links": "http://arxiv.org/abs/2403.02170v1",
        "entry_id": "http://arxiv.org/abs/2403.02170v1",
        "pdf_url": "http://arxiv.org/pdf/2403.02170v1",
        "summary": "The verification of Multi-Agent Systems (MAS) poses a significant challenge.\nVarious approaches and methodologies exist to address this challenge; however,\ntools that support them are not always readily available. Even when such tools\nare accessible, they tend to be hard-coded, lacking in compositionality, and\nchallenging to use due to a steep learning curve. In this paper, we introduce a\nmethodology designed for the formal verification of MAS in a modular and\nversatile manner, along with an initial prototype, that we named VITAMIN.\nUnlike existing verification methodologies and frameworks for MAS, VITAMIN is\nconstructed for easy extension to accommodate various logics (for specifying\nthe properties to verify) and models (for determining on what to verify such\nproperties).",
        "updated": "2024-03-04 16:16:30 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.02170v1"
    },
    {
        "title": "Cognition is All You Need -- The Next Layer of AI Above Large Language Models",
        "authors": "Nova SpivackSam DouglasMichelle CramesTim Connors",
        "links": "http://arxiv.org/abs/2403.02164v2",
        "entry_id": "http://arxiv.org/abs/2403.02164v2",
        "pdf_url": "http://arxiv.org/pdf/2403.02164v2",
        "summary": "Recent studies of the applications of conversational AI tools, such as\nchatbots powered by large language models, to complex real-world knowledge work\nhave shown limitations related to reasoning and multi-step problem solving.\nSpecifically, while existing chatbots simulate shallow reasoning and\nunderstanding they are prone to errors as problem complexity increases. The\nfailure of these systems to address complex knowledge work is due to the fact\nthat they do not perform any actual cognition. In this position paper, we\npresent Cognitive AI, a higher-level framework for implementing\nprogrammatically defined neuro-symbolic cognition above and outside of large\nlanguage models. Specifically, we propose a dual-layer functional architecture\nfor Cognitive AI that serves as a roadmap for AI systems that can perform\ncomplex multi-step knowledge work. We propose that Cognitive AI is a necessary\nprecursor for the evolution of higher forms of AI, such as AGI, and\nspecifically claim that AGI cannot be achieved by probabilistic approaches on\ntheir own. We conclude with a discussion of the implications for large language\nmodels, adoption cycles in AI, and commercial Cognitive AI development.",
        "updated": "2024-03-05 10:23:52 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.02164v2"
    }
]