[
    {
        "title": "Augmented Voices: An Augmented Reality Experience Highlighting the Social Injustices of Gender-Based Violence in the Muslim South-Asian Diaspora",
        "authors": "Hamida Khatri",
        "links": "http://arxiv.org/abs/2404.15239v1",
        "entry_id": "http://arxiv.org/abs/2404.15239v1",
        "pdf_url": "http://arxiv.org/pdf/2404.15239v1",
        "summary": "This paper delves into the distressing prevalence of gender-based violence\n(GBV) and its deep-seated psychological ramifications, particularly among\nMuslim South Asian women living in diasporic communities. Despite the gravity\nof GBV, these women often face formidable barriers in voicing their experiences\nand accessing support. \"Augmented Voices\" emerges as a technological beacon,\nharnessing the potential of augmented reality (AR) to bridge the digital and\nphysical realms through mobile devices, enhancing the visibility of these\noften-silenced voices. With its technological motivation firmly anchored in the\nconvergence of AR and real-world interactions, \"Augmented Voices\" offers a\ndigital platform where storytelling acts as a catalyst, bringing to the fore\nthe experiences shared by these women. By superimposing their narratives onto\nphysical locations via Geographic Information System (GIS) Mapping, the\napplication \"augments their voices\" in the diaspora, providing a conduit for\nexpression and solidarity. This project, currently at its developmental stage,\naspires to elevate the stories of GBV victims to a level where their struggles\nare not just heard but felt, forging a powerful connection between the user and\nthe narrative. It is designed to transcend the limitations of conventional\nstorytelling, creating an \"augmented\" reality where voices that are often muted\nby societal constraints can resonate powerfully. The project underscores the\nurgent imperative to confront GBV, catalyzing societal transformation and\nfostering robust support networks for those in the margins. It is a pioneering\nexample of how technology can become a formidable ally in the fight for social\njustice and the empowerment of the oppressed. Additionally, this paper delves\ninto the AR workflow illustrating its relevance and contribution to the broader\ntheme of site-specific AR for social justice.",
        "updated": "2024-04-23 17:17:52 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.15239v1"
    },
    {
        "title": "Evaluating Physician-AI Interaction for Cancer Management: Paving the Path towards Precision Oncology",
        "authors": "Zeshan HussainBarbara D. LamFernando A. Acosta-PerezIrbaz Bin RiazMaia JacobsAndrew J. YeeDavid Sontag",
        "links": "http://arxiv.org/abs/2404.15187v1",
        "entry_id": "http://arxiv.org/abs/2404.15187v1",
        "pdf_url": "http://arxiv.org/pdf/2404.15187v1",
        "summary": "We evaluated how clinicians approach clinical decision-making when given\nfindings from both randomized controlled trials (RCTs) and machine learning\n(ML) models. To do so, we designed a clinical decision support system (CDSS)\nthat displays survival curves and adverse event information from a synthetic\nRCT and ML model for 12 patients with multiple myeloma. We conducted an\ninterventional study in a simulated setting to evaluate how clinicians\nsynthesized the available data to make treatment decisions. Participants were\ninvited to participate in a follow-up interview to discuss their choices in an\nopen-ended format. When ML model results were concordant with RCT results,\nphysicians had increased confidence in treatment choice compared to when they\nwere given RCT results alone. When ML model results were discordant with RCT\nresults, the majority of physicians followed the ML model recommendation in\ntheir treatment selection. Perceived reliability of the ML model was\nconsistently higher after physicians were provided with data on how it was\ntrained and validated. Follow-up interviews revealed four major themes: (1)\nvariability in what variables participants used for decision-making, (2)\nperceived advantages to an ML model over RCT data, (3) uncertainty around\ndecision-making when the ML model quality was poor, and (4) perception that\nthis type of study is an important thought exercise for clinicians. Overall,\nML-based CDSSs have the potential to change treatment decisions in cancer\nmanagement. However, meticulous development and validation of these systems as\nwell as clinician training are required before deployment.",
        "updated": "2024-04-23 16:28:03 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.15187v1"
    },
    {
        "title": "Voice Passing : a Non-Binary Voice Gender Prediction System for evaluating Transgender voice transition",
        "authors": "David DoukhanSimon DevauchelleLucile Girard-MonneronMía Chávez RuzV. ChaddoukIsabelle WagnerAlbert Rilliard",
        "links": "http://dx.doi.org/10.21437/Interspeech.2023-1835",
        "entry_id": "http://arxiv.org/abs/2404.15176v1",
        "pdf_url": "http://arxiv.org/pdf/2404.15176v1",
        "summary": "This paper presents a software allowing to describe voices using a continuous\nVoice Femininity Percentage (VFP). This system is intended for transgender\nspeakers during their voice transition and for voice therapists supporting them\nin this process. A corpus of 41 French cis- and transgender speakers was\nrecorded. A perceptual evaluation allowed 57 participants to estimate the VFP\nfor each voice. Binary gender classification models were trained on external\ngender-balanced data and used on overlapping windows to obtain average gender\nprediction estimates, which were calibrated to predict VFP and obtained higher\naccuracy than $F_0$ or vocal track length-based models. Training data speaking\nstyle and DNN architecture were shown to impact VFP estimation. Accuracy of the\nmodels was affected by speakers' age. This highlights the importance of style,\nage, and the conception of gender as binary or not, to build adequate\nstatistical representations of cultural concepts.",
        "updated": "2024-04-23 16:15:39 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.15176v1"
    },
    {
        "title": "Lost in Magnitudes: Exploring the Design Space for Visualizing Data with Large Value Ranges",
        "authors": "Katerina BatziakoudiFlorent CabricStéphanie ReyJean-Daniel Fekete",
        "links": "http://arxiv.org/abs/2404.15150v1",
        "entry_id": "http://arxiv.org/abs/2404.15150v1",
        "pdf_url": "http://arxiv.org/pdf/2404.15150v1",
        "summary": "We explore the design space for the static visualization of datasets with\nquantitative attributes that vary over multiple orders of magnitude-we call\nthese attributes Orders of Magnitude Values (OMVs)-and provide design\nguidelines and recommendations on effective visual encodings for OMVs. Current\ncharts rely on linear or logarithmic scales to visualize values, leading to\nlimitations in performing simple tasks for OMVs. In particular, linear scales\nprevent the reading of smaller magnitudes and their comparisons, while\nlogarithmic scales are challenging for the general public to understand. Our\ndesign space leverages the approach of dividing OMVs into two different parts:\nmantissa and exponent, in a way similar to scientific notation. This separation\nallows for a visual encoding of both parts. For our exploration, we use four\ndatasets, each with two attributes: an OMV, divided into mantissa and exponent,\nand a second attribute that is nominal, ordinal, time, or quantitative. We\nstart from the original design space described by the Grammar of Graphics and\nsystematically generate all possible visualizations for these datasets,\nemploying different marks and visual channels. We refine this design space by\nenforcing integrity constraints from visualization and graphical perception\nliterature. Through a qualitative assessment of all viable combinations, we\ndiscuss the most effective visualizations for OMVs, focusing on channel and\ntask effectiveness. The article's main contributions are 1) the presentation of\nthe design space of OMVs, 2) the generation of a large number of OMV\nvisualizations, among which some are novel and effective, 3) the refined\ndefinition of a scale that we call E+M for OMVs, and 4) guidelines and\nrecommendations for designing effective OMV visualizations. These efforts aim\nto enrich visualization systems to better support data with OMVs and guide\nfuture research.",
        "updated": "2024-04-23 15:52:53 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.15150v1"
    },
    {
        "title": "Virtual Takeovers in the Metaverse: Interrogating Power in Our Past and Future(s) with Multi-Layered Narratives",
        "authors": "Heather Snyder QuinnJessa Dickinson",
        "links": "http://arxiv.org/abs/2404.15108v1",
        "entry_id": "http://arxiv.org/abs/2404.15108v1",
        "pdf_url": "http://arxiv.org/pdf/2404.15108v1",
        "summary": "Mariah is an augmented reality (AR) mobile application that exposes power\nstructures (e.g., capitalism, patriarchy, white supremacy) through storytelling\nand celebrates acts of resistance against them. People can use Mariah to\n\"legally trespass\" the metaverse as a form of protest. Mariah provides\nhistorical context to the user's physical surroundings by superimposing images\nand playing stories about people who have experienced, and resisted, injustice.\nWe share two implementations of Mariah that raise questions about free speech\nand property rights in the metaverse: (1) a protest against museums accepting\n\"dirty money\" from the opioid epidemic; and (2) a commemoration of sites where\npeople have resisted power structures. Mariah is a case study for how\nexperimenting with a technology in non-sanctioned ways (i.e., \"hacking\") can\nexpose ways that it might interact with, and potentially amplify, existing\npower structures.",
        "updated": "2024-04-23 15:02:31 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.15108v1"
    }
]