[
    {
        "title": "Estimation Network Design framework for efficient distributed optimization",
        "authors": "Mattia BianchiSergio Grammatico",
        "links": "http://arxiv.org/abs/2404.15273v1",
        "entry_id": "http://arxiv.org/abs/2404.15273v1",
        "pdf_url": "http://arxiv.org/pdf/2404.15273v1",
        "summary": "Distributed decision problems features a group of agents that can only\ncommunicate over a peer-to-peer network, without a central memory. In\napplications such as network control and data ranking, each agent is only\naffected by a small portion of the decision vector: this sparsity is typically\nignored in distributed algorithms, while it could be leveraged to improve\nefficiency and scalability. To address this issue, our recent paper introduces\nEstimation Network Design (END), a graph theoretical language for the analysis\nand design of distributed iterations. END algorithms can be tuned to exploit\nthe sparsity of specific problem instances, reducing communication overhead and\nminimizing redundancy, yet without requiring case-by-case convergence analysis.\nIn this paper, we showcase the flexility of END in the context of distributed\noptimization. In particular, we study the sparsity-aware version of many\nestablished methods, including ADMM, AugDGM and Push-Sum DGD. Simulations on an\nestimation problem in sensor networks demonstrate that END algorithms can boost\nconvergence speed and greatly reduce the communication and memory cost.",
        "updated": "2024-04-23 17:59:09 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.15273v1"
    },
    {
        "title": "From Space-Time to Space-Order: Directly Planning a Temporal Planning Graph by Redefining CBS",
        "authors": "Yu WuRishi VeerapaneniJiaoyang LiMaxim Likhachev",
        "links": "http://arxiv.org/abs/2404.15137v1",
        "entry_id": "http://arxiv.org/abs/2404.15137v1",
        "pdf_url": "http://arxiv.org/pdf/2404.15137v1",
        "summary": "The majority of multi-agent path finding (MAPF) methods compute\ncollision-free space-time paths which require agents to be at a specific\nlocation at a specific discretized timestep. However, executing these\nspace-time paths directly on robotic systems is infeasible due to real-time\nexecution differences (e.g. delays) which can lead to collisions. To combat\nthis, current methods translate the space-time paths into a temporal plan graph\n(TPG) that only requires that agents observe the order in which they navigate\nthrough locations where their paths cross. However, planning space-time paths\nand then post-processing them into a TPG does not reduce the required\nagent-to-agent coordination, which is fixed once the space-time paths are\ncomputed. To that end, we propose a novel algorithm Space-Order CBS that can\ndirectly plan a TPG and explicitly minimize coordination. Our main theoretical\ninsight is our novel perspective on viewing a TPG as a set of space-visitation\norder paths where agents visit locations in relative orders (e.g. 1st vs 2nd)\nas opposed to specific timesteps. We redefine unique conflicts and constraints\nfor adapting CBS for space-order planning. We experimentally validate how\nSpace-Order CBS can return TPGs which significantly reduce coordination, thus\nsubsequently reducing the amount of agent-agent communication and leading to\nmore robustness to delays during execution.",
        "updated": "2024-04-23 15:42:31 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.15137v1"
    },
    {
        "title": "Opinion Update in a Subjective Logic Model for Social Networks",
        "authors": "Mário S. AlvimSophia KnightJosé C. Oliveira",
        "links": "http://arxiv.org/abs/2404.14789v1",
        "entry_id": "http://arxiv.org/abs/2404.14789v1",
        "pdf_url": "http://arxiv.org/pdf/2404.14789v1",
        "summary": "Subjective Logic (SL) is a logic incorporating uncertainty and opinions for\nagents in dynamic systems. In this work, we investigate the use of subjective\nlogic to model opinions and belief change in social networks. In particular, we\nwork toward the development of a subjective logic belief/opinion update\nfunction appropriate for modeling belief change as communication occurs in\nsocial networks. We found through experiments that an update function with\nbelief fusion from SL does not have ideal properties to represent a rational\nupdate. Even without these properties, we found that an update function with\ncumulative belief fusion can describe behaviors not explored by the social\nnetwork model defined by Alvim, Knight, and Valencia (2019).",
        "updated": "2024-04-23 07:02:00 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.14789v1"
    },
    {
        "title": "STROOBnet Optimization via GPU-Accelerated Proximal Recurrence Strategies",
        "authors": "Ted Edward HolmbergMahdi AbdelguerfiElias Ioup",
        "links": "http://dx.doi.org/10.1109/BigData59044.2023.10386774",
        "entry_id": "http://arxiv.org/abs/2404.14388v1",
        "pdf_url": "http://arxiv.org/pdf/2404.14388v1",
        "summary": "Spatiotemporal networks' observational capabilities are crucial for accurate\ndata gathering and informed decisions across multiple sectors. This study\nfocuses on the Spatiotemporal Ranged Observer-Observable Bipartite Network\n(STROOBnet), linking observational nodes (e.g., surveillance cameras) to events\nwithin defined geographical regions, enabling efficient monitoring. Using data\nfrom Real-Time Crime Camera (RTCC) systems and Calls for Service (CFS) in New\nOrleans, where RTCC combats rising crime amidst reduced police presence, we\naddress the network's initial observational imbalances. Aiming for uniform\nobservational efficacy, we propose the Proximal Recurrence approach. It\noutperformed traditional clustering methods like k-means and DBSCAN by offering\nholistic event frequency and spatial consideration, enhancing observational\ncoverage.",
        "updated": "2024-04-22 17:46:29 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.14388v1"
    },
    {
        "title": "A Stochastic Geo-spatiotemporal Bipartite Network to Optimize GCOOS Sensor Placement Strategies",
        "authors": "Ted Edward HolmbergElias IoupMahdi Abdelguerfi",
        "links": "http://dx.doi.org/10.1109/BigData55660.2022.10020928",
        "entry_id": "http://arxiv.org/abs/2404.14357v1",
        "pdf_url": "http://arxiv.org/pdf/2404.14357v1",
        "summary": "This paper proposes two new measures applicable in a spatial bipartite\nnetwork model: coverage and coverage robustness. The bipartite network must\nconsist of observer nodes, observable nodes, and edges that connect observer\nnodes to observable nodes. The coverage and coverage robustness scores evaluate\nthe effectiveness of the observer node placements. This measure is beneficial\nfor stochastic data as it may be coupled with Monte Carlo simulations to\nidentify optimal placements for new observer nodes. In this paper, we construct\na Geo-SpatioTemporal Bipartite Network (GSTBN) within the stochastic and\ndynamical environment of the Gulf of Mexico. This GSTBN consists of GCOOS\nsensor nodes and HYCOM Region of Interest (RoI) event nodes. The goal is to\nidentify optimal placements to expand GCOOS to improve the forecasting outcomes\nby the HYCOM ocean prediction model.",
        "updated": "2024-04-22 17:12:06 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.14357v1"
    }
]