[
    {
        "title": "Score matching for sub-Riemannian bridge sampling",
        "authors": "Erlend GrongKaren HabermannStefan Sommer",
        "links": "http://arxiv.org/abs/2404.15258v1",
        "entry_id": "http://arxiv.org/abs/2404.15258v1",
        "pdf_url": "http://arxiv.org/pdf/2404.15258v1",
        "summary": "Simulation of conditioned diffusion processes is an essential tool in\ninference for stochastic processes, data imputation, generative modelling, and\ngeometric statistics. Whilst simulating diffusion bridge processes is already\ndifficult on Euclidean spaces, when considering diffusion processes on\nRiemannian manifolds the geometry brings in further complications. In even\nhigher generality, advancing from Riemannian to sub-Riemannian geometries\nintroduces hypoellipticity, and the possibility of finding appropriate explicit\napproximations for the score of the diffusion process is removed. We handle\nthese challenges and construct a method for bridge simulation on sub-Riemannian\nmanifolds by demonstrating how recent progress in machine learning can be\nmodified to allow for training of score approximators on sub-Riemannian\nmanifolds. Since gradients dependent on the horizontal distribution, we\ngeneralise the usual notion of denoising loss to work with non-holonomic frames\nusing a stochastic Taylor expansion, and we demonstrate the resulting scheme\nboth explicitly on the Heisenberg group and more generally using adapted\ncoordinates. We perform numerical experiments exemplifying samples from the\nbridge process on the Heisenberg group and the concentration of this process\nfor small time.",
        "updated": "2024-04-23 17:45:53 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.15258v1"
    },
    {
        "title": "GIST: Gibbs self-tuning for locally adaptive Hamiltonian Monte Carlo",
        "authors": "Nawaf Bou-RabeeBob CarpenterMilo Marsden",
        "links": "http://arxiv.org/abs/2404.15253v1",
        "entry_id": "http://arxiv.org/abs/2404.15253v1",
        "pdf_url": "http://arxiv.org/pdf/2404.15253v1",
        "summary": "We present a novel and flexible framework for localized tuning of Hamiltonian\nMonte Carlo samplers by sampling the algorithm's tuning parameters\nconditionally based on the position and momentum at each step. For adaptively\nsampling path lengths, we show that randomized Hamiltonian Monte Carlo, the\nNo-U-Turn Sampler, and the Apogee-to-Apogee Path Sampler all fit within this\nunified framework as special cases. The framework is illustrated with a simple\nalternative to the No-U-Turn Sampler for locally adapting path lengths.",
        "updated": "2024-04-23 17:39:20 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.15253v1"
    },
    {
        "title": "PHLP: Sole Persistent Homology for Link Prediction -- Interpretable Feature Extraction",
        "authors": "Junwon YouEunwoo HeoJae-Hun Jung",
        "links": "http://arxiv.org/abs/2404.15225v1",
        "entry_id": "http://arxiv.org/abs/2404.15225v1",
        "pdf_url": "http://arxiv.org/pdf/2404.15225v1",
        "summary": "Link prediction (LP), inferring the connectivity between nodes, is a\nsignificant research area in graph data, where a link represents essential\ninformation on relationships between nodes. Although graph neural network\n(GNN)-based models have achieved high performance in LP, understanding why they\nperform well is challenging because most comprise complex neural networks. We\nemploy persistent homology (PH), a topological data analysis method that helps\nanalyze the topological information of graphs, to explain the reasons for the\nhigh performance. We propose a novel method that employs PH for LP (PHLP)\nfocusing on how the presence or absence of target links influences the overall\ntopology. The PHLP utilizes the angle hop subgraph and new node labeling called\ndegree double radius node labeling (Degree DRNL), distinguishing the\ninformation of graphs better than DRNL. Using only a classifier, PHLP performs\nsimilarly to state-of-the-art (SOTA) models on most benchmark datasets.\nIncorporating the outputs calculated using PHLP into the existing GNN-based\nSOTA models improves performance across all benchmark datasets. To the best of\nour knowledge, PHLP is the first method of applying PH to LP without GNNs. The\nproposed approach, employing PH while not relying on neural networks, enables\nthe identification of crucial factors for improving performance.",
        "updated": "2024-04-23 16:54:56 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.15225v1"
    },
    {
        "title": "Conformal Predictive Systems Under Covariate Shift",
        "authors": "Jef JonkersGlenn Van WallendaelLuc DuchateauSofie Van Hoecke",
        "links": "http://arxiv.org/abs/2404.15018v1",
        "entry_id": "http://arxiv.org/abs/2404.15018v1",
        "pdf_url": "http://arxiv.org/pdf/2404.15018v1",
        "summary": "Conformal Predictive Systems (CPS) offer a versatile framework for\nconstructing predictive distributions, allowing for calibrated inference and\ninformative decision-making. However, their applicability has been limited to\nscenarios adhering to the Independent and Identically Distributed (IID) model\nassumption. This paper extends CPS to accommodate scenarios characterized by\ncovariate shifts. We therefore propose Weighted CPS (WCPS), akin to Weighted\nConformal Prediction (WCP), leveraging likelihood ratios between training and\ntesting covariate distributions. This extension enables the construction of\nnonparametric predictive distributions capable of handling covariate shifts. We\npresent theoretical underpinnings and conjectures regarding the validity and\nefficacy of WCPS and demonstrate its utility through empirical evaluations on\nboth synthetic and real-world datasets. Our simulation experiments indicate\nthat WCPS are probabilistically calibrated under covariate shift.",
        "updated": "2024-04-23 13:23:27 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.15018v1"
    },
    {
        "title": "Estimating the Distribution of Parameters in Differential Equations with Repeated Cross-Sectional Data",
        "authors": "Hyeontae JoSung Woong ChoHyung Ju Hwang",
        "links": "http://arxiv.org/abs/2404.14873v1",
        "entry_id": "http://arxiv.org/abs/2404.14873v1",
        "pdf_url": "http://arxiv.org/pdf/2404.14873v1",
        "summary": "Differential equations are pivotal in modeling and understanding the dynamics\nof various systems, offering insights into their future states through\nparameter estimation fitted to time series data. In fields such as economy,\npolitics, and biology, the observation data points in the time series are often\nindependently obtained (i.e., Repeated Cross-Sectional (RCS) data). With RCS\ndata, we found that traditional methods for parameter estimation in\ndifferential equations, such as using mean values of time trajectories or\nGaussian Process-based trajectory generation, have limitations in estimating\nthe shape of parameter distributions, often leading to a significant loss of\ndata information. To address this issue, we introduce a novel method,\nEstimation of Parameter Distribution (EPD), providing accurate distribution of\nparameters without loss of data information. EPD operates in three main steps:\ngenerating synthetic time trajectories by randomly selecting observed values at\neach time point, estimating parameters of a differential equation that minimize\nthe discrepancy between these trajectories and the true solution of the\nequation, and selecting the parameters depending on the scale of discrepancy.\nWe then evaluated the performance of EPD across several models, including\nexponential growth, logistic population models, and target cell-limited models\nwith delayed virus production, demonstrating its superiority in capturing the\nshape of parameter distributions. Furthermore, we applied EPD to real-world\ndatasets, capturing various shapes of parameter distributions rather than a\nnormal distribution. These results effectively address the heterogeneity within\nsystems, marking a substantial progression in accurately modeling systems using\nRCS data.",
        "updated": "2024-04-23 10:01:43 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.14873v1"
    }
]