[
    {
        "title": "Learning to Manipulate under Limited Information",
        "authors": "Wesley H. HollidayAlexander KristoffersenEric Pacuit",
        "links": "http://arxiv.org/abs/2401.16412v1",
        "entry_id": "http://arxiv.org/abs/2401.16412v1",
        "pdf_url": "http://arxiv.org/pdf/2401.16412v1",
        "summary": "By classic results in social choice theory, any reasonable preferential\nvoting method sometimes gives individuals an incentive to report an insincere\npreference. The extent to which different voting methods are more or less\nresistant to such strategic manipulation has become a key consideration for\ncomparing voting methods. Here we measure resistance to manipulation by whether\nneural networks of varying sizes can learn to profitably manipulate a given\nvoting method in expectation, given different types of limited information\nabout how other voters will vote. We trained nearly 40,000 neural networks of\n26 sizes to manipulate against 8 different voting methods, under 6 types of\nlimited information, in committee-sized elections with 5-21 voters and 3-6\ncandidates. We find that some voting methods, such as Borda, are highly\nmanipulable by networks with limited information, while others, such as Instant\nRunoff, are not, despite being quite profitably manipulated by an ideal\nmanipulator with full information.",
        "updated": "2024-01-29 18:49:50 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.16412v1"
    },
    {
        "title": "Effective Communication with Dynamic Feature Compression",
        "authors": "Pietro TalliFrancesco PaseFederico ChiariottiAndrea ZanellaMichele Zorzi",
        "links": "http://arxiv.org/abs/2401.16236v1",
        "entry_id": "http://arxiv.org/abs/2401.16236v1",
        "pdf_url": "http://arxiv.org/pdf/2401.16236v1",
        "summary": "The remote wireless control of industrial systems is one of the major use\ncases for 5G and beyond systems: in these cases, the massive amounts of sensory\ninformation that need to be shared over the wireless medium may overload even\nhigh-capacity connections. Consequently, solving the effective communication\nproblem by optimizing the transmission strategy to discard irrelevant\ninformation can provide a significant advantage, but is often a very complex\ntask. In this work, we consider a prototypal system in which an observer must\ncommunicate its sensory data to a robot controlling a task (e.g., a mobile\nrobot in a factory). We then model it as a remote Partially Observable Markov\nDecision Process (POMDP), considering the effect of adopting semantic and\neffective communication-oriented solutions on the overall system performance.\nWe split the communication problem by considering an ensemble Vector Quantized\nVariational Autoencoder (VQ-VAE) encoding, and train a Deep Reinforcement\nLearning (DRL) agent to dynamically adapt the quantization level, considering\nboth the current state of the environment and the memory of past messages. We\ntested the proposed approach on the well-known CartPole reference control\nproblem, obtaining a significant performance increase over traditional\napproaches.",
        "updated": "2024-01-29 15:35:05 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.16236v1"
    },
    {
        "title": "A mechanism for discovering semantic relationships among agent communication protocols",
        "authors": "Idoia BergesJesús BermúdezAlfredo GoñiArantza Illarramendi",
        "links": "http://dx.doi.org/10.1007/s10458-010-9154-1",
        "entry_id": "http://arxiv.org/abs/2401.16216v1",
        "pdf_url": "http://arxiv.org/pdf/2401.16216v1",
        "summary": "One relevant aspect in the development of the Semantic Web framework is the\nachievement of a real inter-agents communication capability at the semantic\nlevel. Agents should be able to communicate with each other freely using\ndifferent communication protocols, constituted by communication acts. For that\nscenario, we introduce in this paper an efficient mechanism presenting the\nfollowing main features: - It promotes the description of the communication\nacts of protocols as classes that belong to a communication acts ontology, and\nassociates to those acts a social commitment semantics formalized through\npredicates in the Event Calculus. - It is sustained on the idea that different\nprotocols can be compared semantically by looking to the set of fluents\nassociated to each branch of the protocols. Those sets are generated using\nSemantic Web technology rules. - It discovers the following types of protocol\nrelationships: equivalence, specialization, restriction, prefix, suffix, infix\nand complement_to_infix.",
        "updated": "2024-01-29 15:10:09 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.16216v1"
    },
    {
        "title": "Distributed Markov Chain Monte Carlo Sampling based on the Alternating Direction Method of Multipliers",
        "authors": "Alexandros E. TzikasLicio RomaoMert PilanciAlessandro AbateMykel J. Kochenderfer",
        "links": "http://arxiv.org/abs/2401.15838v1",
        "entry_id": "http://arxiv.org/abs/2401.15838v1",
        "pdf_url": "http://arxiv.org/pdf/2401.15838v1",
        "summary": "Many machine learning applications require operating on a spatially\ndistributed dataset. Despite technological advances, privacy considerations and\ncommunication constraints may prevent gathering the entire dataset in a central\nunit. In this paper, we propose a distributed sampling scheme based on the\nalternating direction method of multipliers, which is commonly used in the\noptimization literature due to its fast convergence. In contrast to distributed\noptimization, distributed sampling allows for uncertainty quantification in\nBayesian inference tasks. We provide both theoretical guarantees of our\nalgorithm's convergence and experimental evidence of its superiority to the\nstate-of-the-art. For our theoretical results, we use convex optimization tools\nto establish a fundamental inequality on the generated local sample iterates.\nThis inequality enables us to show convergence of the distribution associated\nwith these iterates to the underlying target distribution in Wasserstein\ndistance. In simulation, we deploy our algorithm on linear and logistic\nregression tasks and illustrate its fast convergence compared to existing\ngradient-based methods.",
        "updated": "2024-01-29 02:08:40 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.15838v1"
    },
    {
        "title": "Accelerated Distributed Allocation",
        "authors": "Mohammadreza DoostmohammadianAlireza Aghasi",
        "links": "http://arxiv.org/abs/2401.15598v1",
        "entry_id": "http://arxiv.org/abs/2401.15598v1",
        "pdf_url": "http://arxiv.org/pdf/2401.15598v1",
        "summary": "Distributed allocation finds applications in many scenarios including CPU\nscheduling, distributed energy resource management, and networked coverage\ncontrol. In this paper, we propose a fast convergent optimization algorithm\nwith a tunable rate using the signum function. The convergence rate of the\nproposed algorithm can be managed by changing two parameters. We prove\nconvergence over uniformly-connected multi-agent networks. Therefore, the\nsolution converges even if the network loses connectivity at some finite time\nintervals. The proposed algorithm is all-time feasible, implying that at any\ntermination time of the algorithm, the resource-demand feasibility holds. This\nis in contrast to asymptotic feasibility in many dual formulation solutions\n(e.g., ADMM) that meet resource-demand feasibility over time and\nasymptotically.",
        "updated": "2024-01-28 07:54:12 UTC",
        "interpretation": "解释内容未找到",
        "id": "2401.15598v1"
    }
]