[
    {
        "title": "Analyzing Operator States and the Impact of AI-Enhanced Decision Support in Control Rooms: A Human-in-the-Loop Specialized Reinforcement Learning Framework for Intervention Strategies",
        "authors": "Ammar N. AbbasChidera W. AmazuJoseph MietkiewiczHouda BriwaAndres Alonzo PerezGabriele BaldissoneMicaela DemichelaGeorgios G. ChasparisJohn D. KelleherMaria Chiara Leva",
        "links": "http://arxiv.org/abs/2402.13219v1",
        "entry_id": "http://arxiv.org/abs/2402.13219v1",
        "pdf_url": "http://arxiv.org/pdf/2402.13219v1",
        "summary": "In complex industrial and chemical process control rooms, effective\ndecision-making is crucial for safety and efficiency. The experiments in this\npaper evaluate the impact and applications of an AI-based decision support\nsystem integrated into an improved human-machine interface, using dynamic\ninfluence diagrams, a hidden Markov model, and deep reinforcement learning. The\nenhanced support system aims to reduce operator workload, improve situational\nawareness, and provide different intervention strategies to the operator\nadapted to the current state of both the system and human performance. Such a\nsystem can be particularly useful in cases of information overload when many\nalarms and inputs are presented all within the same time window, or for junior\noperators during training. A comprehensive cross-data analysis was conducted,\ninvolving 47 participants and a diverse range of data sources such as\nsmartwatch metrics, eye-tracking data, process logs, and responses from\nquestionnaires. The results indicate interesting insights regarding the\neffectiveness of the approach in aiding decision-making, decreasing perceived\nworkload, and increasing situational awareness for the scenarios considered.\nAdditionally, the results provide valuable insights to compare differences\nbetween styles of information gathering when using the system by individual\nparticipants. These findings are particularly relevant when predicting the\noverall performance of the individual participant and their capacity to\nsuccessfully handle a plant upset and the alarms connected to it using process\nand human-machine interaction logs in real-time. These predictions enable the\ndevelopment of more effective intervention strategies.",
        "updated": "2024-02-20 18:31:27 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.13219v1"
    },
    {
        "title": "Shall We Talk: Exploring Spontaneous Collaborations of Competing LLM Agents",
        "authors": "Zengqing WuShuyuan ZhengQianying LiuXu HanBrian Inhyuk KwonMakoto OnizukaShaojie TangRun PengChuan Xiao",
        "links": "http://arxiv.org/abs/2402.12327v1",
        "entry_id": "http://arxiv.org/abs/2402.12327v1",
        "pdf_url": "http://arxiv.org/pdf/2402.12327v1",
        "summary": "Recent advancements have shown that agents powered by large language models\n(LLMs) possess capabilities to simulate human behaviors and societal dynamics.\nHowever, the potential for LLM agents to spontaneously establish collaborative\nrelationships in the absence of explicit instructions has not been studied. To\naddress this gap, we conduct three case studies, revealing that LLM agents are\ncapable of spontaneously forming collaborations even within competitive\nsettings. This finding not only demonstrates the capacity of LLM agents to\nmimic competition and cooperation in human societies but also validates a\npromising vision of computational social science. Specifically, it suggests\nthat LLM agents could be utilized to model human social interactions, including\nthose with spontaneous collaborations, thus offering insights into social\nphenomena. The source codes for this study are available at\nhttps://github.com/wuzengqing001225/SABM_ShallWeTalk .",
        "updated": "2024-02-19 18:00:53 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.12327v1"
    },
    {
        "title": "LLM Agents for Psychology: A Study on Gamified Assessments",
        "authors": "Qisen YangZekun WangHonghui ChenShenzhi WangYifan PuXin GaoWenhao HuangShiji SongGao Huang",
        "links": "http://arxiv.org/abs/2402.12326v1",
        "entry_id": "http://arxiv.org/abs/2402.12326v1",
        "pdf_url": "http://arxiv.org/pdf/2402.12326v1",
        "summary": "Psychological measurement is essential for mental health, self-understanding,\nand personal development. Traditional methods, such as self-report scales and\npsychologist interviews, often face challenges with engagement and\naccessibility. While game-based and LLM-based tools have been explored to\nimprove user interest and automate assessment, they struggle to balance\nengagement with generalizability. In this work, we propose PsychoGAT\n(Psychological Game AgenTs) to achieve a generic gamification of psychological\nassessment. The main insight is that powerful LLMs can function both as adept\npsychologists and innovative game designers. By incorporating LLM agents into\ndesignated roles and carefully managing their interactions, PsychoGAT can\ntransform any standardized scales into personalized and engaging interactive\nfiction games. To validate the proposed method, we conduct psychometric\nevaluations to assess its effectiveness and employ human evaluators to examine\nthe generated content across various psychological constructs, including\ndepression, cognitive distortions, and personality traits. Results demonstrate\nthat PsychoGAT serves as an effective assessment tool, achieving statistically\nsignificant excellence in psychometric metrics such as reliability, convergent\nvalidity, and discriminant validity. Moreover, human evaluations confirm\nPsychoGAT's enhancements in content coherence, interactivity, interest,\nimmersion, and satisfaction.",
        "updated": "2024-02-19 18:00:30 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.12326v1"
    },
    {
        "title": "Navigating simplicity and complexity of social-ecological systems through a dialog between dynamical systems and agent-based models",
        "authors": "Sonja RadosavljevicUdita SangaMaja Schlüter",
        "links": "http://arxiv.org/abs/2402.12086v1",
        "entry_id": "http://arxiv.org/abs/2402.12086v1",
        "pdf_url": "http://arxiv.org/pdf/2402.12086v1",
        "summary": "Social-ecological systems (SES) research aims to understand the nature of\nsocial-ecological phenomena, to find effective ways to foster or manage\nconditions under which desirable phenomena, such as sustainable resource use,\noccur or to change conditions or reduce the negative consequences of\nundesirable phenomena, such as poverty traps. Challenges such as these are\noften addressed using dynamical systems models (DSM) or agent-based models\n(ABM). Both modeling approaches have strengths and weaknesses. DSM are praised\nfor their analytical tractability and efficient exploration of asymptotic\ndynamics and bifurcation, which are enabled by reduced number and heterogeneity\nof system components. ABM allows representing heterogeneity, agency, learning\nand interactions of diverse agents within SES, but this also comes at a price\nsuch as inefficiency to explore asymptotic dynamics or bifurcations. In this\npaper we combine DSM and ABM to leverage strengths of each modeling technique\nand gain deeper insights into dynamics of a system. We start with an ABM and\nresearch questions that the ABM was not able to answer. Using results of the\nABM analysis as inputs for DSM, we create a DSM. Stability and bifurcation\nanalysis of the DSM gives partial answers to the research questions and direct\nattention to where additional details are needed. This informs further ABM\nanalysis, prevents burdening the ABM with less important details and reveals\nnew insights about system dynamics. The iterative process and dialogue between\nthe ABM and DSM leads to more complete answers to research questions and\nsurpasses insights provided by each of the models separately. We illustrate the\nprocedure with the example of the emergence of poverty traps in an agricultural\nsystem with endogenously driven innovation.",
        "updated": "2024-02-19 12:07:27 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.12086v1"
    },
    {
        "title": "Aligning Individual and Collective Objectives in Multi-Agent Cooperation",
        "authors": "Yang LiWenhao ZhangJianhong WangShao ZhangYali DuYing WenWei Pan",
        "links": "http://arxiv.org/abs/2402.12416v1",
        "entry_id": "http://arxiv.org/abs/2402.12416v1",
        "pdf_url": "http://arxiv.org/pdf/2402.12416v1",
        "summary": "In the field of multi-agent learning, the challenge of mixed-motive\ncooperation is pronounced, given the inherent contradictions between individual\nand collective goals. Current research in this domain primarily focuses on\nincorporating domain knowledge into rewards or introducing additional\nmechanisms to foster cooperation. However, many of these methods suffer from\nthe drawbacks of manual design costs and the lack of a theoretical grounding\nconvergence procedure to the solution. To address this gap, we approach the\nmixed-motive game by modeling it as a differentiable game to study learning\ndynamics. We introduce a novel optimization method named Altruistic Gradient\nAdjustment (AgA) that employs gradient adjustments to novelly align individual\nand collective objectives. Furthermore, we provide theoretical proof that the\nselection of an appropriate alignment weight in AgA can accelerate convergence\ntowards the desired solutions while effectively avoiding the undesired ones.\nThe visualization of learning dynamics effectively demonstrates that AgA\nsuccessfully achieves alignment between individual and collective objectives.\nAdditionally, through evaluations conducted on established mixed-motive\nbenchmarks such as the public good game, Cleanup, Harvest, and our modified\nmixed-motive SMAC environment, we validate AgA's capability to facilitate\naltruistic and fair collaboration.",
        "updated": "2024-02-19 08:18:53 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.12416v1"
    }
]