[
    {
        "title": "A holographic mobile-based application for practicing pronunciation of basic English vocabulary for Spanish speaking children",
        "authors": "R. CerezoV. CalderonC. Romero",
        "links": "http://dx.doi.org/10.1016/j.ijhcs.2018.11.009",
        "entry_id": "http://arxiv.org/abs/2402.07897v1",
        "pdf_url": "http://arxiv.org/pdf/2402.07897v1",
        "summary": "This paper describes a holographic mobile-based application designed to help\nSpanish-speaking children to practice the pronunciation of basic English\nvocabulary words. The mastery of vocabulary is a fundamental step when learning\na language but is often perceived as boring. Producing the correct\npronunciation is frequently regarded as the most difficult and complex skill\nfor new learners of English. In order to address these problems this research\ntakes advantage of the power of multi-channel stimuli (sound, image and\ninteraction) in a mobilebased hologram application in order to motivate\nstudents and improve their experience of practicing. We adapted the\nprize-winning HolograFX game and developed a new mobile application to help\npractice English pronunciation. A 3D holographic robot that acts as a virtual\nteacher interacts via voice with the children. To test the tool we carried out\nan experiment with 70 Spanish pre-school children divided into three classes,\nthe control group using traditional methods such as images in books and on the\nblackboard, and two experimental groups using our drills and practice software.\nOne experimental group used the mobile application without the holographic game\nand the other experimental group used the application with the holographic\ngame. We performed pre-test and post-test performance assessments, a\nsatisfaction survey and emotion analysis. The results are very promising. They\nshow that the use of the holographic mobile-based application had a significant\nimpact on the children's motivation. It also improved their performance\ncompared to traditional methods used in the classroom.",
        "updated": "2024-02-12 18:58:01 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.07897v1"
    },
    {
        "title": "Cruising Queer HCI on the DL: A Literature Review of LGBTQ+ People in HCI",
        "authors": "Jordan TaylorEllen SimpsonAnh-Ton TranJed BrubakerSarah FoxHaiyi Zhu",
        "links": "http://arxiv.org/abs/2402.07864v1",
        "entry_id": "http://arxiv.org/abs/2402.07864v1",
        "pdf_url": "http://arxiv.org/pdf/2402.07864v1",
        "summary": "LGBTQ+ people have received increased attention in HCI research, paralleling\na greater emphasis on social justice in recent years. However, there has not\nbeen a systematic review of how LGBTQ+ people are researched or discussed in\nHCI. In this work, we review all research mentioning LGBTQ+ people across the\nHCI venues of CHI, CSCW, DIS, and TOCHI. Since 2014, we find a linear growth in\nthe number of papers substantially about LGBTQ+ people and an exponential\nincrease in the number of mentions. Research about LGBTQ+ people tends to\ncenter experiences of being politicized, outside the norm, stigmatized, or\nhighly vulnerable. LGBTQ+ people are typically mentioned as a marginalized\ngroup or an area of future research. We identify gaps and opportunities for (1)\nresearch about and (2) the discussion of LGBTQ+ in HCI and provide a dataset to\nfacilitate future Queer HCI research.",
        "updated": "2024-02-12 18:20:07 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.07864v1"
    },
    {
        "title": "Privacy-Preserving Gaze Data Streaming in Immersive Interactive Virtual Reality: Robustness and User Experience",
        "authors": "Ethan WilsonAzim IbragimovMichael J. ProulxSai Deep TetaliKevin ButlerEakta Jain",
        "links": "http://arxiv.org/abs/2402.07687v1",
        "entry_id": "http://arxiv.org/abs/2402.07687v1",
        "pdf_url": "http://arxiv.org/pdf/2402.07687v1",
        "summary": "Eye tracking is routinely being incorporated into virtual reality (VR)\nsystems. Prior research has shown that eye tracking data can be used for\nre-identification attacks. The state of our knowledge about currently existing\nprivacy mechanisms is limited to privacy-utility trade-off curves based on\ndata-centric metrics of utility, such as prediction error, and black-box threat\nmodels. We propose that for interactive VR applications, it is essential to\nconsider user-centric notions of utility and a variety of threat models. We\ndevelop a methodology to evaluate real-time privacy mechanisms for interactive\nVR applications that incorporate subjective user experience and task\nperformance metrics. We evaluate selected privacy mechanisms using this\nmethodology and find that re-identification accuracy can be decreased to as low\nas 14% while maintaining a high usability score and reasonable task\nperformance. Finally, we elucidate three threat scenarios (black-box, black-box\nwith exemplars, and white-box) and assess how well the different privacy\nmechanisms hold up to these adversarial scenarios. This work advances the state\nof the art in VR privacy by providing a methodology for end-to-end assessment\nof the risk of re-identification attacks and potential mitigating solutions.",
        "updated": "2024-02-12 14:53:12 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.07687v1"
    },
    {
        "title": "Overconfident and Unconfident AI Hinder Human-AI Collaboration",
        "authors": "Jingshu LiYitian YangYi-chieh Lee",
        "links": "http://arxiv.org/abs/2402.07632v1",
        "entry_id": "http://arxiv.org/abs/2402.07632v1",
        "pdf_url": "http://arxiv.org/pdf/2402.07632v1",
        "summary": "As artificial intelligence (AI) advances, human-AI collaboration has become\nincreasingly prevalent across both professional and everyday settings. In such\ncollaboration, AI can express its confidence level about its performance,\nserving as a crucial indicator for humans to evaluate AI's suggestions.\nHowever, AI may exhibit overconfidence or underconfidence--its expressed\nconfidence is higher or lower than its actual performance--which may lead\nhumans to mistakenly evaluate AI advice. Our study investigates the influences\nof AI's overconfidence and underconfidence on human trust, their acceptance of\nAI suggestions, and collaboration outcomes. Our study reveal that disclosing AI\nconfidence levels and performance feedback facilitates better recognition of AI\nconfidence misalignments. However, participants tend to withhold their trust as\nperceiving such misalignments, leading to a rejection of AI suggestions and\nsubsequently poorer performance in collaborative tasks. Conversely, without\nsuch information, participants struggle to identify misalignments, resulting in\neither the neglect of correct AI advice or the following of incorrect AI\nsuggestions, adversely affecting collaboration. This study offers valuable\ninsights for enhancing human-AI collaboration by underscoring the importance of\naligning AI's expressed confidence with its actual performance and the\nnecessity of calibrating human trust towards AI confidence.",
        "updated": "2024-02-12 13:16:30 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.07632v1"
    },
    {
        "title": "PKG API: A Tool for Personal Knowledge Graph Management",
        "authors": "Nolwenn BernardIvica KostricWeronika ŁajewskaKrisztian BalogPetra GaluščákováVinay SettyMartin G. Skjæveland",
        "links": "http://arxiv.org/abs/2402.07540v1",
        "entry_id": "http://arxiv.org/abs/2402.07540v1",
        "pdf_url": "http://arxiv.org/pdf/2402.07540v1",
        "summary": "Personal knowledge graphs (PKGs) offer individuals a way to store and\nconsolidate their fragmented personal data in a central place, improving\nservice personalization while maintaining full user control. Despite their\npotential, practical PKG implementations with user-friendly interfaces remain\nscarce. This work addresses this gap by proposing a complete solution to\nrepresent, manage, and interface with PKGs. Our approach includes (1) a\nuser-facing PKG Client, enabling end-users to administer their personal data\neasily via natural language statements, and (2) a service-oriented PKG API. To\ntackle the complexity of representing these statements within a PKG, we present\nan RDF-based PKG vocabulary that supports this, along with properties for\naccess rights and provenance.",
        "updated": "2024-02-12 10:09:16 UTC",
        "interpretation": "解释内容未找到",
        "id": "2402.07540v1"
    }
]