[
    {
        "title": "Introduction to Human-Robot Interaction: A Multi-Perspective Introductory Course",
        "authors": "Tom Williams",
        "links": "http://arxiv.org/abs/2403.15323v1",
        "entry_id": "http://arxiv.org/abs/2403.15323v1",
        "pdf_url": "http://arxiv.org/pdf/2403.15323v1",
        "summary": "In this paper I describe the design of an introductory course in Human-Robot\nInteraction. This project-driven course is designed to introduce undergraduate\nand graduate engineering students, especially those enrolled in Computer\nScience, Mechanical Engineering, and Robotics degree programs, to key theories\nand methods used in the field of Human-Robot Interaction that they would\notherwise be unlikely to see in those degree programs. To achieve this aim, the\ncourse takes students all the way from stakeholder analysis to empirical\nevaluation, covering and integrating key Qualitative, Design, Computational,\nand Quantitative methods along the way. I detail the goals, audience, and\nformat of the course, and provide a detailed walkthrough of the course\nsyllabus.",
        "updated": "2024-03-22 16:19:56 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.15323v1"
    },
    {
        "title": "Visual Highlighting for Situated Brushing and Linking",
        "authors": "Nina DoerrBenjamin LeeKatarina BaricovaDieter SchmalstiegMichael Sedlmair",
        "links": "http://arxiv.org/abs/2403.15321v1",
        "entry_id": "http://arxiv.org/abs/2403.15321v1",
        "pdf_url": "http://arxiv.org/pdf/2403.15321v1",
        "summary": "Brushing and linking is widely used for visual analytics in desktop\nenvironments. However, using this approach to link many data items between\nsituated (e.g., a virtual screen with data) and embedded views (e.g.,\nhighlighted objects in the physical environment) is largely unexplored. To this\nend, we study the effectiveness of visual highlighting techniques in helping\nusers identify and link physical referents to brushed data marks in a situated\nscatterplot. In an exploratory virtual reality user study (N=20), we evaluated\nfour highlighting techniques under different physical layouts and tasks. We\ndiscuss the effectiveness of these techniques, as well as implications for the\ndesign of brushing and linking operations in situated analytics.",
        "updated": "2024-03-22 16:17:51 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.15321v1"
    },
    {
        "title": "Blockchain-based Pseudonym Management for Vehicle Twin Migrations in Vehicular Edge Metaverse",
        "authors": "Jiawen KangXiaofeng LuoJiangtian NieTianhao WuHaibo ZhouYonghua WangDusit NiyatoShiwen MaoShengli Xie",
        "links": "http://arxiv.org/abs/2403.15285v1",
        "entry_id": "http://arxiv.org/abs/2403.15285v1",
        "pdf_url": "http://arxiv.org/pdf/2403.15285v1",
        "summary": "Driven by the great advances in metaverse and edge computing technologies,\nvehicular edge metaverses are expected to disrupt the current paradigm of\nintelligent transportation systems. As highly computerized avatars of Vehicular\nMetaverse Users (VMUs), the Vehicle Twins (VTs) deployed in edge servers can\nprovide valuable metaverse services to improve driving safety and on-board\nsatisfaction for their VMUs throughout journeys. To maintain uninterrupted\nmetaverse experiences, VTs must be migrated among edge servers following the\nmovements of vehicles. This can raise concerns about privacy breaches during\nthe dynamic communications among vehicular edge metaverses. To address these\nconcerns and safeguard location privacy, pseudonyms as temporary identifiers\ncan be leveraged by both VMUs and VTs to realize anonymous communications in\nthe physical space and virtual spaces. However, existing pseudonym management\nmethods fall short in meeting the extensive pseudonym demands in vehicular edge\nmetaverses, thus dramatically diminishing the performance of privacy\npreservation. To this end, we present a cross-metaverse empowered dual\npseudonym management framework. We utilize cross-chain technology to enhance\nmanagement efficiency and data security for pseudonyms. Furthermore, we propose\na metric to assess the privacy level and employ a Multi-Agent Deep\nReinforcement Learning (MADRL) approach to obtain an optimal pseudonym\ngenerating strategy. Numerical results demonstrate that our proposed schemes\nare high-efficiency and cost-effective, showcasing their promising applications\nin vehicular edge metaverses.",
        "updated": "2024-03-22 15:31:37 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.15285v1"
    },
    {
        "title": "(Un)making AI Magic: a Design Taxonomy",
        "authors": "Maria Luce LupettiDave Murray-Rust",
        "links": "http://dx.doi.org/10.1145/3613904.3641954",
        "entry_id": "http://arxiv.org/abs/2403.15216v1",
        "pdf_url": "http://arxiv.org/pdf/2403.15216v1",
        "summary": "This paper examines the role that enchantment plays in the design of AI\nthings by constructing a taxonomy of design approaches that increase or\ndecrease the perception of magic and enchantment. We start from the design\ndiscourse surrounding recent developments in AI technologies, highlighting\nspecific interaction qualities such as algorithmic uncertainties and errors and\narticulating relations to the rhetoric of magic and supernatural thinking.\nThrough analyzing and reflecting upon 52 students' design projects from two\neditions of a Master course in design and AI, we identify seven design\nprinciples and unpack the effects of each in terms of enchantment and\ndisenchantment. We conclude by articulating ways in which this taxonomy can be\napproached and appropriated by design/HCI practitioners, especially to support\nexploration and reflexivity.",
        "updated": "2024-03-22 14:03:37 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.15216v1"
    },
    {
        "title": "Language Models in Dialogue: Conversational Maxims for Human-AI Interactions",
        "authors": "Erik MiehlingManish NagireddyPrasanna SattigeriElizabeth M. DalyDavid PiorkowskiJohn T. Richards",
        "links": "http://arxiv.org/abs/2403.15115v1",
        "entry_id": "http://arxiv.org/abs/2403.15115v1",
        "pdf_url": "http://arxiv.org/pdf/2403.15115v1",
        "summary": "Modern language models, while sophisticated, exhibit some inherent\nshortcomings, particularly in conversational settings. We claim that many of\nthe observed shortcomings can be attributed to violation of one or more\nconversational principles. By drawing upon extensive research from both the\nsocial science and AI communities, we propose a set of maxims -- quantity,\nquality, relevance, manner, benevolence, and transparency -- for describing\neffective human-AI conversation. We first justify the applicability of the\nfirst four maxims (from Grice) in the context of human-AI interactions. We then\nargue that two new maxims, benevolence (concerning the generation of, and\nengagement with, harmful content) and transparency (concerning recognition of\none's knowledge boundaries, operational constraints, and intents), are\nnecessary for addressing behavior unique to modern human-AI interactions. The\nproposed maxims offer prescriptive guidance on how to assess conversational\nquality between humans and LLM-driven conversational agents, informing both\ntheir evaluation and improved design.",
        "updated": "2024-03-22 11:16:43 UTC",
        "interpretation": "解释内容未找到",
        "id": "2403.15115v1"
    }
]