[
    {
        "title": "Reputation Transfer in the Twitter Diaspora",
        "authors": "Kristina RadivojevicDJ AdamsGriffin LaszloFelixander KeryTim Weninger",
        "links": "http://arxiv.org/abs/2405.12040v1",
        "entry_id": "http://arxiv.org/abs/2405.12040v1",
        "pdf_url": "http://arxiv.org/pdf/2405.12040v1",
        "summary": "Social media platforms have witnessed a dynamic landscape of user migration\nin recent years, fueled by changes in ownership, policy, and user preferences.\nThis paper explores the phenomenon of user migration from established platforms\nlike X/Twitter to emerging alternatives such as Threads, Mastodon, and Truth\nSocial. Leveraging a large dataset from X/Twitter, we investigate the extent of\nuser departure from X/Twitter and the destinations they migrate to.\nAdditionally, we examine whether a user's reputation on one platform correlates\nwith their reputation on another, shedding light on the transferability of\ndigital reputation across social media ecosystems. Overall, we find that users\nwith a large following on X/Twitter are more likely to migrate to another\nplatform; and that their reputation on X/Twitter is highly correlated with\nreputations on Threads, but not Mastodon or Truth Social.",
        "updated": "2024-05-20 14:07:59 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.12040v1"
    },
    {
        "title": "Exploring Commonalities in Explanation Frameworks: A Multi-Domain Survey Analysis",
        "authors": "Eduard BarbuMarharytha DomnichRaul VicenteNikos SakkasAndré Morim",
        "links": "http://arxiv.org/abs/2405.11958v1",
        "entry_id": "http://arxiv.org/abs/2405.11958v1",
        "pdf_url": "http://arxiv.org/pdf/2405.11958v1",
        "summary": "This study presents insights gathered from surveys and discussions with\nspecialists in three domains, aiming to find essential elements for a universal\nexplanation framework that could be applied to these and other similar use\ncases. The insights are incorporated into a software tool that utilizes GP\nalgorithms, known for their interpretability. The applications analyzed include\na medical scenario (involving predictive ML), a retail use case (involving\nprescriptive ML), and an energy use case (also involving predictive ML). We\ninterviewed professionals from each sector, transcribing their conversations\nfor further analysis. Additionally, experts and non-experts in these fields\nfilled out questionnaires designed to probe various dimensions of explanatory\nmethods. The findings indicate a universal preference for sacrificing a degree\nof accuracy in favor of greater explainability. Additionally, we highlight the\nsignificance of feature importance and counterfactual explanations as critical\ncomponents of such a framework. Our questionnaires are publicly available to\nfacilitate the dissemination of knowledge in the field of XAI.",
        "updated": "2024-05-20 11:28:32 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.11958v1"
    },
    {
        "title": "ARAIDA: Analogical Reasoning-Augmented Interactive Data Annotation",
        "authors": "Chen HuangYiping JinIlija IlievskiWenqiang LeiJiancheng Lv",
        "links": "http://arxiv.org/abs/2405.11912v1",
        "entry_id": "http://arxiv.org/abs/2405.11912v1",
        "pdf_url": "http://arxiv.org/pdf/2405.11912v1",
        "summary": "Human annotation is a time-consuming task that requires a significant amount\nof effort. To address this issue, interactive data annotation utilizes an\nannotation model to provide suggestions for humans to approve or correct.\nHowever, annotation models trained with limited labeled data are prone to\ngenerating incorrect suggestions, leading to extra human correction effort. To\ntackle this challenge, we propose Araida, an analogical reasoning-based\napproach that enhances automatic annotation accuracy in the interactive data\nannotation setting and reduces the need for human corrections. Araida involves\nan error-aware integration strategy that dynamically coordinates an annotation\nmodel and a k-nearest neighbors (KNN) model, giving more importance to KNN's\npredictions when predictions from the annotation model are deemed inaccurate.\nEmpirical studies demonstrate that Araida is adaptable to different annotation\ntasks and models. On average, it reduces human correction labor by 11.02%\ncompared to vanilla interactive data annotation methods.",
        "updated": "2024-05-20 09:48:15 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.11912v1"
    },
    {
        "title": "Demo Paper: A Game Agents Battle Driven by Free-Form Text Commands Using Code-Generation LLM",
        "authors": "Ray ItoJunichiro Takahashi",
        "links": "http://arxiv.org/abs/2405.11835v1",
        "entry_id": "http://arxiv.org/abs/2405.11835v1",
        "pdf_url": "http://arxiv.org/pdf/2405.11835v1",
        "summary": "This paper presents a demonstration of our monster battle game, in which the\ngame agents fight in accordance with their player's language commands. The\ncommands were translated into the knowledge expression called behavior branches\nby a code-generation large language model. This work facilitated the design of\nthe commanding system more easily, enabling the game agent to comprehend more\nvarious and continuous commands than rule-based methods. The results of the\ncommanding and translation process were stored in a database on an Amazon Web\nServices server for more comprehensive validation. This implementation would\nprovide a sufficient evaluation of this ongoing work, and give insights to the\nindustry that they could use this to develop their interactive game agents.",
        "updated": "2024-05-20 07:14:22 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.11835v1"
    },
    {
        "title": "Dual-sided Peltier Elements for Rapid Thermal Feedback in Wearables",
        "authors": "Seongjun KangGwangbin KimSeokhyun HwangJeongju ParkAhmed ElsharkawySeungJun Kim",
        "links": "http://arxiv.org/abs/2405.11807v1",
        "entry_id": "http://arxiv.org/abs/2405.11807v1",
        "pdf_url": "http://arxiv.org/pdf/2405.11807v1",
        "summary": "This paper introduces a motor-driven Peltier device designed to deliver\nimmediate thermal sensations within extended reality (XR) environments. The\nsystem incorporates eight motor-driven Peltier elements, facilitating swift\ntransitions between warm and cool sensations by rotating preheated or cooled\nelements to opposite sides. A multi-layer structure, comprising aluminum and\nsilicone layers, ensures user comfort and safety while maintaining optimal\ntemperatures for thermal stimuli. Time-temperature characteristic analysis\ndemonstrates the system's ability to provide warm and cool sensations\nefficiently, with a dual-sided lifetime of up to 206 seconds at a 2V input. Our\nsystem design is adaptable to various body parts and can be synchronized with\ncorresponding visual stimuli to enhance the immersive sensation of virtual\nobject interaction and information delivery.",
        "updated": "2024-05-20 06:00:12 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.11807v1"
    }
]