[
    {
        "title": "Learning to connect in action: Measuring and understanding the emergence of boundary spanners in volatile times",
        "authors": "Vittorio NespecaTina ComesFrances Brazier",
        "links": "http://arxiv.org/abs/2405.11998v1",
        "entry_id": "http://arxiv.org/abs/2405.11998v1",
        "pdf_url": "http://arxiv.org/pdf/2405.11998v1",
        "summary": "Collective intelligence of diverse groups is key for tackling many of today's\ngrand challenges such as fostering resilience and climate adaptation.\nInformation exchange across such diverse groups is crucial for collective\nintelligence, especially in volatile environments. To facilitate inter-group\ninformation exchange, Informational Boundary Spanners (IBSs) as pivotal\ninformation exchange 'hubs' are promising. However, the mechanisms that drive\nthe emergence of IBSs remain poorly understood. To address this gap there is\nfirst a need for a method to identify and measure the emergence of IBSs.\nSecond, an Agent-Based Modelling (ABM) framework is not available to\nsystematically study mechanisms for the emergence of IBSs in volatile\nenvironments. Third, even though the ability to learn who provides high-quality\ninformation is thought to be essential to explain the emergence of IBSs, a\nrigorous test of this mechanism is missing. The learning mechanism is\nformalized using an ABM framework, with the model's outputs analyzed using the\nproposed IBS emergence measurement method. To illustrate both the method and\nthe learning mechanism, we present a case study focused on information sharing\nin the volatile environment of a disaster. The study shows that learning\nconstitutes a mechanism for the emergence of effective IBSs in (a)\nlow-volatility environments characterised by low uncertainty and (b) in\nhigh-volatility environments characterised by rapid change if the number of\ninter-group connections is sufficient. With the method and model, this paper\naims to lay the foundations for exploring mechanisms for the emergence of IBSs\nthat facilitate inter-group information exchange. This article advances\ncollective intelligence by providing the essential elements for measuring and\nunderstanding the emergence of IBSs and exploring the effect of learning on\ntheir emergence in volatile environments.",
        "updated": "2024-05-20 13:09:52 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.11998v1"
    },
    {
        "title": "Safe by Design Autonomous Driving Systems",
        "authors": "Marius BozgaJoseph Sifakis",
        "links": "http://arxiv.org/abs/2405.11995v1",
        "entry_id": "http://arxiv.org/abs/2405.11995v1",
        "pdf_url": "http://arxiv.org/pdf/2405.11995v1",
        "summary": "Developing safe autonomous driving systems is a major scientific and\ntechnical challenge. Existing AI-based end-to-end solutions do not offer the\nnecessary safety guarantees, while traditional systems engineering approaches\nare defeated by the complexity of the problem. Currently, there is an\nincreasing interest in hybrid design solutions, integrating machine learning\ncomponents, when necessary, while using model-based components for goal\nmanagement and planning.\n  We study a method for building safe by design autonomous driving systems,\nbased on the assumption that the capability to drive boils down to the\ncoordinated execution of a given set of driving operations. The assumption is\nsubstantiated by a compositionality result considering that autopilots are\ndynamic systems receiving a small number of types of vistas as input, each\nvista defining a free space in its neighborhood. It is shown that safe driving\nfor each type of vista in the corresponding free space, implies safe driving\nfor any possible scenario under some easy-to-check conditions concerning the\ntransition between vistas. The designed autopilot comprises distinct control\npolicies one per type of vista, articulated in two consecutive phases. The\nfirst phase consists of carefully managing a potentially risky situation by\nvirtually reducing speed, while the second phase consists of exiting the\nsituation by accelerating.\n  The autopilots designed use for their predictions simple functions\ncharacterizing the acceleration and deceleration capabilities of the vehicles.\nThey cover the main driving operations, including entering a main road,\novertaking, crossing intersections protected by traffic lights or signals, and\ndriving on freeways. The results presented reinforce the case for hybrid\nsolutions that incorporate mathematically elegant and robust decision methods\nthat are safe by design.",
        "updated": "2024-05-20 12:58:25 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.11995v1"
    },
    {
        "title": "Equilibria in multiagent online problems with predictions",
        "authors": "Gabriel IstrateCosmin BonchişVictor Bogdan",
        "links": "http://arxiv.org/abs/2405.11873v1",
        "entry_id": "http://arxiv.org/abs/2405.11873v1",
        "pdf_url": "http://arxiv.org/pdf/2405.11873v1",
        "summary": "We study the power of (competitive) algorithms with predictions in a\nmultiagent setting. For this we introduce a multiagent version of the\nski-rental problem. In this problem agents can collaborate by pooling resources\nto get a group license for some asset. If the license price is not met agents\nhave to rent the asset individually for the day at a unit price. Otherwise the\nlicense becomes available forever to everyone at no extra cost. Our main\ncontribution is a best-response analysis of a single-agent competitive\nalgorithm that assumes perfect knowledge of other agents' actions (but no\nknowledge of its own renting time). We then analyze the setting when agents\nhave a predictor for their own active time, yielding a tradeoff between\nrobustness and consistency. We investigate the effect of using such a predictor\nin an equilibrium, as well as the new equilibria formed in this way.",
        "updated": "2024-05-20 08:30:11 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.11873v1"
    },
    {
        "title": "Efficient Multi-agent Reinforcement Learning by Planning",
        "authors": "Qihan LiuJianing YeXiaoteng MaJun YangBin LiangChongjie Zhang",
        "links": "http://arxiv.org/abs/2405.11778v1",
        "entry_id": "http://arxiv.org/abs/2405.11778v1",
        "pdf_url": "http://arxiv.org/pdf/2405.11778v1",
        "summary": "Multi-agent reinforcement learning (MARL) algorithms have accomplished\nremarkable breakthroughs in solving large-scale decision-making tasks.\nNonetheless, most existing MARL algorithms are model-free, limiting sample\nefficiency and hindering their applicability in more challenging scenarios. In\ncontrast, model-based reinforcement learning (MBRL), particularly algorithms\nintegrating planning, such as MuZero, has demonstrated superhuman performance\nwith limited data in many tasks. Hence, we aim to boost the sample efficiency\nof MARL by adopting model-based approaches. However, incorporating planning and\nsearch methods into multi-agent systems poses significant challenges. The\nexpansive action space of multi-agent systems often necessitates leveraging the\nnearly-independent property of agents to accelerate learning. To tackle this\nissue, we propose the MAZero algorithm, which combines a centralized model with\nMonte Carlo Tree Search (MCTS) for policy search. We design a novel network\nstructure to facilitate distributed execution and parameter sharing. To enhance\nsearch efficiency in deterministic environments with sizable action spaces, we\nintroduce two novel techniques: Optimistic Search Lambda (OS($\\lambda$)) and\nAdvantage-Weighted Policy Optimization (AWPO). Extensive experiments on the\nSMAC benchmark demonstrate that MAZero outperforms model-free approaches in\nterms of sample efficiency and provides comparable or better performance than\nexisting model-based methods in terms of both sample and computational\nefficiency. Our code is available at https://github.com/liuqh16/MAZero.",
        "updated": "2024-05-20 04:36:02 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.11778v1"
    },
    {
        "title": "Configurable Mirror Descent: Towards a Unification of Decision Making",
        "authors": "Pengdeng LiShuxin LiChang YangXinrun WangShuyue HuXiao HuangHau ChanBo An",
        "links": "http://arxiv.org/abs/2405.11746v1",
        "entry_id": "http://arxiv.org/abs/2405.11746v1",
        "pdf_url": "http://arxiv.org/pdf/2405.11746v1",
        "summary": "Decision-making problems, categorized as single-agent, e.g., Atari,\ncooperative multi-agent, e.g., Hanabi, competitive multi-agent, e.g., Hold'em\npoker, and mixed cooperative and competitive, e.g., football, are ubiquitous in\nthe real world. Various methods are proposed to address the specific\ndecision-making problems. Despite the successes in specific categories, these\nmethods typically evolve independently and cannot generalize to other\ncategories. Therefore, a fundamental question for decision-making is: \\emph{Can\nwe develop \\textbf{a single algorithm} to tackle \\textbf{ALL} categories of\ndecision-making problems?} There are several main challenges to address this\nquestion: i) different decision-making categories involve different numbers of\nagents and different relationships between agents, ii) different categories\nhave different solution concepts and evaluation measures, and iii) there lacks\na comprehensive benchmark covering all the categories. This work presents a\npreliminary attempt to address the question with three main contributions. i)\nWe propose the generalized mirror descent (GMD), a generalization of MD\nvariants, which considers multiple historical policies and works with a broader\nclass of Bregman divergences. ii) We propose the configurable mirror descent\n(CMD) where a meta-controller is introduced to dynamically adjust the\nhyper-parameters in GMD conditional on the evaluation measures. iii) We\nconstruct the \\textsc{GameBench} with 15 academic-friendly games across\ndifferent decision-making categories. Extensive experiments demonstrate that\nCMD achieves empirically competitive or better outcomes compared to baselines\nwhile providing the capability of exploring diverse dimensions of decision\nmaking.",
        "updated": "2024-05-20 03:10:22 UTC",
        "interpretation": "解释内容未找到",
        "id": "2405.11746v1"
    }
]