[
    {
        "title": "Scale-Robust Timely Asynchronous Decentralized Learning",
        "authors": "Purbesh MitraSennur Ulukus",
        "links": "http://arxiv.org/abs/2404.19749v1",
        "entry_id": "http://arxiv.org/abs/2404.19749v1",
        "pdf_url": "http://arxiv.org/pdf/2404.19749v1",
        "summary": "We consider an asynchronous decentralized learning system, which consists of\na network of connected devices trying to learn a machine learning model without\nany centralized parameter server. The users in the network have their own local\ntraining data, which is used for learning across all the nodes in the network.\nThe learning method consists of two processes, evolving simultaneously without\nany necessary synchronization. The first process is the model update, where the\nusers update their local model via a fixed number of stochastic gradient\ndescent steps. The second process is model mixing, where the users communicate\nwith each other via randomized gossiping to exchange their models and average\nthem to reach consensus. In this work, we investigate the staleness criteria\nfor such a system, which is a sufficient condition for convergence of\nindividual user models. We show that for network scaling, i.e., when the number\nof user devices $n$ is very large, if the gossip capacity of individual users\nscales as $\\Omega(\\log n)$, we can guarantee the convergence of user models in\nfinite time. Furthermore, we show that the bounded staleness can only be\nguaranteed by any distributed opportunistic scheme by $\\Omega(n)$ scaling.",
        "updated": "2024-04-30 17:54:16 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.19749v1"
    },
    {
        "title": "Analyzing Transport Policies in Developing Countries with ABM",
        "authors": "Kathleen Salazar-SernaLorena CadavidCarlos Franco",
        "links": "http://arxiv.org/abs/2404.19745v1",
        "entry_id": "http://arxiv.org/abs/2404.19745v1",
        "pdf_url": "http://arxiv.org/pdf/2404.19745v1",
        "summary": "Deciphering travel behavior and mode choices is a critical aspect of\neffective urban transportation system management, particularly in developing\ncountries where unique socio-economic and cultural conditions complicate\ndecision-making. Agent-based simulations offer a valuable tool for modeling\ntransportation systems, enabling a nuanced understanding and policy impact\nevaluation. This work aims to shed light on the effects of transport policies\nand analyzes travel behavior by simulating agents making mode choices for their\ndaily commutes. Agents gather information from the environment and their social\nnetwork to assess the optimal transport option based on personal satisfaction\ncriteria. Our findings, stemming from simulating a free-fare policy for public\ntransit in a developing-country city, reveal a significant influence on\ndecision-making, fostering public service use while positively influencing\npollution levels, accident rates, and travel speed.",
        "updated": "2024-04-30 17:47:30 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.19745v1"
    },
    {
        "title": "Time, Travel, and Energy in the Uniform Dispersion Problem",
        "authors": "Michael AmirAlfred M. Bruckstein",
        "links": "http://arxiv.org/abs/2404.19564v1",
        "entry_id": "http://arxiv.org/abs/2404.19564v1",
        "pdf_url": "http://arxiv.org/pdf/2404.19564v1",
        "summary": "We investigate the algorithmic problem of uniformly dispersing a swarm of\nrobots in an unknown, gridlike environment. In this setting, our goal is to\ncomprehensively study the relationships between performance metrics and robot\ncapabilities. We introduce a formal model comparing dispersion algorithms based\non makespan, traveled distance, energy consumption, sensing, communication, and\nmemory. Using this framework, we classify several uniform dispersion algorithms\naccording to their capability requirements and performance. We prove that while\nmakespan and travel can be minimized in all environments, energy cannot, as\nlong as the swarm's sensing range is bounded. In contrast, we show that energy\ncan be minimized even by simple, ``ant-like\" robots in synchronous settings and\nasymptotically minimized in asynchronous settings, provided the environment is\ntopologically simply connected. Our findings offer insights into fundamental\nlimitations that arise when designing swarm robotics systems for exploring\nunknown environments, highlighting the impact of environment's topology on the\nfeasibility of energy-efficient dispersion.",
        "updated": "2024-04-30 13:51:44 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.19564v1"
    },
    {
        "title": "Distributed Traffic Signal Control via Coordinated Maximum Pressure-plus-Penalty",
        "authors": "Vinzenz TütschZhiyu HeFlorian DörflerKenan Zhang",
        "links": "http://arxiv.org/abs/2404.19547v1",
        "entry_id": "http://arxiv.org/abs/2404.19547v1",
        "pdf_url": "http://arxiv.org/pdf/2404.19547v1",
        "summary": "This paper develops an adaptive traffic control policy inspired by Maximum\nPressure (MP) while imposing coordination across intersections. The proposed\nCoordinated Maximum Pressure-plus-Penalty (CMPP) control policy features a\nlocal objective for each intersection that consists of the total pressure\nwithin the neighborhood and a penalty accounting for the queue capacities and\ncontinuous green time for certain movements. The corresponding control task is\nreformulated as a distributed optimization problem and solved via two\ncustomized algorithms: one based on the alternating direction method of\nmultipliers (ADMM) and the other follows a greedy heuristic augmented with a\nmajority vote. CMPP not only provides a theoretical guarantee of queuing\nnetwork stability but also outperforms several benchmark controllers in\nsimulations on a large-scale real traffic network with lower average travel and\nwaiting time per vehicle, as well as less network congestion. Furthermore, CPMM\nwith the greedy algorithm enjoys comparable computational efficiency as fully\ndecentralized controllers without significantly compromising the control\nperformance, which highlights its great potential for real-world deployment.",
        "updated": "2024-04-30 13:16:05 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.19547v1"
    },
    {
        "title": "MGCBS: An Optimal and Efficient Algorithm for Solving Multi-Goal Multi-Agent Path Finding Problem",
        "authors": "Mingkai TangYuanhang LiHongji LiuYingbing ChenMing LiuLujia Wang",
        "links": "http://arxiv.org/abs/2404.19518v1",
        "entry_id": "http://arxiv.org/abs/2404.19518v1",
        "pdf_url": "http://arxiv.org/pdf/2404.19518v1",
        "summary": "With the expansion of the scale of robotics applications, the multi-goal\nmulti-agent pathfinding (MG-MAPF) problem began to gain widespread attention.\nThis problem requires each agent to visit pre-assigned multiple goal points at\nleast once without conflict. Some previous methods have been proposed to solve\nthe MG-MAPF problem based on Decoupling the goal Vertex visiting order search\nand the Single-agent pathfinding (DVS). However, this paper demonstrates that\nthe methods based on DVS cannot always obtain the optimal solution. To obtain\nthe optimal result, we propose the Multi-Goal Conflict-Based Search (MGCBS),\nwhich is based on Decoupling the goal Safe interval visiting order search and\nthe Single-agent pathfinding (DSS). Additionally, we present the\nTime-Interval-Space Forest (TIS Forest) to enhance the efficiency of MGCBS by\nmaintaining the shortest paths from any start point at any start time step to\neach safe interval at the goal points. The experiment demonstrates that our\nmethod can consistently obtain optimal results and execute up to 7 times faster\nthan the state-of-the-art method in our evaluation.",
        "updated": "2024-04-30 12:49:54 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.19518v1"
    }
]