[
    {
        "title": "Reducing Leximin Fairness to Utilitarian Optimization",
        "authors": "Eden HartmanYonatan AumannAvinatan HassidimErel Segal-Halevi",
        "links": "http://arxiv.org/abs/2409.10395v1",
        "entry_id": "http://arxiv.org/abs/2409.10395v1",
        "pdf_url": "http://arxiv.org/pdf/2409.10395v1",
        "summary": "Two prominent objectives in social choice are utilitarian - maximizing the\nsum of agents' utilities, and leximin - maximizing the smallest agent's\nutility, then the second-smallest, etc. Utilitarianism is typically\ncomputationally easier to attain but is generally viewed as less fair. This\npaper presents a general reduction scheme that, given a utilitarian solver,\nproduces a distribution over outcomes that is leximin in expectation.\nImportantly, the scheme is robust in the sense that, given an approximate\nutilitarian solver, it produces an outcome that is approximately-leximin (in\nexpectation) - with the same approximation factor. We apply our scheme to\nseveral social choice problems: stochastic allocations of indivisible goods,\ngiveaway lotteries, and fair lotteries for participatory budgeting.",
        "updated": "2024-09-16 15:31:41 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.10395v1"
    },
    {
        "title": "Synchronization-Based Cooperative Distributed Model Predictive Control",
        "authors": "Julius BeerwerthMaximilian KloockBassam Alrifaee",
        "links": "http://arxiv.org/abs/2409.10215v1",
        "entry_id": "http://arxiv.org/abs/2409.10215v1",
        "pdf_url": "http://arxiv.org/pdf/2409.10215v1",
        "summary": "Distributed control algorithms are known to reduce overall computation time\ncompared to centralized control algorithms. However, they can result in\ninconsistent solutions leading to the violation of safety-critical constraints.\nInconsistent solutions can arise when two or more agents compute concurrently\nwhile making predictions on each others control actions. To address this issue,\nwe propose an iterative algorithm called Synchronization-Based Cooperative\nDistributed Model Predictive Control, which we presented in [1]. The algorithm\nconsists of two steps: 1. computing the optimal control inputs for each agent\nand 2. synchronizing the predicted states across all agents. We demonstrate the\nefficacy of our algorithm in the control of multiple small-scale vehicles in\nour Cyber-Physical Mobility Lab.",
        "updated": "2024-09-16 12:06:06 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.10215v1"
    },
    {
        "title": "Multi-Agent Obstacle Avoidance using Velocity Obstacles and Control Barrier Functions",
        "authors": "Alejandro Sánchez RonceroRafael I. Cabral MuchachoPetter Ögren",
        "links": "http://arxiv.org/abs/2409.10117v1",
        "entry_id": "http://arxiv.org/abs/2409.10117v1",
        "pdf_url": "http://arxiv.org/pdf/2409.10117v1",
        "summary": "Velocity Obstacles (VO) methods form a paradigm for collision avoidance\nstrategies among moving obstacles and agents. While VO methods perform well in\nsimple multi-agent environments, they don't guarantee safety and can show\noverly conservative behavior in common situations. In this paper, we propose to\ncombine a VO-strategy for guidance with a CBF-approach for safety, which\novercomes the overly conservative behavior of VOs and formally guarantees\nsafety. We validate our method in a baseline comparison study, using 2nd order\nintegrator and car-like dynamics. Results support that our method outperforms\nthe baselines w.r.t. path smoothness, collision avoidance, and success rates.",
        "updated": "2024-09-16 09:29:38 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.10117v1"
    },
    {
        "title": "Bearing-Distance Based Flocking with Zone-Based Interactions",
        "authors": "Hossein B. Jond",
        "links": "http://arxiv.org/abs/2409.10047v1",
        "entry_id": "http://arxiv.org/abs/2409.10047v1",
        "pdf_url": "http://arxiv.org/pdf/2409.10047v1",
        "summary": "This paper presents a novel zone-based flocking control approach suitable for\ndynamic multi-agent systems (MAS). Inspired by Reynolds behavioral rules for\n$boids$, flocking behavioral rules with the zones of repulsion, conflict,\nattraction, and surveillance are introduced. For each agent, using only bearing\nand distance measurements, behavioral deviation vectors quantify the deviations\nfrom the local separation, local and global flock velocity alignment, local\ncohesion, obstacle avoidance and boundary conditions, and strategic separation\nfor avoiding alien agents. The control strategy uses the local perception-based\nbehavioral deviation vectors to guide each agent's motion. Additionally, the\ncontrol strategy incorporates a directionally-aware obstacle avoidance\nmechanism that prioritizes obstacles in the agent's forward path. Simulation\nresults validate the effectiveness of this approach in creating flexible,\nadaptable, and scalable flocking behavior.",
        "updated": "2024-09-16 07:20:29 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.10047v1"
    },
    {
        "title": "Optimality Gap of Decentralized Submodular Maximization under Probabilistic Communication",
        "authors": "Joan VendrellSolmaz Kia",
        "links": "http://arxiv.org/abs/2409.09979v1",
        "entry_id": "http://arxiv.org/abs/2409.09979v1",
        "pdf_url": "http://arxiv.org/pdf/2409.09979v1",
        "summary": "This paper considers the problem of decentralized submodular maximization\nsubject to partition matroid constraint using a sequential greedy algorithm\nwith probabilistic inter-agent message-passing. We propose a\ncommunication-aware framework where the probability of successful communication\nbetween connected devices is considered. Our analysis introduces the notion of\nthe probabilistic optimality gap, highlighting its potential influence on\ndetermining the message-passing sequence based on the agent's broadcast\nreliability and strategic decisions regarding agents that can broadcast their\nmessages multiple times in a resource-limited environment. This work not only\ncontributes theoretical insights but also has practical implications for\ndesigning and analyzing decentralized systems in uncertain communication\nenvironments. A numerical example demonstrates the impact of our results.",
        "updated": "2024-09-16 04:18:16 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.09979v1"
    }
]