[
    {
        "title": "A Day-to-Day Dynamical Approach to the Most Likely User Equilibrium Problem",
        "authors": "Jiayang LiQianni WangLiyang FengJun XieYu Marco Nie",
        "links": "http://arxiv.org/abs/2401.08013v1",
        "entry_id": "http://arxiv.org/abs/2401.08013v1",
        "pdf_url": "http://arxiv.org/pdf/2401.08013v1",
        "summary": "The lack of a unique user equilibrium (UE) route flow in traffic assignment\nhas posed a significant challenge to many transportation applications. The\nmaximum-entropy principle, which advocates for the consistent selection of the\nmost likely solution as a representative, is often used to address the\nchallenge. Built on a recently proposed day-to-day (DTD) discrete-time\ndynamical model called cumulative logit (CULO), this study provides a new\nbehavioral underpinning for the maximum-entropy UE (MEUE) route flow. It has\nbeen proven that CULO can reach a UE state without presuming travelers are\nperfectly rational. Here, we further establish that CULO always converges to\nthe MEUE route flow if (i) travelers have zero prior information about routes\nand thus are forced to give all routes an equal choice probability, or (ii) all\ntravelers gather information from the same source such that the so-called\ngeneral proportionality condition is satisfied. Thus, CULO may be used as a\npractical solution algorithm for the MEUE problem. To put this idea into\npractice, we propose to eliminate the route enumeration requirement of the\noriginal CULO model through an iterative route discovery scheme. We also\nexamine the discrete-time versions of four popular continuous-time dynamical\nmodels and compare them to CULO. The analysis shows that the replicator dynamic\nis the only one that has the potential to reach the MEUE solution with some\nregularity. The analytical results are confirmed through numerical experiments.",
        "updated": "2024-01-15 23:43:41 UTC",
        "id": 1
    },
    {
        "title": "Emergency Localization for Mobile Ground Users: An Adaptive UAV Trajectory Planning Method",
        "authors": "Zhihao ZhuJiafan HeLuyang HouLianming XuWendi ZhuLi Wang",
        "links": "http://arxiv.org/abs/2401.07256v1",
        "entry_id": "http://arxiv.org/abs/2401.07256v1",
        "pdf_url": "http://arxiv.org/pdf/2401.07256v1",
        "summary": "In emergency search and rescue scenarios, the quick location of trapped\npeople is essential. However, disasters can render the Global Positioning\nSystem (GPS) unusable. Unmanned aerial vehicles (UAVs) with localization\ndevices can serve as mobile anchors due to their agility and high line-of-sight\n(LoS) probability. Nonetheless, the number of available UAVs during the initial\nstages of disaster relief is limited, and innovative methods are needed to\nquickly plan UAV trajectories to locate non-uniformly distributed dynamic\ntargets while ensuring localization accuracy. To address this challenge, we\ndesign a single UAV localization method without hovering, use the maximum\nlikelihood estimation (MLE) method to estimate the location of mobile users and\ndefine the upper bound of the localization error by considering users'\nmovement.Combining this localization method and localization error-index, we\nutilize the enhanced particle swarm optimization (EPSO) algorithm and edge\naccess strategy to develop a low complexity localization-oriented adaptive\ntrajectory planning algorithm. Simulation results demonstrate that our method\noutperforms other baseline algorithms, enabling faster localization without\ncompromising localization accuracy.",
        "updated": "2024-01-14 11:20:20 UTC",
        "id": 2
    },
    {
        "title": "Trust from Ethical Point of View: Exploring Dynamics Through Multiagent-Driven Cognitive Modeling",
        "authors": "Abbas Tariverdi",
        "links": "http://arxiv.org/abs/2401.07255v1",
        "entry_id": "http://arxiv.org/abs/2401.07255v1",
        "pdf_url": "http://arxiv.org/pdf/2401.07255v1",
        "summary": "The paper begins by exploring the rationality of ethical trust as a\nfoundational concept. This involves distinguishing between trust and\ntrustworthiness and delving into scenarios where trust is both rational and\nmoral. It lays the groundwork for understanding the complexities of trust\ndynamics in decision-making scenarios. Following this theoretical groundwork,\nwe introduce an agent-based simulation framework that investigates these\ndynamics of ethical trust, specifically in the context of a disaster response\nscenario. These agents, utilizing emotional models like Plutchik's Wheel of\nEmotions and memory learning mechanisms, are tasked with allocating limited\nresources in disaster-affected areas. The model, which embodies the principles\ndiscussed in the first section, integrates cognitive load management, Big Five\npersonality traits, and structured interactions within networked or\nhierarchical settings. It also includes feedback loops and simulates external\nevents to evaluate their impact on the formation and evolution of trust among\nagents. Through our simulations, we demonstrate the intricate interplay of\ncognitive, emotional, and social factors in ethical decision-making. These\ninsights shed light on the behaviors and resilience of trust networks in crisis\nsituations, emphasizing the role of rational and moral considerations in the\ndevelopment of trust among autonomous agents. This study contributes to the\nfield by offering an understanding of trust dynamics in socio-technical systems\nand by providing a robust, adaptable framework capable of addressing ethical\ndilemmas in disaster response and beyond. The implementation of the algorithms\npresented in this paper is available at this GitHub repository:\n\\url{https://github.com/abbas-tari/ethical-trust-cognitive-modeling}.",
        "updated": "2024-01-14 11:19:18 UTC",
        "id": 3
    },
    {
        "title": "A Dynamic Agent Based Model of the Real Economy with Monopolistic Competition, Perfect Product Differentiation, Heterogeneous Agents, Increasing Returns to Scale and Trade in Disequilibrium",
        "authors": "Subhamon SupanthaNaresh Kumar Sharma",
        "links": "http://arxiv.org/abs/2401.07070v1",
        "entry_id": "http://arxiv.org/abs/2401.07070v1",
        "pdf_url": "http://arxiv.org/pdf/2401.07070v1",
        "summary": "We have used agent-based modeling as our numerical method to artificially\nsimulate a dynamic real economy where agents are rational maximizers of an\nobjective function of Cobb-Douglas type. The economy is characterised by\nheterogeneous agents, acting out of local or imperfect information,\nmonopolistic competition, perfect product differentiation, allowance for\nincreasing returns to scale technology and trade in disequilibrium. An\nalgorithm for economic activity in each period is devised and a general purpose\nopen source agent-based model is developed which allows for counterfactual\ninquiries, testing out treatments, analysing causality of various economic\nprocesses, outcomes and studying emergent properties. 10,000 simulations, with\n10 firms and 80 consumers are run with varying parameters and the results show\nthat from only a few initial conditions the economy reaches equilibrium while\nin most of the other cases it remains in perpetual disequilibrium. It also\nshows that from a few initial conditions the economy reaches a disaster where\nall the consumer wealth falls to zero or only a single producer remains.\nFurthermore, from some initial conditions, an ideal economy with high wage\nrate, high consumer utility and no unemployment is also reached. It was also\nobserved that starting from an equal endowment of wealth in consumers and in\nproducers, inequality emerged in the economy. In majority of the cases most of\nthe firms(6-7) shut down because they were not profitable enough and only a few\nfirms remained. Our results highlight that all these varying outcomes are\npossible for a decentralized market economy with rational optimizing agents.",
        "updated": "2024-01-13 13:10:20 UTC",
        "id": 4
    },
    {
        "title": "Aquarium: A Comprehensive Framework for Exploring Predator-Prey Dynamics through Multi-Agent Reinforcement Learning Algorithms",
        "authors": "Michael KölleYannick ErpeldingFabian RitzThomy PhanSteffen IlliumClaudia Linnhoff-Popien",
        "links": "http://arxiv.org/abs/2401.07056v1",
        "entry_id": "http://arxiv.org/abs/2401.07056v1",
        "pdf_url": "http://arxiv.org/pdf/2401.07056v1",
        "summary": "Recent advances in Multi-Agent Reinforcement Learning have prompted the\nmodeling of intricate interactions between agents in simulated environments. In\nparticular, the predator-prey dynamics have captured substantial interest and\nvarious simulations been tailored to unique requirements. To prevent further\ntime-intensive developments, we introduce Aquarium, a comprehensive Multi-Agent\nReinforcement Learning environment for predator-prey interaction, enabling the\nstudy of emergent behavior. Aquarium is open source and offers a seamless\nintegration of the PettingZoo framework, allowing a quick start with proven\nalgorithm implementations. It features physics-based agent movement on a\ntwo-dimensional, edge-wrapping plane. The agent-environment interaction\n(observations, actions, rewards) and the environment settings (agent speed,\nprey reproduction, predator starvation, and others) are fully customizable.\nBesides a resource-efficient visualization, Aquarium supports to record video\nfiles, providing a visual comprehension of agent behavior. To demonstrate the\nenvironment's capabilities, we conduct preliminary studies which use PPO to\ntrain multiple prey agents to evade a predator. In accordance to the\nliterature, we find Individual Learning to result in worse performance than\nParameter Sharing, which significantly improves coordination and\nsample-efficiency.",
        "updated": "2024-01-13 12:09:49 UTC",
        "id": 5
    }
]