[
    {
        "title": "Harder, Better, Faster, Stronger: Interactive Visualization for Human-Centered AI Tools",
        "authors": "Md Naimul HoqueSungbok ShinNiklas Elmqvist",
        "links": "http://arxiv.org/abs/2404.02147v1",
        "entry_id": "http://arxiv.org/abs/2404.02147v1",
        "pdf_url": "http://arxiv.org/pdf/2404.02147v1",
        "summary": "Human-centered AI (HCAI), rather than replacing the human, puts the human\nuser in the driver's seat of so-called human-centered AI-infused tools (HCAI\ntools): interactive software tools that amplify, augment, empower, and enhance\nhuman performance using AI models; often novel generative or foundation AI\nones. In this paper, we discuss how interactive visualization can be a key\nenabling technology for creating such human-centered AI tools. Visualization\nhas already been shown to be a fundamental component in explainable AI models,\nand coupling this with data-driven, semantic, and unified interaction feedback\nloops will enable a human-centered approach to integrating AI models in the\nloop with human users. We present several examples of our past and current work\non such HCAI tools, including for creative writing, temporal prediction, and\nuser experience analysis. We then draw parallels between these tools to suggest\ncommon themes on how interactive visualization can support the design of future\nHCAI tools.",
        "updated": "2024-04-02 17:57:57 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.02147v1"
    },
    {
        "title": "The Effects of Group Sanctions on Participation and Toxicity: Quasi-experimental Evidence from the Fediverse",
        "authors": "Carl ColglazierNathan TeBlunthuisAaron Shaw",
        "links": "http://arxiv.org/abs/2404.02109v1",
        "entry_id": "http://arxiv.org/abs/2404.02109v1",
        "pdf_url": "http://arxiv.org/pdf/2404.02109v1",
        "summary": "Online communities often overlap and coexist, despite incongruent norms and\napproaches to content moderation. When communities diverge, decentralized and\nfederated communities may pursue group-level sanctions, including defederation\n(disconnection) to block communication between members of specific communities.\nWe investigate the effects of defederation in the context of the Fediverse, a\nset of decentralized, interconnected social networks with independent\ngovernance. Mastodon and Pleroma, the most popular software powering the\nFediverse, allow administrators on one server to defederate from another. We\nuse a difference-in-differences approach and matched controls to estimate the\neffects of defederation events on participation and message toxicity among\naffected members of the blocked and blocking servers. We find that defederation\ncauses a drop in activity for accounts on the blocked servers, but not on the\nblocking servers. Also, we find no evidence of an effect of defederation on\nmessage toxicity.",
        "updated": "2024-04-02 17:10:33 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.02109v1"
    },
    {
        "title": "Explainability in JupyterLab and Beyond: Interactive XAI Systems for Integrated and Collaborative Workflows",
        "authors": "Grace GuoDustin ArendtAlex Endert",
        "links": "http://arxiv.org/abs/2404.02081v1",
        "entry_id": "http://arxiv.org/abs/2404.02081v1",
        "pdf_url": "http://arxiv.org/pdf/2404.02081v1",
        "summary": "Explainable AI (XAI) tools represent a turn to more human-centered and\nhuman-in-the-loop AI approaches that emphasize user needs and perspectives in\nmachine learning model development workflows. However, while the majority of ML\nresources available today are developed for Python computational environments\nsuch as JupyterLab and Jupyter Notebook, the same has not been true of\ninteractive XAI systems, which are often still implemented as standalone\ninterfaces. In this paper, we address this mismatch by identifying three design\npatterns for embedding front-end XAI interfaces into Jupyter, namely: 1)\nOne-way communication from Python to JavaScript, 2) Two-way data\nsynchronization, and 3) Bi-directional callbacks. We also provide an\nopen-source toolkit, bonXAI, that demonstrates how each design pattern might be\nused to build interactive XAI tools for a Pytorch text classification workflow.\nFinally, we conclude with a discussion of best practices and open questions.\nOur aims for this paper are to discuss how interactive XAI tools might be\ndeveloped for computational notebooks, and how they can better integrate into\nexisting model development workflows to support more collaborative,\nhuman-centered AI.",
        "updated": "2024-04-02 16:27:44 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.02081v1"
    },
    {
        "title": "Preuve de concept d'un bot vocal dialoguant en wolof",
        "authors": "Elodie GauthierPapa-Séga WadeThierry MoudencPatrice CollenEmilie De NeefOumar BaNdeye Khoyane CamaCheikh Ahmadou Bamba KebeNdeye Aissatou GningueThomas Mendo'o Aristide",
        "links": "http://arxiv.org/abs/2404.02009v1",
        "entry_id": "http://arxiv.org/abs/2404.02009v1",
        "pdf_url": "http://arxiv.org/pdf/2404.02009v1",
        "summary": "This paper presents the proof-of-concept of the first automatic voice\nassistant ever built in Wolof language, the main vehicular language spoken in\nSenegal. This voicebot is the result of a collaborative research project\nbetween Orange Innovation in France, Orange Senegal (aka Sonatel) and ADNCorp,\na small IT company based in Dakar, Senegal. The purpose of the voicebot is to\nprovide information to Orange customers about the Sargal loyalty program of\nOrange Senegal by using the most natural mean to communicate: speech. The\nvoicebot receives in input the customer's oral request that is then processed\nby a SLU system to reply to the customer's request using audio recordings. The\nfirst results of this proof-of-concept are encouraging as we achieved 22\\% of\nWER for the ASR task and 78\\% of F1-score on the NLU task.",
        "updated": "2024-04-02 14:53:41 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.02009v1"
    },
    {
        "title": "Cash or Non-Cash? Unveiling Ideators' Incentive Preferences in Crowdsourcing Contests",
        "authors": "Christoph RiedlJohann FüllerKatja HutterGerard J. Tellis",
        "links": "http://arxiv.org/abs/2404.01997v1",
        "entry_id": "http://arxiv.org/abs/2404.01997v1",
        "pdf_url": "http://arxiv.org/pdf/2404.01997v1",
        "summary": "Even though research has repeatedly shown that non-cash incentives can be\neffective, cash incentives are the de facto standard in crowdsourcing contests.\nIn this multi-study research, we quantify ideators' preferences for non-cash\nincentives and investigate how allowing ideators to self-select their preferred\nincentive -- offering ideators a choice between cash and non-cash incentives --\naffects their creative performance. We further explore whether the market\ncontext of the organization hosting the contest -- social (non-profit) or\nmonetary (for-profit) -- moderates incentive preferences and their\neffectiveness. We find that individuals exhibit heterogeneous incentive\npreferences and often prefer non-cash incentives, even in for-profit contexts.\nOffering ideators a choice of incentives can enhance creative performance.\nMarket context moderates the effect of incentives, such that ideators who\nreceive non-cash incentives in for-profit contexts tend to exert less effort.\nWe show that heterogeneity of ideators' preferences (and the ability to satisfy\ndiverse preferences with suitably diverse incentive options) is a critical\nboundary condition to realizing benefits from offering ideators a choice of\nincentives. We provide managers with guidance to design effective incentives by\nimproving incentive-preference fit for ideators.",
        "updated": "2024-04-02 14:41:05 UTC",
        "interpretation": "解释内容未找到",
        "id": "2404.01997v1"
    }
]