[
    {
        "title": "Offline and Distributional Reinforcement Learning for Radio Resource Management",
        "authors": "Eslam EldeebHirley Alves",
        "links": "http://arxiv.org/abs/2409.16764v1",
        "entry_id": "http://arxiv.org/abs/2409.16764v1",
        "pdf_url": "http://arxiv.org/pdf/2409.16764v1",
        "summary": "Reinforcement learning (RL) has proved to have a promising role in future\nintelligent wireless networks. Online RL has been adopted for radio resource\nmanagement (RRM), taking over traditional schemes. However, due to its reliance\non online interaction with the environment, its role becomes limited in\npractical, real-world problems where online interaction is not feasible. In\naddition, traditional RL stands short in front of the uncertainties and risks\nin real-world stochastic environments. In this manner, we propose an offline\nand distributional RL scheme for the RRM problem, enabling offline training\nusing a static dataset without any interaction with the environment and\nconsidering the sources of uncertainties using the distributions of the return.\nSimulation results demonstrate that the proposed scheme outperforms\nconventional resource management models. In addition, it is the only scheme\nthat surpasses online RL and achieves a $16 \\%$ gain over online RL.",
        "updated": "2024-09-25 09:22:23 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.16764v1"
    },
    {
        "title": "Extending Stable and Popular Matching Algorithms from Bipartite to Arbitrary Instances",
        "authors": "Gergely Csáji",
        "links": "http://arxiv.org/abs/2409.16173v2",
        "entry_id": "http://arxiv.org/abs/2409.16173v2",
        "pdf_url": "http://arxiv.org/pdf/2409.16173v2",
        "summary": "We consider stable and popular matching problems in arbitrary graphs, which\nare referred to as stable roommates instances. We extend the 3/2-approximation\nalgorithm for the maximum size weakly stable matching problem to the roommates\ncase, which solves a more than 20 year old open question of Irving and Manlove\nabout the approximability of maximum size weakly stable matchings in roommates\ninstances with ties [Irving and Manlove 2002] and has nice applications for the\nproblem of matching residents to hospitals in the presence of couples. We also\nextend the algorithm that finds a maximum size popular matching in bipartite\ngraphs in the case of strict preferences and the algorithm to find a popular\nmatching among maximum weight matchings. While previous attempts to extend the\nidea of promoting the agents or duplicating the edges from bipartite instances\nto arbitrary ones failed, these results show that with the help of a simple\nobservation, we can indeed bridge the gap and extend these algorithms",
        "updated": "2024-09-25 07:16:36 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.16173v2"
    },
    {
        "title": "Introducing Anisotropic Fields for Enhanced Diversity in Crowd Simulation",
        "authors": "Yihao LiJunyu LiuXiaoyu GuanHanming HouTianyu Huang",
        "links": "http://arxiv.org/abs/2409.15831v1",
        "entry_id": "http://arxiv.org/abs/2409.15831v1",
        "pdf_url": "http://arxiv.org/pdf/2409.15831v1",
        "summary": "Large crowds exhibit intricate behaviors and significant emergent properties,\nyet existing crowd simulation systems often lack behavioral diversity,\nresulting in homogeneous simulation outcomes. To address this limitation, we\npropose incorporating anisotropic fields (AFs) as a fundamental structure for\ndepicting the uncertainty in crowd movement. By leveraging AFs, our method can\nrapidly generate crowd simulations with intricate behavioral patterns that\nbetter reflect the inherent complexity of real crowds. The AFs are generated\neither through intuitive sketching or extracted from real crowd videos,\nenabling flexible and efficient crowd simulation systems. We demonstrate the\neffectiveness of our approach through several representative scenarios,\nshowcasing a significant improvement in behavioral diversity compared to\nclassical methods. Our findings indicate that by incorporating AFs, crowd\nsimulation systems can achieve a much higher similarity to real-world crowd\nsystems. Our code is publicly available at\nhttps://github.com/tomblack2014/AF\\_Generation.",
        "updated": "2024-09-24 07:54:11 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.15831v1"
    },
    {
        "title": "SPformer: A Transformer Based DRL Decision Making Method for Connected Automated Vehicles",
        "authors": "Ye HanLijun ZhangDejian MengXingyu HuYixia Lu",
        "links": "http://arxiv.org/abs/2409.15105v1",
        "entry_id": "http://arxiv.org/abs/2409.15105v1",
        "pdf_url": "http://arxiv.org/pdf/2409.15105v1",
        "summary": "In mixed autonomy traffic environment, every decision made by an\nautonomous-driving car may have a great impact on the transportation system.\nBecause of the complex interaction between vehicles, it is challenging to make\ndecisions that can ensure both high traffic efficiency and safety now and\nfuther. Connected automated vehicles (CAVs) have great potential to improve the\nquality of decision-making in this continuous, highly dynamic and interactive\nenvironment because of their stronger sensing and communicating ability. For\nmulti-vehicle collaborative decision-making algorithms based on deep\nreinforcement learning (DRL), we need to represent the interactions between\nvehicles to obtain interactive features. The representation in this aspect\ndirectly affects the learning efficiency and the quality of the learned policy.\nTo this end, we propose a CAV decision-making architecture based on transformer\nand reinforcement learning algorithms. A learnable policy token is used as the\nlearning medium of the multi-vehicle joint policy, the states of all vehicles\nin the area of interest can be adaptively noticed in order to extract\ninteractive features among agents. We also design an intuitive physical\npositional encodings, the redundant location information of which optimizes the\nperformance of the network. Simulations show that our model can make good use\nof all the state information of vehicles in traffic scenario, so as to obtain\nhigh-quality driving decisions that meet efficiency and safety objectives. The\ncomparison shows that our method significantly improves existing DRL-based\nmulti-vehicle cooperative decision-making algorithms.",
        "updated": "2024-09-23 15:16:35 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.15105v1"
    },
    {
        "title": "Method of Equal Shares with Bounded Overspending",
        "authors": "Georgios PapasotiropoulosSeyedeh Zeinab PishbinOskar SkibskiPiotr SkowronTomasz Wąs",
        "links": "http://arxiv.org/abs/2409.15005v1",
        "entry_id": "http://arxiv.org/abs/2409.15005v1",
        "pdf_url": "http://arxiv.org/pdf/2409.15005v1",
        "summary": "In participatory budgeting (PB), voters decide through voting which subset of\nprojects to fund within a given budget. Proportionality in the context of PB is\ncrucial to ensure equal treatment of all groups of voters. However, pure\nproportional rules can sometimes lead to suboptimal outcomes. We introduce the\nMethod of Equal Shares with Bounded Overspending (BOS Equal Shares), a robust\nvariant of Equal Shares that balances proportionality and efficiency. BOS Equal\nShares addresses inefficiencies inherent in strict proportionality guarantees\nyet still provides good proportionality similar to the original Method of Equal\nShares. In the course of the analysis, we also discuss a fractional variant of\nthe method which allows for partial funding of projects.",
        "updated": "2024-09-23 13:30:25 UTC",
        "interpretation": "解释内容未找到",
        "id": "2409.15005v1"
    }
]