[
    {
        "title": "Comparing Traditional and LLM-based Search for Image Geolocation",
        "authors": "Albatool WazzanStephen MacNeilRichard Souvenir",
        "links": "http://dx.doi.org/10.1145/3627508.3638305",
        "entry_id": "http://arxiv.org/abs/2401.10184v1",
        "pdf_url": "http://arxiv.org/pdf/2401.10184v1",
        "summary": "Web search engines have long served as indispensable tools for information\nretrieval; user behavior and query formulation strategies have been well\nstudied. The introduction of search engines powered by large language models\n(LLMs) suggested more conversational search and new types of query strategies.\nIn this paper, we compare traditional and LLM-based search for the task of\nimage geolocation, i.e., determining the location where an image was captured.\nOur work examines user interactions, with a particular focus on query\nformulation strategies. In our study, 60 participants were assigned either\ntraditional or LLM-based search engines as assistants for geolocation.\nParticipants using traditional search more accurately predicted the location of\nthe image compared to those using the LLM-based search. Distinct strategies\nemerged between users depending on the type of assistant. Participants using\nthe LLM-based search issued longer, more natural language queries, but had\nshorter search sessions. When reformulating their search queries, traditional\nsearch participants tended to add more terms to their initial queries, whereas\nparticipants using the LLM-based search consistently rephrased their initial\nqueries.",
        "updated": "2024-01-18 18:12:28 UTC",
        "id": 1
    },
    {
        "title": "DualTake: Predicting Takeovers across Mobilities for Future Personalized Mobility Services",
        "authors": "Zhaobo ZhengKumar AkashTeruhisa Misu",
        "links": "http://dx.doi.org/10.1145/3610978.3640610",
        "entry_id": "http://arxiv.org/abs/2401.10175v1",
        "pdf_url": "http://arxiv.org/pdf/2401.10175v1",
        "summary": "A hybrid society is expected to emerge in the near future, with different\nmobilities interacting together, including cars, micro-mobilities, pedestrians,\nand robots. People may utilize multiple types of mobilities in their daily\nlives. As vehicle automation advances, driver modeling flourishes to provide\npersonalized intelligent services. Thus, modeling drivers across mobilities\nwould pave the road for future society mobility-as-a-service, and it is\nparticularly interesting to predict driver behaviors in newer mobilities with\ntraditional mobility data. In this work, we present takeover prediction on a\nmicro-mobility, with car simulation data.The promising model performance\ndemonstrates the feasibility of driver modeling across mobilities, as the first\nin the field.",
        "updated": "2024-01-18 18:03:07 UTC",
        "id": 2
    },
    {
        "title": "From Cash to Cashless: UPI's Impact on Spending Behavior among Indian Users",
        "authors": "Harshal DevRaj GuptaDhruv Kumar",
        "links": "http://arxiv.org/abs/2401.09937v1",
        "entry_id": "http://arxiv.org/abs/2401.09937v1",
        "pdf_url": "http://arxiv.org/pdf/2401.09937v1",
        "summary": "The emergence of digital payment systems has transformed how individuals\nconduct financial transactions, offering convenience, security, and efficiency.\nOne groundbreaking innovation making waves in the Indian financial landscape is\nthe Unified Payments Interface (UPI), developed by the National Payments\nCorporation of India (NPCI). Existing work has explored how digital payments\nbenefit a country's economy and GDP. However, our study explores how the\nintroduction of UPI has influenced spending behavior among Indian users on an\n\"individual\" level. We gathered 235 valid survey responses encompassing diverse\ndemographics and conducted semi-structured interviews with 20 survey\nrespondents. Approximately 75% of the survey respondents reported increased\nspending due to UPI, with only 7% indicating reduced spending. Significantly,\n91.5% of the respondents reported satisfaction with their UPI usage. Also 95.2%\nof the survey respondents found making payments via UPI convenient. Our\nresearch also provides suggestions for UPI applications and various\nstakeholders to enhance digital payment systems, enabling users to make\ninformed decisions and fostering responsible financial management.",
        "updated": "2024-01-18 12:39:53 UTC",
        "id": 3
    },
    {
        "title": "Experimental Shake Gesture Detection API for Apple Watch",
        "authors": "Ezequiel França dos Santos",
        "links": "http://arxiv.org/abs/2401.09896v1",
        "entry_id": "http://arxiv.org/abs/2401.09896v1",
        "pdf_url": "http://arxiv.org/pdf/2401.09896v1",
        "summary": "In this paper we present the WatchShaker project The project involves an\nexperimental API that detects the Apple Watchs shake gesturea surprisingly\nabsent natively feature Through a simple heuristic leveraging the Apple Watchs\naccelerometer data the API discerns not just the occurrence of shake gestures\nbut also their direction enhancing the interactivity potential of the device\nDespite the projects simplicity and lack of formal testing it has garnered\nsignificant attention indicating a genuine interest and need within the\ndeveloper community for such functionality The WatchShaker project exemplifies\nhow a minimalistic approach can yield a practical and impactful tool in\nwearable technology providing a springboard for further research and\ndevelopment in intuitive gesture recognition",
        "updated": "2024-01-18 11:20:39 UTC",
        "id": 4
    },
    {
        "title": "Enhanced Automated Quality Assessment Network for Interactive Building Segmentation in High-Resolution Remote Sensing Imagery",
        "authors": "Zhili ZhangXiangyun HuJiabo Xu",
        "links": "http://arxiv.org/abs/2401.09828v1",
        "entry_id": "http://arxiv.org/abs/2401.09828v1",
        "pdf_url": "http://arxiv.org/pdf/2401.09828v1",
        "summary": "In this research, we introduce the enhanced automated quality assessment\nnetwork (IBS-AQSNet), an innovative solution for assessing the quality of\ninteractive building segmentation within high-resolution remote sensing\nimagery. This is a new challenge in segmentation quality assessment, and our\nproposed IBS-AQSNet allievate this by identifying missed and mistaken segment\nareas. First of all, to acquire robust image features, our method combines a\nrobust, pre-trained backbone with a lightweight counterpart for comprehensive\nfeature extraction from imagery and segmentation results. These features are\nthen fused through a simple combination of concatenation, convolution layers,\nand residual connections. Additionally, ISR-AQSNet incorporates a multi-scale\ndifferential quality assessment decoder, proficient in pinpointing areas where\nsegmentation result is either missed or mistaken. Experiments on a newly-built\nEVLab-BGZ dataset, which includes over 39,198 buildings, demonstrate the\nsuperiority of the proposed method in automating segmentation quality\nassessment, thereby setting a new benchmark in the field.",
        "updated": "2024-01-18 09:42:47 UTC",
        "id": 5
    }
]